[
  {
    "id": "150084",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator",
    "description": "77 year old elderly man from a low-income background who is living alone requires a replacement refrigerator as his current one is old and malfunctioning.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Jocelyn Joy Gwee",
      "email": "Jocelyn@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "149080",
    "category": "Electrical Home Appliances",
    "name": "washing machine",
    "description": "We are seeking a donated washing machine for a client who is a single mother living with her daughter. She was just discharged from the halfway house a few months ago, realising that her washing machine is broken. She is working round the clock providing for her daughter and herself and is unable to handwash her clothes. Her daughter, who is a full-time student and on a nursing internship has little to no time to wash clothes as well. Without this essential appliance, she struggles to maintain proper hygiene whilst job searching and caring for her daughter. Any working washing machine would be greatly appreciated and would significantly help this family rebuild their lives.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Yishun",
      "name": "Ann Wende",
      "email": "wende_ann@msf.gov.sg",
      "phone": [
        "63765987",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "08 Oct 2025"
  },
  {
    "id": "150083",
    "category": "Electrical Home Appliances",
    "name": "Halal Fridge/Refrigerator",
    "description": "Client has been the main caregiver for her 12-year-old nephew since his birth, and they live with client's mother in a rental unit. Client's mother was the sole breadwinner but she had to stop working due to poor health. Client has been trying to take on ad-hoc jobs, which is barely enough to cover their basic needs. Client's mother intends to continue working once her health improves, and she has been medically compliant in the hopes that she will achieve that goal. Client is also hoping to find full-time employment once mother's health stabilises. Due to their current financial constraints, the family is seeking assistance for a halal fridge as their current fridge is no longer in working condition. Kindly WhatsApp me at 98598768 for further liaison, I will reply at my earliest convenience from 9am to 5pm on weekdays. Thank you!",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (East)",
      "name": "Nur Afrina",
      "email": "fsceast@ppis.sg",
      "phone": [
        "60156970"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150077",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "We are writing on behalf of a low-income family of five who urgently require a washing machine. Without one, they are faced with costly laundromat visits and time-consuming hand-washing, which places additional strain on their already limited budget. A washing machine would help ensure that the three young children have clean clothes for preschool and school whilst reducing ongoing expenses. If you are able to assist with a working washing machine or contribute towards purchasing one, your generosity would be greatly appreciated. Thank you.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Swathi Lakshmi",
      "email": "swathi_lakshmi@msf.gov.sg",
      "phone": [
        "63548517",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150076",
    "category": "Electrical Home Appliances",
    "name": "Clothes Dryer",
    "description": "The client is a single mom of 6 children, ages from 3 year old to 11 years old.\n\nThe client has been unemployed for more than 6 months but is working as an ad hoc delivery rider to earn an income to support her children.\n\nDue to the lack of financial support from her ex-husband, any donation of a clothes dryer would be a huge help and would allow her to have a dry and hygienic environment in her house.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150050",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Client and her family are currently facing financial challenges. Client is actively seeking employment after being terminated from her job in late August. Her husband who was involved in a bike accident around the same time, is currently on medical leave while recovering from his injuries. Due to the tight financial situation, the family is unable to replace their broken washing machine.",
    "specifications": null,
    "contact": {
      "org": "Singapore After Care Association",
      "name": "Lin Mingjie",
      "email": "mingjie@saca.org.sg",
      "phone": [
        "62942350"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150045",
    "category": "Electrical Home Appliances",
    "name": "Vacuum cleaner",
    "description": "Family hopes to get support in getting a workable vacuum cleaner. Father is a sole-breadwinner while Mother is a caregiver of 2 younger children and is unable to work due to heart conditions. Vacuum cleaner will be very helpful for the family in managing the cleanliness of the house. Donor to kindly cover transport arrangement and delivery cost please. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tasya Puspita Maulany",
      "email": "tasya@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150043",
    "category": "Electrical Home Appliances",
    "name": "Dryer",
    "description": "The family consists of the client, her husband, and their three young children (ages 1.5, 3, and 5). Due to caregiving responsibilities and health-related challenges, there is currently no income earner in the household. As a result, the family struggles to meet even their basic needs and relies heavily on both formal and informal support systems. Given their financial constraints, they are unable to afford repairs or replacements for these essential household appliances which they have requested support for. The family hopes to receive a clothes dryer. Donor to cover transport arrangement and delivery cost please. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tasya Puspita Maulany",
      "email": "tasya@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150041",
    "category": "Electrical Home Appliances",
    "name": "Rice cooker",
    "description": "The family consists of the client, her husband, and their three young children (ages 1.5, 3, and 5). Due to caregiving responsibilities and health-related challenges, there is currently no income earner in the household. As a result, the family struggles to meet even their basic needs and relies heavily on both formal and informal support systems. Given their financial constraints, they are unable to afford repairs or replacements for these essential household appliances which they have requested support for. The family hopes to receive a rice cooker to support the family in their meals . Donor to cover transport arrangement and delivery cost please. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tasya Puspita Maulany",
      "email": "tasya@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150034",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine cum dryer 10kg",
    "description": "Client and her husband are struggling to raise 4 young children with their limited finances due to low education level. Client’s family requires a new washing machine cum dryer as they do not have the finances to afford one and their current one has malfunctioned.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150002",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Client, 67yo is diagnosed with alzheimer's disease and is no longer able to work. He lives in a open market rental room with his foreigner wife. They recently secured their rental flat and require some household necessities as they are financially tight. They are keen to receive donation for a washing machine. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "149954",
    "category": "Electrical Home Appliances",
    "name": "Large Rice Cooker (Halal)",
    "description": "Client is low-income mother with special needs and chronic health condition. Her current rice cooker is spoilt after her sons damaged the rice cooker in an argument. If you have a suitable item please reach out to us at 6843 9619 thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149929",
    "category": "Electrical Home Appliances",
    "name": "Washing machine",
    "description": "Elderly recently discharged from hospital, needs help with washing clothes due to breathlessness. Previously handwashes clothes, but currently no longer able to do so due to deteriorating health.",
    "specifications": null,
    "contact": {
      "org": "NTUC Health Co-operative Limited",
      "name": "Audrina Tan",
      "email": "audrina.t1@ntuchealth.sg",
      "phone": [
        "84816649",
        "67156715"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149928",
    "category": "Electrical Home Appliances",
    "name": "Microwave",
    "description": "This is a family of 5 school-going children. Both parents are struggling with medical concerns and relying on financial assistance. Their microwave was recently faulty, they would require a new one.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Clarice Lim",
      "email": "claricelim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149882",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator/Fridge",
    "description": "Family of 2, consisting single mother client and 1-year old child, relies on her income, which has been ad-hoc due to her caregiving duties. They will be newly moving into a 1-room HDB rental flat and require a refrigerator for their basic daily living.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Sengkang, Serangoon &amp; Hougang",
      "name": "Lisette Tan",
      "email": "lisette_tan@msf.gov.sg",
      "phone": [
        "63548217",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Oct 2025"
  },
  {
    "id": "149839",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "I am reaching out to seek support for my client, a mother of two young infants, who is currently in need of a washing machine to assist with her household and childcare needs. Please contact me at 8859 5662 if you can help my client. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Viriya Family Service Centre",
      "name": "Grace Ang",
      "email": "grace_ang@viriya.org.sg",
      "phone": [
        "62855033",
        "62858033"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149835",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator",
    "description": "Client is an unemployed single mother with severe varicose veins condition and caring for teenager. Client needs a new fridge as current fridge is leaking.",
    "specifications": "350L-500L",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Emma Zhang",
      "email": "emmazhang@fycs.org",
      "phone": [
        "69783022",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149831",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Client is from a family of 7, with 5 young children. Due to medical condition, he is unable to hold a job currently and spouse is the sole bread winner. Due to limited financial resources, receiving a washing machine would be very helpful for them.",
    "specifications": "10kg load, top loading",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Yew Tee",
      "name": "Teo Xin Yi",
      "email": "teoxinyi@fycs.org",
      "phone": [
        "64162161",
        "64162162"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149821",
    "category": "Electrical Home Appliances",
    "name": "Fridge",
    "description": "The family consists of a daughter in her 40s and a mother in her late 70s. Both are homebound due to their medical conditions that causes them to have limitations in their mobility and they would regularly experience light-headedness that could potentially cause them to fall.\n\nAs both are not able to work, they are currently relying on some government payout and financial assistance. They would purchase some groceries and would cook meals and place their meals in the fridge to last them for a few days.They would also place some food items for prayers in their fridge as well. \n\nAs their fridge are not functioning well lately, they would like to seek some help in getting a new fridge (as they are strict vegetarian) so that they could continue to store their meals and prayer items in the fridge. Thank you!",
    "specifications": "(w X h X d): 545 X 1700 X 625mm",
    "contact": {
      "org": "Viriya Family Service Centre",
      "name": "Lim Hui Yan",
      "email": "huiyan_lim@viriya.org.sg",
      "phone": [
        "62858033"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149812",
    "category": "Electrical Home Appliances",
    "name": "Fridge",
    "description": "Family comprises a single mother and her daughter. Mother has health issues and hence faces increased expenses, but is continuing work to maintain their household expenses. Their refrigerator has spoiled and they require a new one to store their food items.",
    "specifications": "29inch",
    "contact": {
      "org": "MSF Social Service Office @ Jalan Besar and Toa Payoh",
      "name": "Emilyn Teo",
      "email": "emilyn_teo@msf.gov.sg",
      "phone": [
        "67087820",
        "62957205"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149801",
    "category": "Electrical Home Appliances",
    "name": "Microwave",
    "description": "Client is of low income and was previously incarcerated. He is now committed to living drug-free and starting a new life. His microwave has stopped working, and he relies on it to prepare simple daily meals. Receiving a replacement will greatly support his basic needs and efforts to rebuild his life.",
    "specifications": "Any",
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Harry Muhammad Shahari Bin Suhaimi",
      "email": "harrysuhaimi@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149800",
    "category": "Electrical Home Appliances",
    "name": "Microwave",
    "description": "Client is of low income and was previously incarcerated. He is now committed to living drug-free and starting a new life. His microwave has stopped working, and he relies on it to prepare simple daily meals. Receiving a replacement will greatly support his basic needs and efforts to rebuild his life.",
    "specifications": "Any",
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Harry Muhammad Shahari Bin Suhaimi",
      "email": "harrysuhaimi@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149789",
    "category": "Electrical Home Appliances",
    "name": "7/8 kg top load washing machine",
    "description": "Client is a single mother currently living with her 2-year-old daughter. At present, she is unemployed and facing challenges in securing a job that aligns with her caregiving responsibilities. Nevertheless, she is actively seeking employment opportunities that offer flexibility to accommodate her role as a primary caregiver. Additionally, a washing machine would significantly ease her financial burden. She currently does her laundry outside of her home, which adds to her expenses and daily responsibilities. Having access to a washing machine would help reduce these costs and support her in managing her household more efficiently. can whatsapp 6038 4091 if you are keen to arrange transport and cover delivery cost.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149778",
    "category": "Electrical Home Appliances",
    "name": "2 Burner Electric Stove",
    "description": "CT has been diagnosed with stage 4 lung cancer, which has recently spread to her brain, and she is now under palliative care. As a result, she is unfit to work. Throughout her life, CT has devoted herself to caring for her parents. Following their passing, the family home had to be returned to HDB under the buyback scheme. Consequently, CT is now required to move out. While she has managed to secure a rental flat, she does not have sufficient financial resources to purchase the essential items needed for her new home. Your support at this juncture would greatly ease her transition and ensure that she can focus on her health and well-being without the added burden of financial strain.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149764",
    "category": "Electrical Home Appliances",
    "name": "Oven",
    "description": "Beneficiary is a senior with mobility issues as he is recovering from hip replacement surgery. He is not working and relies on SSO assistance. Would like to have an oven to heat up/bake dishes so as to save some money",
    "specifications": null,
    "contact": {
      "org": "Allkin Singapore's Active Ageing Centre @ Ang Mo Kio 469",
      "name": "Kei Ng",
      "email": "ngkhuankungkei@allkin.org.sg",
      "phone": [
        "60384367",
        "64510898"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "148867",
    "category": "Electrical Home Appliances",
    "name": "2-Burner Electric Stove",
    "description": "Client has been diagnosed with stage 4 lung cancer and she is now under palliative care. As a result, she is unfit to work. She does not have sufficient financial resources to purchase the essential items needed for her new home.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149745",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "We are reaching out on behalf of a single-parent family of six who urgently needs a washing machine.\n\nWithout one, they face expensive laundromat trips and time-consuming hand-washing, straining their already tight budget. A washing machine would help ensure the five children have clean clothes for school whilst reducing ongoing expenses.\n\nIf you can help with a working washing machine or contribute towards one, your kindness would be deeply appreciated. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Swathi Lakshmi",
      "email": "swathi_lakshmi@msf.gov.sg",
      "phone": [
        "63548517",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149743",
    "category": "Electrical Home Appliances",
    "name": "Fridge",
    "description": "Couple is living in a rental flat. Husband is 57, wife is 63. Husband is unable to work due to his heart condition which requires him to wear a portable heart pump 24/7. Wife is facing difficulty with finding a suitable employment due to her diagnosis of early Dementia. Preferably looking for a bottom freezer fridge for husband to have easier access to the fridge compartment as he cannot bend down.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Yishun",
      "name": "Samuel Chan",
      "email": "samuel.chan@montfortcare.org.sg",
      "phone": [
        "96423819",
        "64848040"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149727",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine (front load)",
    "description": "Low-income family comprising of single mum and 2 children living in a rental unit is looking for a washing machine to replace their faulty one. If you are able to help, please contact Jessie at 96433400 or email jessielim@fycs.org. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - Restorative Care Department",
      "name": "Jessie Lim",
      "email": "jessielim@fycs.org",
      "phone": [
        "96433400",
        "91708900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149719",
    "category": "Electrical Home Appliances",
    "name": "Portable Air Con",
    "description": "Family consisting of 4 school going children, hopes to receive a portable air con to keep their home cool. Father who was the sole breadwinner of the family is looking for a job but has not been successful. They are relying on Comcare for their necessities.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149714",
    "category": "Electrical Home Appliances",
    "name": "refrigerator",
    "description": "Client is a 60 year old elderly who is wheelchair bound with multiple health conditions. She is residing with her 17 year old son who is certified as her main caregiver and currently waiting for his NS enlistment. Family is living in a 2 room rental flat and mainly relies on Comcare financial assistance to meet their daily needs. Their refrigerator has recently broken down and they are unable to afford a replacement. Family urgently requires a fridge to store their daily food supplies.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Yishun",
      "name": "Ann Wende",
      "email": "wende_ann@msf.gov.sg",
      "phone": [
        "63765987",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "146876",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine (Top Load)",
    "description": "The family is experiencing financial hardship and lacks support from their FOO due to strained relationships. The couple is expecting a child soon and are unable to afford several essential items.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149666",
    "category": "Electrical Home Appliances",
    "name": "Midea 548L Side-by-Side Fridge - Black",
    "description": "The client and his spouse with three school-going teenage children (aged 13-17) live in a HDB rental flat. The parents run a school canteen stall which is the main source of income. Recently, their fridge (which is essential for storing the fresh ingredients they use daily) broke down. Without it, food preparation for the stall has become very difficult, and their ability to earn is directly impacted. It is especially challenging during school holidays when the stall is closed, and there is no income at all.  Fridge model to be used at home for the food business. It needs sufficient storage space and cooling capacity (3 ticks for energy efficiency otherwise will incur high utility bills). The family is unable to afford a replacement fridge and unable to fix the spoilt fridge. Your donation will help ease their daily struggles and empower this family to keep going.",
    "specifications": "180x90x75cm",
    "contact": {
      "org": "MSF Social Service Office @ Tampines, Punggol  &amp; Pasir Ris",
      "name": "Dolly Wong",
      "email": "dolly_wong@msf.gov.sg",
      "phone": [
        "63153661",
        "64244017"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149665",
    "category": "Electrical Home Appliances",
    "name": "Halal certified microwave oven",
    "description": "Family consists of a young mother, her husband and two-year-old toddler who reside in a two-room public rental flat. The toddler, born prematurely, requires a specialised diet for proper development. The family relies entirely on the husband's income and struggles with daily living expenses. Receiving support through a microwave oven would help reduce their living costs whilst ensuring the toddler receives the necessary nutritional support required for their condition.",
    "specifications": "456 x 343 x 264 mm",
    "contact": {
      "org": "MSF Social Service Office @ Sengkang, Serangoon &amp; Hougang",
      "name": "Andre Lim",
      "email": "andre_lim@msf.gov.sg",
      "phone": [
        "63153658",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149660",
    "category": "Electrical Home Appliances",
    "name": "refrigerator",
    "description": "Hi, one of my elderly client who is living alone in a rental flat in Bukit Merah View has requested a 2 Door Refrigerator + Freezer (new or newly condition). Please deliver the item directly to his home. Thanks",
    "specifications": "2 Door Refrigerator + Freezer",
    "contact": {
      "org": "NTUC Health Community of Care",
      "name": "Dickson Loi",
      "email": "dickson.l@ntuchealth.sg",
      "phone": [
        "94552174",
        "66942742"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149659",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Hi, one of my elderly client is living alone in a rental block in Bukit Merah View. He needs a top load 6kg washing machine (new or newly condition) to help him improve his personal hygiene. Please deliver the item to the client home directly. Thanks.",
    "specifications": "6kg top load",
    "contact": {
      "org": "NTUC Health Community of Care",
      "name": "Dickson Loi",
      "email": "dickson.l@ntuchealth.sg",
      "phone": [
        "94552174",
        "66942742"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149651",
    "category": "Electrical Home Appliances",
    "name": "Crown Gas Stove",
    "description": "Client's single stove has broken down. Client is a single mother staying with her sick elderly mother and her son in a 2 room rental flat. They are financially unable to afford a new stove and cannot cook meals for themselves due to the stove's issues.",
    "specifications": "Single Stove",
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Regina Leong",
      "email": "regina@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149644",
    "category": "Electrical Home Appliances",
    "name": "1 ceiling fan",
    "description": "Client and her husband have four children and client is currently pregnant with her 5th child. Despite the client and her husband are working, they have incurred a lot of debts from banks, licensed money lenders, friends and relatives, to the extend they do not have the financial means to buy the basic household items.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149643",
    "category": "Electrical Home Appliances",
    "name": "2 water heaters for showering",
    "description": "Client and her husband have four children and client is currently pregnant with her 5th child. Despite the client and her husband are working, they have incurred a lot of debts from banks, licensed money lenders, friends and relatives, to the extend they do not have the financial means to buy the basic household items.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149631",
    "category": "Electrical Home Appliances",
    "name": "Air purifier",
    "description": "Family with6 children, and staying in a HDB rental flat. Father is the sole breadwinner. Family requires an air purifier as they own pet cats (which are for regulating children's emotions and wellbeing) and has family members that has eczema.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "24 Sep 2025"
  },
  {
    "id": "149618",
    "category": "Electrical Home Appliances",
    "name": "Printer",
    "description": "Family of 5 with 3 school-going children who requires a printer to help with printing documents for job applications and school-related forms at home, instead of printing them outside or at the school's general office. Would greatly appreciate if donor is able to cover transport expenses.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "24 Sep 2025"
  },
  {
    "id": "149615",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Client is has just been released from Prison. His current Washing Machine is spoilt and he is unable to afford a  new one due to financial difficulties. Donation of a Washing Machine will be helpful to Client. Please WhatsApp Rina at 8666 1352 or email to rinaprasad@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "24 Sep 2025"
  },
  {
    "id": "149608",
    "category": "Electrical Home Appliances",
    "name": "Cooking stove",
    "description": "Client recently relocated to a new rental unit. She requires a dining table and 4 chairs for her new home. She prefers the tables and chairs to be black. Client also needs a new cooking stove as her previous old is faulty.\n \nClient's husband is incarcerated and not able to provide financial support. Client also does not receive any support from her family of origin. Client has stopped working for a month to prepare for the relocation and does not have enough savings. Client is main caregiver and sole breadwinner for her two sons aged 2 and 14 years old",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Yishun",
      "name": "Loretta Chan",
      "email": "loretta_chan@msf.gov.sg",
      "phone": [
        "67569127",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149601",
    "category": "Electrical Home Appliances",
    "name": "Air Purifier",
    "description": "Family of 5 with 3 school-going children staying in a 2-room rental flat requires an air purifier for one of the child that has eczema . Mum is working odd jobs and this air purifier will benefit the family's living condition. Would greatly appreciate if donor is able to cover transport expenses.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149600",
    "category": "Electrical Home Appliances",
    "name": "Microwave",
    "description": "Client is a single male in his 50s who requires a microwave, as his existing one has recently broken down. \n\nDue to health issues, he has been unable to maintain stable employment, resulting in irregular income that makes it challenging to meet his daily needs.",
    "specifications": null,
    "contact": {
      "org": "FRCS Family Service Centre",
      "name": "Hillary Heng",
      "email": "hillary@frcsfsc.sg",
      "phone": [
        "67799488ext54",
        "67799488"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149594",
    "category": "Electrical Home Appliances",
    "name": "7/8kg top load washing machine",
    "description": "Client is a single mother currently living with her 2-year-old daughter. At present, she is unemployed and facing challenges in securing a job that aligns with her caregiving responsibilities. Nevertheless, she is actively seeking employment opportunities that offer flexibility to accommodate her role as a primary caregiver. Additionally, a washing machine would significantly ease her financial burden. She currently does her laundry outside of her home, which adds to her expenses and daily responsibilities. Having access to a washing machine would help reduce these costs and support her in managing her household more efficiently. can whatsapp 6038 4091 if you are keen to arrange transport and cover delivery cost.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "146785",
    "category": "Electrical Home Appliances",
    "name": "Wet and Dry Vacuum Cleaner",
    "description": "Client is a 71 year old senior staying alone. She requires a wet and dry vacuum cleaner that will allow her to carry out housekeeping more easily especially considering her numerous medical conditions that cause her to be drained from physical activities faster. She would prefer a brand new wet and dry vacuum cleaner. Please contact me at 82922215 for further information. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK CREST @ Tanjong Pagar-Tiong Bahru",
      "name": "Nur Dinie Izzati Binte Yaziz",
      "email": "NurDinie.Izzati@thkmc.org.sg",
      "phone": [
        "69240367",
        "69242951"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149569",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine (front load)",
    "description": "Household of 3 (including a pri school child) living in rental flat dependent on public assistance. No income earners in the family presently due to accident that led to disability and is in the midst of recovery. Washing machine has broken down and currently using laundromat services, require a replacement which the family cannot afford.",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Muhammad Suffian Bin Bahrin",
      "email": "muhammadsuffian@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "22 Sep 2025"
  },
  {
    "id": "149524",
    "category": "Electrical Home Appliances",
    "name": "TV (32-inch Smart TV and TV box)",
    "description": "Low-income family's current television is faulty. Family consists of school-going children. Requires a replacement of their current television (32-inch smart tv, and tv box - if required).",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149518",
    "category": "Electrical Home Appliances",
    "name": "Microwave",
    "description": "Family consist of a single mother and her pre-school age son. They just moved into their new rental flat and is looking for a microwave to heat up their food.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Jalan Besar and Toa Payoh",
      "name": "Grace Lim",
      "email": "grace_lim@msf.gov.sg",
      "phone": [
        "68590811",
        "62957205"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "131964",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "A nuclear family with 3 children. The husband who has profound hearing loss since young, has been a sole breadwinner of the family, and his wife has been the housewife. She has several physical health problems, such as severe partial blindness, high blood pressure, diabetes, and high cholesterol. The family lived in a HDB 3-room flat with no limited home furnishing.",
    "specifications": "Any",
    "contact": {
      "org": "Lakeside Family Centre - Jurong East",
      "name": "Angeline Lim",
      "email": "angeline-lim@lakeside.org.sg",
      "phone": [
        "65649722ext210",
        "65649722"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Sep 2025"
  },
  {
    "id": "149480",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "A family of five resides in a 2-room rental flat. The household includes three children aged 5, 10, and 17. The father is the sole breadwinner, working as a GrabFood delivery rider with a variable and unstable income. The mother is a full-time caregiver to their youngest child, who has been diagnosed with autism and ADHD. The family is currently facing considerable financial stress and is managing multiple loan repayments.\nRecently, the client’s 1-year-old grandson moved in with them after his mother was incarcerated, adding to the family's caregiving responsibilities and household expenses.\n\nThe family is requesting support for a replacement television, as their current one has broken down. Given their financial constraints, they are unable to afford a new set. The TV serves as an important source of entertainment and educational content for the children, particularly the youngest child with special needs, who benefits from structured and familiar routines.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149470",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator",
    "description": "A family of four supported by elderly grandparents as requires a new fridge as their current one is faulty and unable to keep food fresh. The grandfather is undergoing dialysis, while the grandmother continues to work daily despite her age and existing health conditions.",
    "specifications": "Medium",
    "contact": {
      "org": "Club Rainbow (Singapore)",
      "name": "Nurulhuda Binte Abu Bakar",
      "email": "nurul@clubrainbow.org",
      "phone": [
        "81336189",
        "63771789"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149454",
    "category": "Electrical Home Appliances",
    "name": "Water heater (toilet)",
    "description": "Family of 8 children, living in a rental flat requiring a new water heater to shower.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Kreta Ayer Family Services",
      "name": "Nadiah Razak",
      "email": "nadiah.razak@montfortcare.org.sg",
      "phone": [
        "63254753"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149446",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator",
    "description": "A family with three young children, residing in a rental flat, has requested a refrigerator as their current one is faulty. Please note that the refrigerator should be halal-compliant, as the family is Muslim.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Yew Tee",
      "name": "Sherlyn Chan",
      "email": "sherlynchan@fycs.org",
      "phone": [
        "64162183",
        "64162162"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Sep 2025"
  },
  {
    "id": "149425",
    "category": "Electrical Home Appliances",
    "name": "Fridge",
    "description": "Seeking for a new fridge for two senior co-tenants (F/73 and F/77) who are relocating under the SERS programme in Oct.\nTheir current fridge is no longer functioning and will be discarded. A new fridge is essential to ensure proper food storage and to prevent contamination or spoilage, which can pose serious health risks. Any support with a new fridge would be greatly appreciated. Thank you for making a difference! To support, please WhatsApp Elaine at 8777 0960 or email elaine.fu@thkmc.org.sg\"",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149421",
    "category": "Electrical Home Appliances",
    "name": "Smart TV",
    "description": "Low income family with 3 children, living in public rental flat, is looking for donation of a smart TV to replace their current faulty one. Please Whatsapp Fang Ling at 8588 6196 or email fangling.koh@thkmc.org.sg to liase.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149419",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "Sole breadwinner went to prison leaving wife and 2 young kids with no income. Kids are still on waitlist for preschool and wife uses television programmes to help with the kids' phonics. However, television recently malfunctioned and they are unable to afford a new one.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Geylang Serai",
      "name": "Ashikin Hazlan",
      "email": "ashikin_hazlan@msf.gov.sg",
      "phone": [
        "62319440",
        "62438753"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149404",
    "category": "Electrical Home Appliances",
    "name": "Mini Freezer",
    "description": "Single mother would like to start a home based business to supply home-made drinks. This is to supplement her income and to repay her credit loans.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Geylang Serai",
      "name": "Ashikin Hazlan",
      "email": "ashikin_hazlan@msf.gov.sg",
      "phone": [
        "62319440",
        "62438753"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149382",
    "category": "Electrical Home Appliances",
    "name": "Tv Box",
    "description": "Senior is living alone and only gets to watch a channel for passing time. Senior mentioned that she wants to have more channels to watch in order to pass time but has no funds to buy.",
    "specifications": null,
    "contact": {
      "org": "NTUC Health Cluster Support - Taman Jurong",
      "name": "Aaron Cai",
      "email": "yuxiang.c@ntuchealth.sg",
      "phone": [
        "94552302",
        "62674197"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149377",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "\"A family of five resides in a 2-room rental flat. The household includes three children aged 5, 10, and 17. The father is the sole breadwinner, working as a GrabFood delivery rider with a variable and unstable income. The mother is a full-time caregiver to their youngest child, who has been diagnosed with autism and ADHD. The family is currently facing considerable financial stress and is managing multiple loan repayments.\nRecently, the client’s 1-year-old grandson moved in with them after his mother was incarcerated, adding to the family's caregiving responsibilities and household expenses.\nThe family is requesting support for a replacement television, as their current one has broken down. Given their financial constraints, they are unable to afford a new set. The TV serves as an important source of entertainment and educational content for the children, particularly the youngest child with special needs, who benefits from structured and familiar routines.\"",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Soh Yong Sheng",
      "email": "sohyongsheng@fycs.org",
      "phone": [
        "69783086",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149375",
    "category": "Electrical Home Appliances",
    "name": "Handheld vacuum cleaner",
    "description": "Client is a single mother with 2 young children aged 6yo and 4yo. She is not working as she has social anxiety and is currently undergoing cancer treatment. The after effects of the treatment causes hair loss and fatigue. Client hopes to have a handheld vacuum which is more portable and also an air purifier for her child who has sensitive skin and airways.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Yvonne Pua",
      "email": "yvonne_pua@msf.gov.sg",
      "phone": [
        "67367431",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149329",
    "category": "Electrical Home Appliances",
    "name": "Fridge",
    "description": "The family recently moved to a rental flat. mom and elder daughter work part-time, while the younger child is still in school. Their fridge has broken down, and they are in need of a replacement.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Hanissah Abdullah",
      "email": "hanissah@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149326",
    "category": "Electrical Home Appliances",
    "name": "Top Load washing machine",
    "description": "Elder lady would appreciate top load washing machine as she cant bend over for the front load washing machine",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Hanissah Abdullah",
      "email": "hanissah@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149299",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator (from Muslim Family)",
    "description": "The family’s sole breadwinner of 12 is facing financial difficulties in replacing their faulty refrigerator. They hope to replace it soon so that they can store groceries and save the cost of takeaway.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Sep 2025"
  },
  {
    "id": "149282",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Low-income family living in a HDB rental house with children aged 4 and 9mths requires as washing machine as the drying function on their current machine is unserviceable.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Tampines, Punggol  &amp; Pasir Ris",
      "name": "Benedict Cheong",
      "email": "Benedict_YS_CHEONG@msf.gov.sg",
      "phone": [
        "63547692",
        "64244017"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149281",
    "category": "Electrical Home Appliances",
    "name": "Smart Television",
    "description": "Single mother with a school-going child is requesting a Smart TV, as they do not have a TV subscription. With limited income, they are unable to afford one. A TV would offer moments of rest and bonding at home.",
    "specifications": null,
    "contact": {
      "org": "Club Rainbow (Singapore)",
      "name": "Nurulhuda Binte Abu Bakar",
      "email": "nurul@clubrainbow.org",
      "phone": [
        "81336189",
        "63771789"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149278",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Family of 4 with young children lives in a public rental flat with other family members, seeking assistance for a washing machine as the current one has worn out. A donation of a washing machine would greatly assist in helping them reducing their expenses. For further details, do reach out to Ignatius at 87188452 or ignatius.pereira@thkmc.org.sg.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149266",
    "category": "Electrical Home Appliances",
    "name": "Gas cooking stove (Length: 78cm, Width: 44cm)",
    "description": "Client is staying with her 2 adult daughters and due to the family’s health issues, they are unemployed and facing financial difficulty. The family has a gas cooking stove which is recently spoilt. As they do not have the financial means to buy a new gas cooking stove, they are hoping to get a donated one from Pass-It-On.",
    "specifications": "(Length: 78cm, Width: 44cm)",
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149261",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator 420L",
    "description": "The female client, 37yo, is separated & in the midst of divorce, with 4 children. They are living in a HDB 2-room rental unit in Woodlands. As the client is presently unemployed, she has requested for help as most of her 2nd items at home is old and giving way.",
    "specifications": "420L",
    "contact": {
      "org": "Care Corner Family Service Centre - Admiralty",
      "name": "Shanell Tan",
      "email": "shanelltan@carecorner.org.sg",
      "phone": [
        "63658751"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149260",
    "category": "Electrical Home Appliances",
    "name": "Double Burner stainless steel table cooker (for LP Gas)",
    "description": "The female client, 37yo, is separated & in the midst of divorce, with 4 children. They are living in a HDB 2-room rental unit in Woodlands. As the client is presently unemployed, she has requested for help as most of her 2nd items at home is old and giving way",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Admiralty",
      "name": "Shanell Tan",
      "email": "shanelltan@carecorner.org.sg",
      "phone": [
        "63658751"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149251",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Individual supports a household of 10. However, step-father is receiving treatment for terminal cancer and mother is supporting her mother. \n\nHence, she has to be the caregiver for her younger siblings and her own child as she is a divorcee.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Kenneth Lim",
      "email": "kenneth_ky_lim@msf.gov.sg",
      "phone": [
        "68590828",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149203",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine 5 to 7KG",
    "description": "Family of 4 recently move to their new rental flat, looking for a working washing machine as their donated one had spoiled within 2 weeks and unable to afford a new one as they had spend on other furnishings.",
    "specifications": "Front Load Washing Machin 5-7Kg",
    "contact": {
      "org": "Hougang Sheng Hong Family Service Centre",
      "name": "Putri Illiyana",
      "email": "putri@shenghong.org.sg",
      "phone": [
        "62895022"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149200",
    "category": "Electrical Home Appliances",
    "name": "Smart TV",
    "description": "Family of 5 (3 children below the age of 4). Low-income family living in rental flat, their currently tv is faulty, and they are unable to afford to buy a new tv. the family spends their time watching the television together.",
    "specifications": null,
    "contact": {
      "org": "REACH Family Service Centre",
      "name": "Rebecca Yeong",
      "email": "rebecca.yeong@reach.org.sg",
      "phone": [
        "68010700",
        "62522566"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "145206",
    "category": "Electrical Home Appliances",
    "name": "Smart TV",
    "description": "Ct is a widow with multiple medical conditions, and wheelchair-bound. She is also the caregiver of her 3yo grandson. The family's TV is spoilt, and she would like to request for another one, as it is a means to engage 3yo when he is not in school, and she needs to rest.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149167",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "Young single mother for 2 children. She was previously unable to sustain employment due to past family violence concerns at home. She has recently moved out to her own HDB rental flat and started her new employment, but requires financial support in assisting her with basic furnishings for her new rental flat in view of her financial constraints.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149165",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Unemployed elderly and is not ADL-independent, currently relying on helper. However, she has run out of funds to afford helper.She requires a new washing machine to replace the broken one.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149164",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "Unemployed elderly and is not ADL-independent, currently relying on helper. However, she has run out of funds to afford helper and is stress on of involvement with daughter.She requires a new television to replace the household items that have broken",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149133",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Client (M/57) is currently unemployed and has chronic medical conditions. He lives in a 2 room rental flat with a family of 5. The family is facing financial hardship and is struggling to afford functional home appliances. For further details, feel free to reach out to Kritikaa at 8777 0959 or email to kritikaa.subramaniam@thkmc.org.sg to liase. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149127",
    "category": "Electrical Home Appliances",
    "name": "Household items - Television & Fridge",
    "description": "Client is currently staying on his own in a 2 room rental flat. He is looking for a 2nd hand television and fridge as his current ones are spoilt. He would benefit from such items being donated to him.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care COMIT @ Kreta Ayer",
      "name": "Donavan Lai",
      "email": "donavan.lai@montfortcare.org.sg",
      "phone": [
        "91726709",
        "97115240"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149117",
    "category": "Electrical Home Appliances",
    "name": "Refrigerator",
    "description": "Client is an ex-offender living alone in a 1-room rental flat. He is unemployed and actively seeking employment. His current Refrigerator is spoilt and he is unable to afford a  new one due to financial difficulties. Donation of a Refrigerator will be helpful to Client. Please WhatsApp Rina at 8666 1352 or email to rinaprasad@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149105",
    "category": "Electrical Home Appliances",
    "name": "Washing machine",
    "description": "Family comprises a single mother with medical conditions, with daughter as her sole caregiver. Their washing machine has not been working for over a year, and daughter has to hand wash their clothes on top of school, other household chores and caregiving for her mother. A working washing machine will greatly improve their daily living.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Jalan Besar and Toa Payoh",
      "name": "Emilyn Teo",
      "email": "emilyn_teo@msf.gov.sg",
      "phone": [
        "67087820",
        "62957205"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "150082",
    "category": "Home Furnishing",
    "name": "Kitchen Cabinet",
    "description": "Seeking for kitchen cabinet to accommodate essential electrical appliances (e.g., induction cooker and kettle) for two senior co-tenants, aged F/73 and F/77, who have leg mobility challenges. They will be relocating under the SERS programme this October. Their new rental unit does not come equipped with a stove area, and a kitchen cabinet would greatly enhance their ability to prepare meals safely and independently. Your kind assistance will make a meaningful difference in their daily living. To support, please WhatsApp Elaine at 8777 0960 or email elaine.fu@thkmc.org.sg",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150081",
    "category": "Home Furnishing",
    "name": "Queensized Bed with Mattress",
    "description": "Client is a mother of two teenage daughters. She is not able to work due to slipped disc issues. Her husband is working doing grab deliveries. The family faces significant financial stressors and have incurred a lot of debts. Please Whatsapp Ameena at 8718 8444 or email siti.ameena@thkmc.org.sg to liase.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150080",
    "category": "Home Furnishing",
    "name": "Queen Size Bed with Storage & Mattress",
    "description": "Family of 4, client, a widow, is the caregiver and sole breadwinner to her three school going children. Their current bed is currently broken. As family is unable to afford the purchase of a new bed, family hopes to receive donation of a queen size bed with storage and mattress. Kindly WhatsApp me from 9-5pm on weekdays at 98598768 on further liaison on delivery address etc. Thank you!",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (East)",
      "name": "Nur Afrina",
      "email": "fsceast@ppis.sg",
      "phone": [
        "60156970"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150079",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client is a mother of two teenage daughters. She is not able to work due to slipped disc issues. Her husband is working doing grab deliveries. The family faces significant financial stressors and have incurred a lot of debts. Please Whatsapp Ameena at 8718 8444 or email siti.ameena@thkmc.org.sg to liase.",
    "specifications": "4 Door",
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150078",
    "category": "Home Furnishing",
    "name": "Mattress",
    "description": "Client (F/70), a retiree, were one of the Henderson residents who were under HDB’s relocation exercise. However, client has yet to begin packing her belongings for the move due to experiencing anxiety over having to pack her items on her own. Additionally, HDB had provided a dateline of Sept 2025, which further intensified client's anxiety. To increase her anxiety, client does not appear to have any form of familial support to seek support from. \nClient currently lives alone in a 2-room rental flat and is experiencing significant cluttering issues, causing furnitures to wear out due to longevity of use. The cluttering of items also stress client out as she was alone and was unable to do it alone. Therefore, with the help of these new items, it would alleviate client's anxiety and help smoothen her journey to this very upsetting relocation exercise. Please Whatsapp Syafinaz at 8777 0958 or email to nur.syafinaz@thkmc.org.sg to liase.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150074",
    "category": "Home Furnishing",
    "name": "Queen-Sized Mattress",
    "description": "A young single mother for 2 children is currently unemployed due to prior family violence concerns that limited her bandwidth in staying in stable employment. Client has recently moved out to her own HDB rental flat and requires support in assisting her with furnishing her new rental flat with basic essentials while she tries to secure a stable employment.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150072",
    "category": "Home Furnishing",
    "name": "Dining Table",
    "description": "A young single mother for 2 children is currently unemployed due to prior family violence concerns that limited her bandwidth in staying in stable employment. Client has recently moved out to her own HDB rental flat and requires support in assisting her with furnishing her new rental flat with basic essentials while she tries to secure a stable employment.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150070",
    "category": "Home Furnishing",
    "name": "Storage Shelf",
    "description": "Client has multiple mental and physical health condition which she continues receiving support from hospital for. As a result, Client has not been able to work for years. The shelf is to enable her to be able to tidy up her belongings with more ease.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150053",
    "category": "Home Furnishing",
    "name": "TV Console",
    "description": "Single mother of 1.5 year old child who just moved into her public rental flat. Requires a TV console to fill her empty home. Juggles between part-time job and caregiving.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Jalan Besar and Toa Payoh",
      "name": "Heriyati Kasmani",
      "email": "heriyati_kasmani@msf.gov.sg",
      "phone": [
        "63550089",
        "62957205"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150052",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Single mother of 1.5 year old child who just moved into her public rental flat. Requires a wardrobe to organize their clothes. Juggles between part-time job and caregiving.",
    "specifications": "2 or 3-door wardrobe",
    "contact": {
      "org": "MSF Social Service Office @ Jalan Besar and Toa Payoh",
      "name": "Heriyati Kasmani",
      "email": "heriyati_kasmani@msf.gov.sg",
      "phone": [
        "63550089",
        "62957205"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150005",
    "category": "Home Furnishing",
    "name": "Cabinet with Glass Door",
    "description": "The household require cabinet to place to be placed in the kitchen",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150001",
    "category": "Home Furnishing",
    "name": "Sofa Bed",
    "description": "Client is married with 2 young children (F/1, M/0) and the family of 4 is living together in a 2 room rental flat. The family would like to request for a sofa bed because F/1 likes to fall asleep on the couch instead of the bed and has fallen off the couch multiple times. For the child's safety, the family would like a sofa bed so that the child can sleep on the sofa bed without the parents having to worry about the child's safety. Parents are extremely hardworking and both have recently found full-time jobs and is working hard to support the family but have yet to receive their salary and are struggling financially at present.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Sengkang, Serangoon &amp; Hougang",
      "name": "Belle Teo",
      "email": "belle_teo@msf.gov.sg",
      "phone": [
        "63548976",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "149967",
    "category": "Home Furnishing",
    "name": "queen size bed with storage",
    "description": "Family with 2 young children staying in a 2-room flat  hopes to receive a donated queen size bed with storage space to keep their things due to space financial constraints",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "E. Christina Joy",
      "email": "christinajoy@fycs.org",
      "phone": [
        "63519505",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149964",
    "category": "Home Furnishing",
    "name": "sofa with storage",
    "description": "Family with 2 young children staying in a 2-room flat  hopes to receive a donated sofa with storage space due to financial consraints",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "E. Christina Joy",
      "email": "christinajoy@fycs.org",
      "phone": [
        "63519505",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149963",
    "category": "Home Furnishing",
    "name": "Sofabed (queen-size)",
    "description": "Client is a single mother to 5 children. The family lives in a 2 room HDB rental flat. They face with limited space and would require a queen size sofa bed.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149962",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client is a single mother who is taking care of her 3 young children. Due to her poor health and caregiving duties, she is currently unemployed. Family is allocated a rental flat recently and require household items for their flat. Client hopes to receive wardrobe to put her and her children's clothes.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149961",
    "category": "Home Furnishing",
    "name": "Queen size mattress with bedframe",
    "description": "Client is a single mother who is taking care of her 3 young children. Due to her poor health and caregiving duties, she is currently unemployed. Family is allocated a rental flat recently and require household items for their flat. Client hopes to receive a queen size mattress with bedframe.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149951",
    "category": "Home Furnishing",
    "name": "wardrobe",
    "description": "Client has 8 children. She is not working as she is a full-time caregivers for all her children. Her husband is currently looking for jobs. (Far)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149950",
    "category": "Home Furnishing",
    "name": "Kitchen cabinet",
    "description": "Client has 8 children. She is not working as she is a full-time caregivers for all her children. Her husband is currently looking for jobs.(Far)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149948",
    "category": "Home Furnishing",
    "name": "Kitchen top cabinet",
    "description": "Client has 8 children. She is not working as she is a full-time caregivers for all her children. Her husband is currently looking for jobs.(Far)",
    "specifications": "47",
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149947",
    "category": "Home Furnishing",
    "name": "Single Bed",
    "description": "Mother of 6 children requires a single bed mattress for her eldest son who recently met with a vehicular accident. She hopes that it would help with her son's recovery as family are currently sharing the sleeping space.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Muhammad Danial Bin Mazlan",
      "email": "danialmazlan@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149943",
    "category": "Home Furnishing",
    "name": "Queen Sized Bed",
    "description": "Client is an expecting mother who is moving in to her new flat with her partner. Currently, they have limited finances and would appreciate the support with having a bed for her to sleep on.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149933",
    "category": "Home Furnishing",
    "name": "Wardobe",
    "description": "Client is a single parent and sole breadwinner of the family. Client's current wardrobe has broken down, and is no longer suitable for use. Client would require a wardrobe to store her and her family member's belongings.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Champions Way",
      "name": "Joanna Tay",
      "email": "joannatay@fycs.org",
      "phone": [
        "66901029",
        "66901000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149932",
    "category": "Home Furnishing",
    "name": "Queen sized mattress",
    "description": "Client is a single parent and sole breadwinner of her family. Client faces financial constraints to afford a brand new queen-sized mattress. However, client would require a mattress given that her current mattress has worn down and is unsuitable for use.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Champions Way",
      "name": "Joanna Tay",
      "email": "joannatay@fycs.org",
      "phone": [
        "66901029",
        "66901000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149931",
    "category": "Home Furnishing",
    "name": "Single bed with mattress",
    "description": "Client is a single mother of 5 children and is the sole breadwinner for her family. She has been sleeping on the floor after her sofa bed broke with springs coming loose. The lack of quality sleep has left her exhausted, and the constant fatigue is affecting her ability to work effectively. We are seeking a donation of a single bed with mattress so that she can get the proper rest and recharge. Thank you.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Toa Payoh",
      "name": "Regina Pua",
      "email": "regina_pua@msf.gov.sg",
      "phone": [
        "67367647",
        "67157503"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149889",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client's family is a family of 10 that lives in a 2-room rental flat, with multiple children. Family faces financial difficulties as they only have 1 breadwinner. Family requires a wardrobe to organise all their clothes at home, so as to keep the place neat.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Shena Tan",
      "email": "shenatan@fycs.org",
      "phone": [
        "69782982",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Oct 2025"
  },
  {
    "id": "149863",
    "category": "Home Furnishing",
    "name": "King size bed",
    "description": "Client is the main caregiver to her 4 young children, and husband earns meagre income. She requires a king size mattress and bed frame for herself and her children to sleep on.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Liew Huan Yi",
      "email": "liewhuanyi@fycs.org",
      "phone": [
        "63519508",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Oct 2025"
  },
  {
    "id": "149862",
    "category": "Home Furnishing",
    "name": "Wardrobe required for a senior staying in 1-room rental flat",
    "description": "My client is a 69 year old senior who lives with a co-tenant in a 1-room rental flat. He is in urgent need of a new wardrobe to store his clothes as his old wardrobe was bedbug infested and needs to be thrown away to prevent the bedbug infestation again. He is currently employed and has no source of income, relying on government payouts for his daily living expenses. Due to financial constraints, he does not have the means to purchase a new wardrobe. A simple wardrobe would greatly improve his living conditions, allowing him to keep his clothes clean. If you have a pre-loved wardrobe in good condition or would like to gift him with a new one, your generosity would make a lot of difference to his live. Thank you!",
    "specifications": null,
    "contact": {
      "org": "NTUC Health Cluster Support @ Bukit Merah",
      "name": "Karen Chay",
      "email": "karen.c@ntuchealth.sg",
      "phone": [
        "91461875",
        "62741602"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Oct 2025"
  },
  {
    "id": "149843",
    "category": "Home Furnishing",
    "name": "Wadrobe",
    "description": "Family of 5 living in a rental flat with father as the sole breadwinner, mother is looking for a cupboard/wardrobe to replace their old one as it is falling apart. Donor to cover delivery fee please, can contact me via whatsapp 6708 7032 thank you",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Esther Tan",
      "email": "tan_ziji@msf.gov.sg",
      "phone": [
        "67087032",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149834",
    "category": "Home Furnishing",
    "name": "Queen Size Mattress with Bed Frame",
    "description": "Nuclear family with 5 teenage children. Father was previously sold breadwinner but has been unemployed for >3yrs as he struggles with mental health and recovering from alcohol addiction. Youngest child has special needs and epilepsy and mother is full-time caregiver to her. Family is financially dependent on oldest daughter, who works as a cleaner, and financial assistance to meet their basic needs.\n\n\n\nClient's old mattress, that was placed on the floor, got wet and mouldy due to a leakage from the toilet.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Choa Chu Kang",
      "name": "Phoo Thazin Moe",
      "email": "phoothazinmoe@fycs.org",
      "phone": [
        "69783514",
        "67625215"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149833",
    "category": "Home Furnishing",
    "name": "Queen size mattress/bed",
    "description": "Low-income family staying in a rental flat, with 3 school going children, 1 in pre-school and 1 in infant care. Mother is working as a cleaner while father is the main caregiver of their children, and they are struggling financially to adequately meet their children's needs and to pay their medical bills. Their current mattress has been cleared away due to bed bug infestation. The family is requesting a mattress that will be beneficial for them to have sufficient rest for school and work.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Jurong",
      "name": "Shree Ganga D/O Rajasagran",
      "email": "ShreeGanga@thkmc.org.sg",
      "phone": [
        "88333080",
        "67169466"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149827",
    "category": "Home Furnishing",
    "name": "Shelf with Drawers",
    "description": "We are supporting a mother of four young children (all under 9, including a toddler) who is also the primary caregiver for her elderly parents with health issues. Her husband is the sole breadwinner, and the family relies on ComCare assistance to meet basic needs. \nLiving in a small 2-room flat, storage is limited. The family is seeking a shelf with drawers to organize the children’s toys and belongings, to create a more conducive and safe home environment. This would greatly aid in making the home environment more tidy and spacious for multiple family members.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Jurong",
      "name": "Shree Ganga D/O Rajasagran",
      "email": "ShreeGanga@thkmc.org.sg",
      "phone": [
        "88333080",
        "67169466"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149811",
    "category": "Home Furnishing",
    "name": "Bunk bed - Queen/Single",
    "description": "The family consists of two parents and five school-going children who live in a two-room public rental flat. Due to space constraints, the family experiences difficulties with their sleeping arrangements, particularly for their eldest son who is diagnosed with autism. They require two double-decker beds, with a single-sized mattress on the upper deck and a queen-sized mattress on the lower deck. This would help alleviate the space constraints during sleeping hours.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Sengkang, Serangoon &amp; Hougang",
      "name": "Andre Lim",
      "email": "andre_lim@msf.gov.sg",
      "phone": [
        "63153658",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149790",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client is a single mother currently living with her 2-year-old daughter. At present, she is unemployed and facing challenges in securing a job that aligns with her caregiving responsibilities. Nevertheless, she is actively seeking employment opportunities that offer flexibility to accommodate her role as a primary caregiver. Additionally, a wardrobe would significantly ease her financial burden, help reduce these costs and support her in managing her household more efficiently. can whatsapp 6038 4091 if you are keen to arrange transport and cover delivery cost.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149788",
    "category": "Home Furnishing",
    "name": "Queen sized storage bed",
    "description": "A family of three faces financial constraints and have difficulties in meeting their basic daily needs. They have just moved to their new house and its barely furnished. They will require a queen size bed and bedframe with a storage as currently they are sleeping on the floor.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "30 Sep 2025"
  },
  {
    "id": "148811",
    "category": "Home Furnishing",
    "name": "Gas Cabinet",
    "description": "Family is staying in rental flat. 2 children in autism spectrum and husband is sole bread winner. Needs the essentials as money was used for outstanding medical bills.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149770",
    "category": "Home Furnishing",
    "name": "Queen Size Mattress",
    "description": "A family has 5 children ranging from primary school to a new born. The father just lost his food delivery job as he just lost his e-bike. The mother just gave birth and is on confinement. The family requires a queen size mattress.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Tampines, Punggol  &amp; Pasir Ris",
      "name": "Premilla d/0 Gunasekaran",
      "email": "premilla_gunasekaran@msf.gov.sg",
      "phone": [
        "62139480",
        "64244017"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149763",
    "category": "Home Furnishing",
    "name": "Anti-slip mat (long)",
    "description": "Client is an 87-year-old elderly, with limited informal social support due to strained family relationships. This, coupled with her unemployment, have contributed to her financial constraints. \n\nAs such, client requires support to purchase anti-slip mats to cover her bathroom floor, to reduce further risk of falls in the bathroom.",
    "specifications": null,
    "contact": {
      "org": "Care Corner - Community Case Management Service Central",
      "name": "Alethia Toh",
      "email": "alethiatoh@carecorner.org.sg",
      "phone": [
        "62586601"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149759",
    "category": "Home Furnishing",
    "name": "Kitchen cabinet",
    "description": "Family consists of a young couple with 3 children, including a newborn. They have recently moved into a rental flat and requires a kitchen cabinet so that they have ample space to cook. Their kitchen only consists of a small table that can only fit a small portable stove, hence a proper kitchen cabinet can provide more space and storage for their cooking essentials. Please Whatsapp me at 62319407 if you have a suitable one to donate, thank you.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Fatimah Azzahrah",
      "email": "fatimah_azzahrah_noor@msf.gov.sg",
      "phone": [
        "62319407",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149723",
    "category": "Home Furnishing",
    "name": "Kitchen Cabinet",
    "description": "Client is a family consisting of a single parent with 3 children. Parent faces caregiving stressors and financial constraints due to multiple medical appointments from the herself and the children. The donation of kitchen cabinet would be helpful.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149710",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Family of 5 stays in a 4-room flat with 4 other members with chronic medical and mental health conditions. Family wardrobe is old and breaking down and would require to change.",
    "specifications": "170cm wide",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Yew Tee",
      "name": "Calyn Xu",
      "email": "calynxu@fycs.org",
      "phone": [
        "64162155",
        "64162162"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149706",
    "category": "Home Furnishing",
    "name": "queen size bed frame and mattress",
    "description": "Client has 4 young children, and family earns a meagre income. The family does not have a proper bed, and would require a queen size bed frame, mattress, 2 pillows and 1 bolster",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Liew Huan Yi",
      "email": "liewhuanyi@fycs.org",
      "phone": [
        "63519508",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Sep 2025"
  },
  {
    "id": "149662",
    "category": "Home Furnishing",
    "name": "Cupboard",
    "description": "Household of 2 consisting of a single mother and a 20yo son serving his National Service. Their rental flat has been infested with termites. They have difficulties replacing their furniture due to low income.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Toa Payoh",
      "name": "Venus Tang",
      "email": "venus_tang@msf.gov.sg",
      "phone": [
        "65139140",
        "67157503"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "148190",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Family of 5 in a rental flat with 3 children in school, father is the sole bread winner as a ferry operator, working long hours, mother is a homemaker who takecares of the home. The family is looking for wardrobe as theirs is spoilt with the 2 lower drawers missing, they are unable to keep the space tidy for the kids to focus on their school, please provide delivery for the item as family cannot afford delivery. can contact me through email or whatsapp 6708 7032",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Esther Tan",
      "email": "tan_ziji@msf.gov.sg",
      "phone": [
        "67087032",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149656",
    "category": "Home Furnishing",
    "name": "Single bed",
    "description": "Client has history of stroke and is currently caring for adult daughter with TB. Family is fully reliant on welfare support due to health issues. Family will benefit for a bed for daughter so that she can properly rest.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Emma Zhang",
      "email": "emmazhang@fycs.org",
      "phone": [
        "69783022",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149653",
    "category": "Home Furnishing",
    "name": "Cabinet for kitchen use",
    "description": "Family of 4, with 2 young children and 1 pregnant mother, in need of a cabinet for use in their kitchen in a 2-room rental flat as their current one has recently broken. Preferably, not wider than 2 doors width (approx. 70-80cm)",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Marine Parade Family Service Centre",
      "name": "Syuhaidah Bacon",
      "email": "syuhaidah.bacon@montfortcare.org.sg",
      "phone": [
        "64450100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149648",
    "category": "Home Furnishing",
    "name": "King size bedframe with mattress",
    "description": "Client and her husband have four children and client is currently pregnant with her 5th child. Despite the client and her husband are working, they have incurred a lot of debts from banks, licensed money lenders, friends and relatives, to the extend they do not have the financial means to buy the basic household items.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149647",
    "category": "Home Furnishing",
    "name": "Chest Drawer",
    "description": "We are assisting a family with a special needs child who requires a more suitable and comfortable home environment. Their current furniture is worn out and no longer meeting their needs. We are seeking a chest drawer to help them keep their space organised and safe for the child. These items will go a long way in supporting the family’s wellbeing and ensuring they have a more restful and functional living space.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Muhammamd Farhan Bin Abdul Rahman",
      "email": "muhdfarhan.abdrahman@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149646",
    "category": "Home Furnishing",
    "name": "Bedframe and mattress",
    "description": "We are assisting a family with a special needs child who requires a more suitable and comfortable home environment. Their current furniture is worn out and no longer meeting their needs. We are seeking a queen bed frame with mattress to provide the parents with adequate rest as they juggle caregiving responsibilities, and a chest drawer to help them keep their space organised and safe for the child. These items will go a long way in supporting the family’s wellbeing and ensuring they have a more restful and functional living space.",
    "specifications": "Queen size",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Muhammamd Farhan Bin Abdul Rahman",
      "email": "muhdfarhan.abdrahman@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149642",
    "category": "Home Furnishing",
    "name": "1 wardrobe for adults / 1 wardrobe for children",
    "description": "Client and her husband have four children and client is currently pregnant with her 5th child. Despite the client and her husband are working, they have incurred a lot of debts from banks, licensed money lenders, friends and relatives, to the extend they do not have the financial means to buy the basic household items.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149641",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Low-income family of 3 in need of replacing their refrigerator \n\nMother and father is ongoing through divorce.\nFather and mother reported not having any income, and is solely dependant on SSO ComCare assistance for their daily needs.\n\nTheir son is diagnosed with Intellectual Disability which limits his ability to work independently.\n\nAs such, the family faces trouble to replace their wardrobe.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "149639",
    "category": "Home Furnishing",
    "name": "Queen-sized Orthopaedic Mattress",
    "description": "Member (60/F) currently resides alone in a rental flat. She is unemployed and relies on financial assistance due to multiple medical conditions, including a bacterial lung infection, rheumatoid arthritis, and polymyositis. She also experiences spinal issues, which are exacerbated by her current bed that is worn out and no longer provides adequate support. In view of her medical condition and daily discomfort from her back pain, she hopes to receive a new queen-sized orthopaedic bed to improve her rest and overall well-being. A proper bed would greatly enhance her quality of life, support her medical recovery, and ease the physical strain caused by her existing health challenges.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Quak Mei Qing",
      "email": "meiqing@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Sep 2025"
  },
  {
    "id": "139390",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Family of 5 with 3 school-going children staying in a 2-room rental flat requires a wardrobe as their current one is giving way. Would be very grateful if donor is able to cover the transport expenses.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149593",
    "category": "Home Furnishing",
    "name": "wardrobe",
    "description": "Client is a single mother currently living with her 2-year-old daughter. At present, she is unemployed and facing challenges in securing a job that aligns with her caregiving responsibilities. Nevertheless, she is actively seeking employment opportunities that offer flexibility to accommodate her role as a primary caregiver. Additionally, a wardrobe would significantly ease her financial burden, help reduce these costs and support her in managing her household more efficiently. can whatsapp 6038 4091 if you are keen to arrange transport and cover delivery cost.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149531",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client is a single mother who is taking care of her 3 young children. Due to her poor health and caregiving duties, she is currently unemployed. Family is allocated a rental flat recently and require household items for their flat. Client hopes to receive wardrobe to put her and her children's clothes.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149530",
    "category": "Home Furnishing",
    "name": "Queen size mattress with bedframe",
    "description": "Client is a single mother who is taking care of her 3 young children. Due to her poor health and caregiving duties, she is currently unemployed. Family is allocated a rental flat recently and require household items for their flat. Client hopes to receive a queen size mattress with bedframe.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149529",
    "category": "Home Furnishing",
    "name": "Kitchen Cabinet (Can put gas tank in the cabinet & stove on top of cabinet)",
    "description": "Client is a single mother who is taking care of her 3 young children. Due to her poor health and caregiving duties, she is currently unemployed. Family is allocated a rental flat recently and require household items for their flat. Client hopes to receive a kitchen cabinet that allows her to put gas tank in the cabinet and the stove on top.\n\nSize reference for gas tank: https://fourcity.com.sg/Products",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149522",
    "category": "Home Furnishing",
    "name": "Super Single size metal folding bedframe",
    "description": "Client is a single parent working part-time as she needs to look after her son, therefore, her earnings are limited. The family does not have the financial means to buy some household items which are needed.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149484",
    "category": "Home Furnishing",
    "name": "2-door wardrobe",
    "description": "Family of 3 with a special needs child recently experienced a bed bug infestation at home and is looking for replacement for their wardrobe (2 sets of 2 door wardrobe). Father is currently working part time and mother is still looking for job, hence the being unable to afford the replacement. The donation will help to ensure that they will have minimum disruption to their day to day living and continue to maintain a conducive environment for their child with special needs.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149482",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client is on long-term MC for 6 months, husband is the only sole breadwinner. The family consist of 8 members with 6 school-going children aged between 6 to 14. \nThe family is currently receiving insufficient finance support as client's husband employment is unstable and he is currently employed on a contract ad-hoc basis, with subsequent reviews to ascertain whether he can continue his employment. Recently her wardrobe is broken, and thus she is looking for support to replace it, so that her and her family is able to have a proper storage space for clothes, creating a more conducive environment for the kids.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149474",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Elderly lady is staying with her adult daughter in a 2-room rental flat.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Regina Leong",
      "email": "regina@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149464",
    "category": "Home Furnishing",
    "name": "Queen-size mattress (New)",
    "description": "A 30-year-old stay-at-home mother of four young children (aged 2-13), soon expecting her fifth, is striving to care for her family in a small 1-room rental flat in Yishun. Living with her husband and mother-in-law, and receiving ComCare and MOE FAS assistance, the family faces space and financial challenges. A new queen-size mattress would provide much-needed comfort and rest for the mother and her children, supporting their health and daily well-being. Your generosity can help this growing family enjoy safe, restful nights during this critical time.",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Yishun",
      "name": "Vanessa Goh",
      "email": "vanessagoh@mws.sg",
      "phone": [
        "67564995ext102/83688612",
        "67564995"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149457",
    "category": "Home Furnishing",
    "name": "Stove Table",
    "description": "Client and husband have unstable housing as they were kicked out once. They have recently gotten a rental flat and need help with getting furniture. The couple is unemployed as client is heavily pregnant with health complications and husband is job hunting.",
    "specifications": "Approximately 120cm x 60cm x 80cm",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Choa Chu Kang",
      "name": "Farrzana Bte Mohd Sheriff",
      "email": "farrzana@fycs.org",
      "phone": [
        "69506562",
        "67625215"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149453",
    "category": "Home Furnishing",
    "name": "TV console",
    "description": "A family with 4 children are in need of a TV console (non-glass top panel) for their new rental flat. The parents are currently unemployed and husband has recently fractured his leg. They are on financial assistance and seeking for employment after they settle into the new rental flat.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Tampines, Punggol  &amp; Pasir Ris",
      "name": "Ken Toh",
      "email": "ken_zq_toh@msf.gov.sg",
      "phone": [
        "62319385",
        "64244017"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149439",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Low-income family of 4 requires a 1-door wardrobe as the current one is becoming faulty. The family's income is unstable as both parents have multiple health issues.",
    "specifications": "Height: 179 cm Length: 40 cm Depth: 40 cm",
    "contact": {
      "org": "Kampong Kapor Community Services",
      "name": "Andy Wee",
      "email": "andywee@kkcs.org.sg",
      "phone": [
        "64854720",
        "62997662"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Sep 2025"
  },
  {
    "id": "149424",
    "category": "Home Furnishing",
    "name": "Two Single size bed frame + mattress",
    "description": "Seeking for new bed frame (preferably non-wood) and mattresses for two senior co-tenants (F/73 and F/77) who are relocating under the SERS programme in Oct. Their current beds are infested with bedbugs, and the mattresses are too low, making it difficult for them to get up due to leg mobility issues. A proper bed setup will greatly improve their comfort, safety, and quality of rest in their new home. Any support with new beds would be greatly appreciated. Thank you for making a difference! To support, please WhatsApp Elaine at 8777 0960 or email elaine.fu@thkmc.org.sg",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149412",
    "category": "Home Furnishing",
    "name": "2 Door Wardrobe",
    "description": "Client is on long-term MC for 6 months, husband is the only sole breadwinner. The family consist of 8 members with 6 school-going children aged between 6 to 14. \nThe family is currently receiving insufficient finance support as client's husband employment is unstable and he is currently employed on a contract ad-hoc basis, with subsequent reviews to ascertain whether he can continue his employment. Recently her wardrobe is broken, and thus she is looking for support to replace it, so that her and her family is able to have a proper storage space for clothes, creating a more conducive environment for the kids.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Soh Yong Sheng",
      "email": "sohyongsheng@fycs.org",
      "phone": [
        "69783086",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149398",
    "category": "Home Furnishing",
    "name": "2 x Double Decker Single Bed",
    "description": "Sourcing for 2 double decker single bed for a family of 7 whose house was infested with bed bugs recently and had to throw away the bed frame/mattress. \n\nThe family is a single-parent unit with 6 children and have financial limitations in replacing the beds for the children",
    "specifications": "Nil",
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Too Xiu Hui",
      "email": "tooxiuhui@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149374",
    "category": "Home Furnishing",
    "name": "Single size metal folding bedframe",
    "description": "Single mattress bed frame\nClient is a single parent working part-time as she needs to look after her son, therefore, her earnings are limited. The family does not have the financial means to buy some household items which are needed.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149366",
    "category": "Home Furnishing",
    "name": "Thin cabinet",
    "description": "A 63-year-old woman, currently living on her own, has recently received the keys to her one-room rental flat. Prior to this, she had been staying with her sister, so she does not yet have furniture or appliances to make the new space feel like home. She has been diagnosed with diabetes and cancer and has been undergoing chemotherapy since January 2025. Due to her health condition, she has been certified unfit for work and is unable to support herself financially. She hopes to receive a slim cabinet/kitchen organizer to store her food rations.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Shankri Muthu",
      "email": "shankrimuthu@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149350",
    "category": "Home Furnishing",
    "name": "Thicker foam mattress",
    "description": "Senior is widowed, has 3 children and staying with eldest son in a 2 room HDB rental unit, all who have estranged relationship with her and minimally involved in her care. She has multiple medical conditions, has mobility challenges, and is on comcare assistance. She recently has shoulder pain, cause unknown but on medical follow up. Current mattress is not sufficiently thick, thus causing her not to sleep well at night and further aggravating her injury. As she uses hospital bed, she is unable to use spring mattress. Seeking kind donors for foam mattress, 4 to 6 inch thickness for single user.",
    "specifications": null,
    "contact": {
      "org": "Lions Befrienders Service Association (Singapore)",
      "name": "Chow Ching Hua",
      "email": "chinghua.chow@lb.org.sg",
      "phone": [
        "66814941",
        "63758600"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149333",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Family of 5 with 3 school-going children staying in a 2-room rental flat who requires a wardrobe as their current one is faulty. Sole breadwinner is working odd job and wife is temporarily unfit for work due to health complications. Would greatly appreciate if donor is able to cover transport expenses.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149330",
    "category": "Home Furnishing",
    "name": "Shoe cabinet",
    "description": "Family of 4 with 2 school-going children staying in a 2-room rental flat who requires a shoe cabinet as their current one is faulty. Single mum is unfit for work due to health reasons and has limited means to afford a shoe cabinet. Would greatly appreciate if donor is able to cover transport expenses.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149301",
    "category": "Home Furnishing",
    "name": "Queen sized mattress",
    "description": "Family with multiple children, aged 19 - 4 months. Husband is the sole breadwinner, as wife has multiple mental and physical health diagnoses. Older children assist with the caregiving for younger children. The family lives in a rental unit. The mattresses for children are badly sagged and stained. New mattresses will be beneficial for them, to provide them with comfortable rest.",
    "specifications": "Queen size, 1 quantity",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Sep 2025"
  },
  {
    "id": "149280",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Low income family - mother and son are looking for a wardrobe to replace their current broken one. Direct delivery to family in Queenstown area.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Fitrah Nabilah",
      "email": "fitrahnabilah@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149275",
    "category": "Home Furnishing",
    "name": "Wardrobe with Sliding Door",
    "description": "Family has 6 children in a 2-room rented flat. They require additional storage space for their clothing and due to limited space, they would prefer sliding doors. Both parents have health issues and are unable to work.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Toa Payoh",
      "name": "Samuel Rajan David",
      "email": "samuel_rajan_david@msf.gov.sg",
      "phone": [
        "62319671",
        "67157503"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149253",
    "category": "Home Furnishing",
    "name": "wardrobe",
    "description": "Client is a single mother currently living with her 2-year-old daughter. At present, she is unemployed and facing challenges in securing a job that aligns with her caregiving responsibilities. Nevertheless, she is actively seeking employment opportunities that offer flexibility to accommodate her role as a primary caregiver. Additionally, a wardrobe would significantly ease her financial burden, help reduce these costs and support her in managing her household more efficiently. can whatsapp 6038 4091 if you are keen to arrange transport and cover delivery cost.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149237",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Seeking support for a single widowed mother who suffer from mental health issues and completed uterus surgery in early 2025. Since the sudden lost of husband who passed away in 2024, she became the sole breadwinner to 3 school-going children, living in a 2-room rental flat. The mother is in need of a wardrobe for her 2 younger children.\nPlease Whatsapp Suzanne at 86661355 or email to suzanne.eu@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149217",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Low-income family of 3 in need of replacing their refrigerator Mother and father is ongoing through divorce. Father and mother reported not having any income, and is solely dependant on SSO ComCare assistance for their daily needs. Their son is diagnosed with Intellectual Disability which limits his ability to work independently. As such, the family faces trouble to replace their wardrobe.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149214",
    "category": "Home Furnishing",
    "name": "Queen Size Bed Frame",
    "description": "A family of five, with three children aged  13, 7, and 6, requires a queen sized bed frame as their current one has spoilt. The sole breadwinner is the father, who works as a grab driver. They are currently facing financial strain due to multiple outstanding arrears.",
    "specifications": null,
    "contact": {
      "org": "Singapore Red Cross Society",
      "name": "Siti Zaharah Binte Jahis",
      "email": "zaharah.jahis@redcross.sg",
      "phone": [
        "66640553",
        "66640500"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149176",
    "category": "Home Furnishing",
    "name": "pedestal",
    "description": "client is a senior stayinga alone, she needs a small pedestal.",
    "specifications": null,
    "contact": {
      "org": "Thye Hua Kwan Moral Charities",
      "name": "Penelope Lim",
      "email": "penelope.lim@thkmc.org.sg",
      "phone": [
        "68461228",
        "63371201"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149155",
    "category": "Home Furnishing",
    "name": "Collapsible boxes",
    "description": "Project to collect school uniforms require 10 collapsible boxes. Sample: https://shopee.sg/Foldable-Storage-Basket-Stackable-Folding-Plastic-Crates-Collapsible-Basket-Laundry-Basket-i.57926621.20677827797?sp_atk=d82a934e-abf8-419d-8e36-573aee8810f6&xptdk=d82a934e-abf8-419d-8e36-573aee8810f6",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Tampines, Punggol  &amp; Pasir Ris",
      "name": "Poh Mei Ying",
      "email": "poh_mei_ying@msf.gov.sg",
      "phone": [
        "67087143",
        "64244017"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149138",
    "category": "Home Furnishing",
    "name": "Wardrobe - 4 Door",
    "description": "Client (F/22) is a single parent with two children (F/4) and (M/3), living in a rental flat. She is actively looking for a job but has not been able to secure employment. The client is currently facing financial difficulties and is in need of a big wardrobe for her family.. For further details, feel free to reach out Whatsapp Liana at 8588 3163 or email to Norliana.Roslan@thkmc.org.sg to liaise. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149134",
    "category": "Home Furnishing",
    "name": "Bed Frame (King Size)",
    "description": "Client (M/57) is currently unemployed and has chronic medical conditions. He lives in a 2 room rental flat with a family of 5. The family is facing financial hardship and is struggling to afford functional home appliances. For further details, feel free to reach out to Kritikaa at 8777 0959 or email to kritikaa.subramaniam@thkmc.org.sg to liase. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149121",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "A senior client who is living in a rental flat requires a wardrobe or storage cupboard to store his belongings.",
    "specifications": null,
    "contact": {
      "org": "Viriya Family Service Centre",
      "name": "Echo Tsang",
      "email": "echo_tsang@viriya.org.sg",
      "phone": [
        "62858033"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "150051",
    "category": "Learning Aids",
    "name": "Laptop",
    "description": "Client and his family are currently facing financial challenges. Client is currently enrolled in a part-time diploma course, and his laptop recently broke down. He is in urgent need of a replacement to continue his studies. As he has just started working and is not yet financially stable, he is unable to afford a new laptop at this time.",
    "specifications": null,
    "contact": {
      "org": "Singapore After Care Association",
      "name": "Lin Mingjie",
      "email": "mingjie@saca.org.sg",
      "phone": [
        "62942350"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "144503",
    "category": "Learning Aids",
    "name": "Buku Latihan Pintar Bahasa Melayu Darjah 4 Berdasarkan Format Peperiksaan MOE Terkini (Malay assessment book)",
    "description": "Sunbeam Place @ Children's Society requires 10pcs of Buku Latihan Pintar Bahasa Melayu Darjah 4 Berdasarkan Format Peperiksaan MOE Terkini (Malay assessment book) for their service users study materials. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "144518",
    "category": "Learning Aids",
    "name": "Secondary 3 Bahasa Melayu (Assessment Book)",
    "description": "Sunbeam Place @ Children's Society requires 5pcs of Secondary 3 Bahasa Melayu (Assessment Book) for their service users study materials. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "144501",
    "category": "Learning Aids",
    "name": "Penulis Cemerlang Darjah 1/Primary 1 Malay/Malay Assessment | Latest MOE assessment books",
    "description": "Sunbeam Place @ Children's Society requires 5pcs of Penulis Cemerlang Darjah 1/Primary 1 Malay/Malay Assessment | Latest MOE assessment books for their service users study materials. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "149946",
    "category": "Learning Aids",
    "name": "Laptop",
    "description": "A low income with multiple dependents. (Ir)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149930",
    "category": "Learning Aids",
    "name": "Handphone (Android)",
    "description": "Client, 59 years old, is currently unemployed due to chronic health issues, including a heart condition and frequent dizziness, which limit his ability to work. He relies on financial assistance and food support to meet his basic needs. In July 2025, his handphone was damaged, and despite efforts to source a replacement, he has been unable to afford one. As handphone is essential for communication and attending to his medical and social needs, a donated phone would greatly support his daily functioning and well-being.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "144504",
    "category": "Learning Aids",
    "name": "Buku Latihan Pintar Bahasa Melayu Darjah 6 Berdasarkan Format Peperiksaan MOE Terkini (Malay assessment book)",
    "description": "Sunbeam Place @ Children's Society requires 10pcs of Buku Latihan Pintar Bahasa Melayu Darjah 6 Berdasarkan Format Peperiksaan MOE Terkini (Malay assessment book) for their service users study materials. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Oct 2025"
  },
  {
    "id": "149256",
    "category": "Learning Aids",
    "name": "Workable laptop",
    "description": "My client has completed his programme and is working towards a fresh start. As the caregiver to his two elderly parents, one of whom is bed-bound, he faces many challenges.\n\nHe wish to further his studies in 2026 and needs a reliable laptop to support his learning. Your contribution will help him pursue his education and build a better future for himself and his family.",
    "specifications": "NA",
    "contact": {
      "org": "The Helping Hand",
      "name": "Ivan Tan",
      "email": "ivantan@thehelpinghand.org.sg",
      "phone": [
        "67184081/89133685",
        "62832204"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149126",
    "category": "Learning Aids",
    "name": "Laptop",
    "description": "Family has 2 young children and currently staying in a rental flat. Mother is looking for a laptop as she is going back to her studies while husband is the sole breadwinner.",
    "specifications": null,
    "contact": {
      "org": "REACH Family Service Centre",
      "name": "Priscilla Loo",
      "email": "priscilla.loo@reach.org.sg",
      "phone": [
        "64709776",
        "62522566"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "150065",
    "category": "Others",
    "name": "10 Oyster Sauce",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal Oyster Sauce for its beneficiaries. Thank you! \n\n \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150064",
    "category": "Others",
    "name": "10 Halal Vermicelli Noodles",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal vermicelli noodles for its beneficiaries. Thank you! \n\n \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150063",
    "category": "Others",
    "name": "10 Halal Curry Cans",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal curry cans for its beneficiaries. Thank you! \n\n \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150062",
    "category": "Others",
    "name": "10 Milo Packets",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal Milo packets for its beneficiaries. Thank you! \n\n \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150056",
    "category": "Others",
    "name": "Market Trolley",
    "description": "Mother uses market trolley to assist with her grocery shopping but it has spoilt. Currently looking for a replacement, preferably with bigger wheels to reduce chances of wear and tear due to the heavy weight.",
    "specifications": "40cm(W) x 44cm(D) x 87cm(H)",
    "contact": {
      "org": "Fei Yue Community Services",
      "name": "Priscilla Tan",
      "email": "priscillatan@fycs.org",
      "phone": [
        "60117651",
        "63809169"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150046",
    "category": "Others",
    "name": "Phone",
    "description": "A 67-year-old elderly client hopes to request a phone as he has misplaced his current one and does not have a spare. He relies heavily on his phone to stay connected with his support system, including essential services and loved ones.\n\nHe is currently receiving formal financial assistance and is unable to afford purchasing a replacement phone. Your support would greatly ease his daily challenges and help him stay connected, safe, and supported. Thank you!",
    "specifications": null,
    "contact": {
      "org": "AWWA Ltd - Transitional Shelter (JT)",
      "name": "Esther Tan",
      "email": "esther_tan@awwa.org.sg",
      "phone": [
        "65117278",
        "65111669"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150044",
    "category": "Others",
    "name": "Motorised wheelchair battery",
    "description": "Client who is an elderly, hopes to request two battery of scooter model AGIS M19. The scooter helps client to move around for his daily routine. Donor to kindly cover transport arrangement and delivery cost please.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tasya Puspita Maulany",
      "email": "tasya@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150031",
    "category": "Others",
    "name": "Jogging Shoes",
    "description": "Client is caring for 3 school going children. Client is unemployed due to both physical and mental health issues. Client is obese and encouraged to exercise but is unable to afford proper walking shoes.",
    "specifications": "female Size 42",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Emma Zhang",
      "email": "emmazhang@fycs.org",
      "phone": [
        "69783022",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150012",
    "category": "Others",
    "name": "Phone",
    "description": "I have a client (49M) recently out of prison and not in contact with his FOO, in need of a phone to contact stakeholders and receive updates for his HDB / Employment needs. Appreciate if anyone has a spare phone to pass to my client. Thank you.",
    "specifications": "Handphone",
    "contact": {
      "org": "Montfort Care - Marine Parade Family Service Centre",
      "name": "Matthias Loh",
      "email": "matthias.loh@montfortcare.org.sg",
      "phone": [
        "64450100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150007",
    "category": "Others",
    "name": "Mobile Phone [First or second hand]",
    "description": "Family consist of a young couple, client (F/25), her husband (M/28) and their daughter (F/10 months). They recently moved to a 2-room rental flat and are facing difficulties with their practical needs. The couple has been sharing a mobile phone and they have difficulties with remaining contactable at times.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "149960",
    "category": "Others",
    "name": "Kitchen Cabinet (Can put gas tank in the cabinet & stove on top of cabinet)",
    "description": "Client is a single mother who is taking care of her 3 young children. Due to her poor health and caregiving duties, she is currently unemployed. Family is allocated a rental flat recently and require household items for their flat. Client hopes to receive a kitchen cabinet that allows her to put gas tank in the cabinet and the stove on top.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149958",
    "category": "Others",
    "name": "Mobile phone",
    "description": "Client (M/39) is rough-sleeping and does not have stable accommodation. His secondhand phone recently became faulty and contacting others via his mobile phone has been challenging. He requires a replacement for his faulty phone to remain contactable and to manage his current housing needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149957",
    "category": "Others",
    "name": "Mobile phone",
    "description": "Client is a divorced single mother with 2 children aged 14 and 17, under her sole care and custody.  She also provides care to her youngest son (M/10) from a different marriage on alternate weekends. Son (M/17) is currently studying at ITE college and dropped and spoilt his phone and it is no longer working. He hopes to receive a secondhand phone to remain contactable.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149955",
    "category": "Others",
    "name": "Glucena milk",
    "description": "Client is an unemployed single mother with severe varicose veins condition and caring for teenager. Client has diabetics and is advised to take Glucerna milk (wheat).",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Emma Zhang",
      "email": "emmazhang@fycs.org",
      "phone": [
        "69783022",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "148490",
    "category": "Others",
    "name": "Incontinence Bed Pads",
    "description": "Ct has multiple mental and physical health condition which she is receiving support from hospital for. Ct has been experiencing recurring hospitalisation episodes. Due to her health condition, Ct is unable to be gainfully employed and afford certain daily necessities.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "145246",
    "category": "Others",
    "name": "Milo Powder (Refill)",
    "description": "Our home need 40 packets of (900g) Milo Powder (Refill) for our 430 elderly residents. Thank You",
    "specifications": null,
    "contact": {
      "org": "Ju Eng Home For Senior Citizens",
      "name": "Lee Jun Hui",
      "email": "junhui@jeh.org.sg",
      "phone": [
        "64846890ext127",
        "64846890"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Oct 2025"
  },
  {
    "id": "149844",
    "category": "Others",
    "name": "Fresubin 2 kcal Cappuchino",
    "description": "Seeking donations of Fresubin 2 kcal Cappuccino for an elderly woman living with dementia who requires long-term care. She comes from a low-income family and relies on this specific nutritional supplement to maintain her health.\n\nDue to her condition, she is unable to tolerate regular milk—and Fresubin Cappuccino is the only flavour she accepts. Your donation will go a long way in supporting her daily needs and improving her quality of life.\n\nAny contribution is deeply appreciated. Thank you for your kindness and support.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Yishun",
      "name": "Mabel Loo",
      "email": "mabel.loo@montfortcare.org.sg",
      "phone": [
        "96504736",
        "64848040"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149777",
    "category": "Others",
    "name": "Glucerna Triple Care Milk Powder",
    "description": "Ct is an unemployed elderly who is living alone. He is a Pre-diabetic and has inflammatory bowel disease which impacts his body's ability to properly digest food and absorb nutrients. He requires the Glucerna Triple Care milk powder (which is suitable for people with diabetes) to supplement his diet.",
    "specifications": "2 cans",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149761",
    "category": "Others",
    "name": "Ensure milk - Individual packets",
    "description": "Ct is an elderly low income cancer patient who is going through end stage cancer. She requires daily milk for extra nutrition.",
    "specifications": "Ensure miilk - Individual packets ( Vanilla / Chocolate )",
    "contact": {
      "org": "AIN Society",
      "name": "Nur'Ain Binte Mohamed Said",
      "email": "nurain@ainsociety.org.sg",
      "phone": [
        "68485116",
        "68485166"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "148489",
    "category": "Others",
    "name": "Menstrual Panties",
    "description": "Ct has multiple mental and physical health condition which she is receiving support from hospital for. Ct has been experiencing recurring hospitalisation episodes. Due to her health condition, Ct is unable to be gainfully employed and afford certain daily necessities.",
    "specifications": "2XL, 3 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149672",
    "category": "Others",
    "name": "2nd hand handphone",
    "description": "Mdm N (Female, 37 years old) is a single mum caring for 4 children (8 yo Girl, 6 yo Girl, 3 yo Girl, 2 yo Boy) and has mental health condition that makes her certified unfit for work at this moment. Family has been receiving SSO Financial Assistance to mange their basic needs since Jun 2024 to current. In Dec 2024, eldest child (8 yo girl), was diagnosed with type 1 diabetes and requires constant monitoring of insulin levels, which requires an additional secondhand handphone of certain models for the child to scan her tag when she is in school to ensure her insulin readings are stable.\n\nTo confirm with FSC worker about handphone model before confirming donation.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Sia Vic-ki",
      "email": "vickisia@allkin.org.sg",
      "phone": [
        "62774171",
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149671",
    "category": "Others",
    "name": "Handphone",
    "description": "Client is a single father and requires a phone to get his daughter with special needs for medical appointments and to communicate with school. His phone had broken and is currently without a phone.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Isabelle Chua",
      "email": "isabellechua@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149669",
    "category": "Others",
    "name": "Milk Powder (Abbott Grow Stage 1 and stage 3)",
    "description": "Abbott Grow Milk Powder Stage 1 and stage 3\nA family of 7 with 5 school going children/infant. Father, who is the sole breadwinner just got retrenched and the family is in a tight situation financially. Support for milk powder would be helpful for the parents to ensure meet their basic needs while they search for new employment",
    "specifications": "Nil",
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Too Xiu Hui",
      "email": "tooxiuhui@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149526",
    "category": "Others",
    "name": "Mobile phone",
    "description": "Client (M/39) is rough-sleeping and does not have stable accommodation. His secondhand phone recently became faulty and contacting others via his mobile phone has been challenging. He requires a replacement for his faulty phone to remain contactable and to manage his current housing needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149525",
    "category": "Others",
    "name": "Mobile phone",
    "description": "Client is a divorced single mother with 2 children aged 14 and 17, under her sole care and custody.  She also provides care to her youngest son (M/10) from a different marriage on alternate weekends. Son (M/17) is currently studying at ITE college and dropped and spoilt his phone and it is no longer working. He hopes to receive a secondhand phone to remain contactable.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149477",
    "category": "Others",
    "name": "Tablet",
    "description": "Mr Hong, age 90, widowed lives with his nephew who is mute, deaf and intellectually disabled. \n\nNephew does not work and stays at home most of the time. while he has been to a special needs school during his teenage years, he is not able to be meaningfully employed in the later years\n\na tablet would enable him to learn materials through videos, and for faster communication when social worker needs to reach out to him",
    "specifications": null,
    "contact": {
      "org": "THK Cluster Support @ Geylang",
      "name": "Sabrina Wong",
      "email": "sabrina.wong@thkmc.org.sg",
      "phone": [
        "63371201",
        "68461228"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149461",
    "category": "Others",
    "name": "Nestle Peptamen Junior Powder (Vanilla)",
    "description": "Client is a 8 year old female who is diagnosed with Leukemia and is currently going through active treatment. However, she experienced a severe complication which had affected her nutritional intake for an extended period of time due to inflammation. She currently consumes a special formula (Nestle Peptamen Junior Powder, Vanilla Flavour) to meet her nutritional needs and support recovery. Estimated use is 4 tins per month (1 tin each week). A similar item can be found here for your reference: https://shopee.sg/Nestle-Peptamen-Junior-Powder-400g-i.255022044.6831972932",
    "specifications": "Nestle Peptamen Junior Powder (Vanilla) 400g",
    "contact": {
      "org": "AIN Society",
      "name": "Nur'Ain Binte Mohamed Said",
      "email": "nurain@ainsociety.org.sg",
      "phone": [
        "68485116",
        "68485166"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149403",
    "category": "Others",
    "name": "Pressure Relief Mattress",
    "description": "My 57 year old patient has terminal stage cancer. She is bedbound and requires a new pressure relief mattress as her current one is spoilt. Family is in financial difficulties and struggling to afford as she does not qualify for subsidy due to her age. \n\nAppreciate if donor can contact me on Whatsapp at 9727 4215. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Singapore Cancer Society",
      "name": "Lim Yi Xi",
      "email": "yixi_lim@singaporecancersociety.org.sg",
      "phone": [
        "97274215",
        "62219578"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149402",
    "category": "Others",
    "name": "A 42-inche TV",
    "description": "A halfway house helper who completed his sentence in 2025 requires a 42-inch TV for the rental flat he shares with his mother.",
    "specifications": null,
    "contact": {
      "org": "The Helping Hand",
      "name": "Chan Toh Han",
      "email": "chantohhan@thehelpinghand.org.sg",
      "phone": [
        "67184081",
        "62832204"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149387",
    "category": "Others",
    "name": "Life Alkaline Bottle Water (pH 8.5)",
    "description": "Client is a 53 year old cervical cancer patient who is undergoing active chemotherapy and radiotherapy. Her husband was forced to stop work to become a full-time caregiver. Client is also providing for her elderly patients battling gout and stroke.",
    "specifications": "12 x 1.5L",
    "contact": {
      "org": "AIN Society",
      "name": "Nur'Ain Binte Mohamed Said",
      "email": "nurain@ainsociety.org.sg",
      "phone": [
        "68485116",
        "68485166"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149272",
    "category": "Others",
    "name": "footwear",
    "description": "An elderly man who is single and unemployed due to physical disability as a result of a car accident many years ago, needs a new pair of crocs, as the current pair is worn out. \n\nHis shoes size should be around size 10.",
    "specifications": null,
    "contact": {
      "org": "NTUC Health Co-operative Limited",
      "name": "Zoe Lee",
      "email": "zoe.l1@ntuchealth.sg",
      "phone": [
        "94552166",
        "67156715"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149234",
    "category": "Others",
    "name": "Biscuits",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more packets of halal biscuits for its beneficiaries. Thank you! \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Sim Yan Ling",
      "email": "yanling.sim@ppis.sg",
      "phone": [
        "65613462ext503",
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149233",
    "category": "Others",
    "name": "White Sugar",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more packets of 1kg white sugar for its beneficiaries. Thank you! \n \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": "1kg",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Sim Yan Ling",
      "email": "yanling.sim@ppis.sg",
      "phone": [
        "65613462ext503",
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149232",
    "category": "Others",
    "name": "Coffee",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more packets of halal coffee for its beneficiaries. Thank you! \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Sim Yan Ling",
      "email": "yanling.sim@ppis.sg",
      "phone": [
        "65613462ext503",
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149231",
    "category": "Others",
    "name": "Cereal",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal boxes of cereals for its beneficiaries. Thank you! \n\n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": "500g",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Sim Yan Ling",
      "email": "yanling.sim@ppis.sg",
      "phone": [
        "65613462ext503",
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149230",
    "category": "Others",
    "name": "Cooking Oil",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal bottles of 2kg cooking Oil for its beneficiaries. Thank you! \n \nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": "2kg",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Sim Yan Ling",
      "email": "yanling.sim@ppis.sg",
      "phone": [
        "65613462ext503",
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149227",
    "category": "Others",
    "name": "10 Halal Cereal Boxes",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal cereal boxes for its beneficiaries. Thank you! RELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149226",
    "category": "Others",
    "name": "10 Halal Coffee 3-in-1 Packets",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal coffee 3-in-1 packets for its beneficiaries. Thank you! RELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149225",
    "category": "Others",
    "name": "10 Halal Assorted Biscuits",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal assorted biscuits for its beneficiaries. Thank you! RELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "145234",
    "category": "Others",
    "name": "Charnins Diapers XL x2",
    "description": "Single parent of 2-year old child who require diapers (Charnins diaper XL) x2. Child has heart condition and single parent has financial constraints working and juggling the caregiving needs of her son.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "C Kartikeya",
      "email": "kartikeya@fycs.org",
      "phone": [
        "69783011",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149218",
    "category": "Others",
    "name": "instant water heater and new installation charges",
    "description": "A family of four with toddlers aged 1 and 2 is seeking community support for an instant heater and installation fees. The father is focused on establishing his career, while the mother cares for their young children. Despite their efforts, they rely on financial assistance and have minimal savings after covering rent and essentials. The convenience of having hot water on demand would significantly ease their daily routines and cleaning.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Yishun",
      "name": "Yanyu Phua",
      "email": "phua_yanyu@msf.gov.sg",
      "phone": [
        "67564551",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149212",
    "category": "Others",
    "name": "10 Detergent",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more detergent for its beneficiaries. Thank you! RELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149211",
    "category": "Others",
    "name": "10 Halal Mushroom Tins",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal mushroom tins for its beneficiaries. Thank you! RELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149210",
    "category": "Others",
    "name": "10 Halal Tuna Cans",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal tuna cans for its beneficiaries. Thank you! RELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149208",
    "category": "Others",
    "name": "10 Halal Cooking Oil",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more halal cooking oil for its beneficiaries. Thank you! RELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Aisyah Binte Abdul Manan",
      "email": "nuraisyah.manan@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149182",
    "category": "Others",
    "name": "Handphone + Charger",
    "description": "The client is an elderly woman who suffered a stroke in 2006 and is currently living with her brother, who is 61 years old. However, their relationship is strained. The request for a mobile phone is due to safety concerns for the elderly woman. Although she has a landline, it is located in the hall area, which may not be easily accessible during an emergency. Having a mobile phone would allow her to keep it with her at all times, ensuring she can call for help if needed.(H)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149173",
    "category": "Others",
    "name": "Second hand Laptop",
    "description": "Patient is 62 years old, divorced with three adult children. She is unemployed due to arthritis and frozen shoulder. Eldest daughter is 29 years old with undiagnosed mental health condition. 2nd daughter, 26 years old is living with autism. She is unemployed. Youngest son is a year 1 university student. Eldest daughter is starting out on her own small business and needed the use of her laptop. 2nd daughter has been fighting with eldest daughter over the use of the laptop and it is causing significant distress to pt. Hence, pt is requesting for a secondhand laptop for her second daughter",
    "specifications": null,
    "contact": {
      "org": "Alexandra Hospital - Care &amp; Counselling",
      "name": "Samantha Lua",
      "email": "samantha_yusi_lua@nuhs.edu.sg",
      "phone": [
        "63706659",
        "63793260"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149170",
    "category": "Others",
    "name": "Urgent: interim daily essentials support",
    "description": "family of six, with four children under the age of six, is currently living in a 2-room flat. The father is the sole breadwinner, as the mother is occupied with caring for the young children. He has recently started a new job, earning less than $2,000 per month. Hence, family require temporary support. \n\nPlease whatsapp me at 8907 8297 for more details. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - HEART @ Fei Yue",
      "name": "Bernice  Chai",
      "email": "bernicechai@fycs.org",
      "phone": [
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149107",
    "category": "Others",
    "name": "Bicycle (can sit 1 passenger) with basket",
    "description": "Family consists of a mother with a child with special needs. She requires a bike to send her 8 year old child to the MRT every morning, to save cost and to avoid big crowds that can be overwhelming for her son. They would really benefit from your generous donation :-)",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society - Yishun FSC",
      "name": "Faith Felice Chiam",
      "email": "fchiam@childrensociety.org.sg",
      "phone": [
        "67537331"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149104",
    "category": "Others",
    "name": "Tena Proskin Pants Adult Diapers S Size",
    "description": "Client is an elderly widowed lady staying alone and requires support to purchase Tena Adult Diapers, S size as she is financially stretched out and bowel issues, requiring her to use diapers frequently.\n\nhttps://shopee.sg/Tena-PROskin-Pants-Plus-Adult-Diapers-S-M-L-XL-XXL-Size-i.1181215185.24564596400?sp_atk=c4151ae9-1e67-49a2-8c76-d503bdf77b27&xptdk=c4151ae9-1e67-49a2-8c76-d503bdf77b27\n\nKindly contact Christy at 9642 3618 to make the arrangement. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - Mental Health",
      "name": "Christy Lim",
      "email": "christylim@fycs.org",
      "phone": [
        "96423618",
        "64712022"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "150068",
    "category": "Infant and Children Items",
    "name": "Fairprice Stage 3 Formula",
    "description": "Parents are currently unemployed. Father was incarcerated and Mother has low education",
    "specifications": "3 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150067",
    "category": "Infant and Children Items",
    "name": "NTUC Diapers Size S",
    "description": "Ct is sole bread winner and on maternity leave. Hb recently got into accident and was retrenched. Financially difficult to get daily neccessities to cover 5 pax in family.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150066",
    "category": "Infant and Children Items",
    "name": "Grow 1 Formula",
    "description": "Ct is sole bread winner and on maternity leave. Hb recently got into accident and was retrenched. Financially difficult to get daily neccessities to cover 5 pax in family.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150057",
    "category": "Infant and Children Items",
    "name": "Baby Milk Formula - Aptamil Gold+ Stage 4",
    "description": "Family has two children, staying at a crisis shelter for survivors of family violence. Mother is currently looking for a job and requires some support with providing milk powder for her 3y/o daughter. She is requesting for Aptamil Gold+ Junior Stage 4.",
    "specifications": null,
    "contact": {
      "org": "Singapore Council of Women's Organisation (SCWO)",
      "name": "Chloe Yu",
      "email": "chloe_yu@scwo.org.sg",
      "phone": [
        "65710193",
        "68370611"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150055",
    "category": "Infant and Children Items",
    "name": "Baby Milk Formula - Aptamil Gold+ Stage 4",
    "description": "Family has two children, staying at a crisis shelter for survivors of family violence. Mother is currently looking for a job and requires some support with providing milk powder for her 3y/o daughter. She is requesting for Aptamil Gold+ Junior Stage 4.",
    "specifications": null,
    "contact": {
      "org": "Singapore Council of Women's Organisation (SCWO)",
      "name": "Chloe Yu",
      "email": "chloe_yu@scwo.org.sg",
      "phone": [
        "65710193",
        "68370611"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150054",
    "category": "Infant and Children Items",
    "name": "Lactogen 1 and  Lactogen 3",
    "description": "A single mother with two young children (a 15-month-old son and a 3-month-old daughter) resides in a one-room rental flat. She is the sole caregiver and currently unemployed. As she was occupied caring for her children, who were frequently unwell over the past month, she is now in need of urgent support for diapers and milk.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Hanissah Abdullah",
      "email": "hanissah@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150047",
    "category": "Infant and Children Items",
    "name": "Huggies Dry Comfort Pants XL",
    "description": "A single mother to her 4-year-old daughter is urgently seeking assistance with the provision of diaper pants for her child. The mother is the sole caregiver and is currently unemployed, facing significant financial constraints in meeting family’s basic needs. She would be grateful for any kind donations of diaper pants to help ease her financial burden and allow her to focus on caring for her child. Thank you!",
    "specifications": null,
    "contact": {
      "org": "AWWA Ltd - Transitional Shelter (JT)",
      "name": "Esther Tan",
      "email": "esther_tan@awwa.org.sg",
      "phone": [
        "65117278",
        "65111669"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "149042",
    "category": "Infant and Children Items",
    "name": "Rain cover for stroller",
    "description": "Community Services & Programmes @ Children's Society requires a rain cover (any brand) for her double stroller. Client was recently let go of her job and needs temporary financial help for her children's needs. The stroller model is",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "150035",
    "category": "Infant and Children Items",
    "name": "Milk",
    "description": "The family has three young dependents, including a 2-year-old boy who still needs milk formula due to his picky eating habits. The family is currently facing financial difficulties, as both parents are unemployed. They would benefit from receiving milk formula support.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Andrea Tan",
      "email": "andreatan@fycs.org",
      "phone": [
        "69783017",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150024",
    "category": "Infant and Children Items",
    "name": "Milk Powder [Karihome Goat Milk Infant Formula 0–12 months, 4 tins]",
    "description": "The family has six young children aged between 6 months and 10 years old. The youngest child (8 months old) developed severe eczema after consuming regular cow’s milk formula. Following medical advice, her milk was switched to Karihome Goat Milk, which has since led to significant improvement in her skin condition.\n\nThe family is currently facing financial hardship. The father is the sole breadwinner earning a low monthly income, while the mother is a full-time caregiver managing the children’s daily needs and multiple medical appointments. Due to the high cost of goat milk, the family is unable to afford it this month.\n\nWe are appealing for community support to provide a one-month supply (4 tins) of Karihome Goat Milk Infant Formula (0–12 months) to sustain the child’s nutrition and support her ongoing recovery and well-being.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Woodlands",
      "name": "Terence Ho",
      "email": "terenceho@carecorner.org.sg",
      "phone": [
        "63622481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150021",
    "category": "Infant and Children Items",
    "name": "Milk Powder [Nestle Nan Expert Pro - Lactose Free, 2 tins]",
    "description": "Family consists of two children, aged 11 months and 3 years old respectively. Client is the main financial provider and caregiver for these two grandchildren of hers. However, client has been struggling to get milk powder for her 3 year old grandson recently as she has faced with loss of income due to her health concerns (cataract). Client would hence require milk powder support until she completes her cataract surgery in August 2025.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150019",
    "category": "Infant and Children Items",
    "name": "Diapers [Huggies Silver Pants, Size: XXL, 4 packs]",
    "description": "Client is a single mother of 3 young children. She is a low income earner, working as a security guard. However there are months that Client face a loss of income due to caregiving needs of the children. Client is requesting for support in diapers and milk powder.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150018",
    "category": "Infant and Children Items",
    "name": "Diapers [Huggies Airsoft Pants, Size: L (9-14kg), 2 packs]",
    "description": "Client is currently unemployed while  caring for her two children (8y/o and 18 months). \n\nClient is pending renewal of ComCare assistance and currently has limited finances to purchase diapers for her child, which will only last till Fri (25/7). Client is navigating through other family stressors and will require temporary support to navigate the basic needs of the children.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150017",
    "category": "Infant and Children Items",
    "name": "Milk Powder [Similac Stage 3 Gain Growing-up Milk, 2 tins]",
    "description": "Client is currently unemployed while  caring for her two children (8y/o and 18 months). \n\nClient is pending renewal of ComCare assistance and currently has limited finances to purchase milk powder for her child, which will only last till next Wed (30/7). Client is navigating through other family stressors and will require temporary support to navigate the basic needs of the children.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150016",
    "category": "Infant and Children Items",
    "name": "Milk Powder [Enfagrow Stage 4, 2-3 tins]",
    "description": "The client and his wife are both earning low wages and have to support 3 young dependents and his elder parents with their basic and household needs. Meanwhile, client is paying high amount of debts that are incurred by his parents and his previous failed business. The support of milk powder will be important to ensure the needs of the toddler is not compromised.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150014",
    "category": "Infant and Children Items",
    "name": "Diapers [Huggies Tape Diapers, Size L, 1 pack]",
    "description": "Client is currently 4 months pregnant and has pre-hybrid cancer. She and her husband are caring for their 8-month-old son and 9 year old daughter. Husband is the sole breadwinner. The family are experiencing financial constraints and difficulties with paying for their rental fees of $500/month for their PPHS rental flat as husband is currently paying for maintenance of his 2 daughter from his previous wife and debts accumulated due to husband's past incarceration. Family is currently in urgent need of diapers as they are running on low supply and husband's salary is only coming in on 22nd.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150010",
    "category": "Infant and Children Items",
    "name": "Milk Powder [Abbott Ensure Life Strength Pro - Wheat]",
    "description": "Client (F/56) is a single mother living with her 2 sons and 1 daughter in a 3-rrom HDB flat. Client has multiple health issues and unable to secure employment. Her youngest son (M/16) recently suffered from indigestion, gastric issues and dyspepsia and has lost a significant amount of weight in the past few months. Due to his severe weight loss and loss of appetite, client is requesting for milk powder to ensure that his nutritional needs are met. However, the cost of the milk powder is expensive.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150009",
    "category": "Infant and Children Items",
    "name": "Milk Powder [Dugro Stage 4, 700g x 3 tins]",
    "description": "Family consist of 8 persons in the household living in a 2 room rental flat. Father has recently injured his spine and unable to work while mother is required to caregive for the youngest child while awaiting child care. They require temporary milk powder and diaper support for their toddler in the interim as there is currently no breadwinner in the household.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150008",
    "category": "Infant and Children Items",
    "name": "Pull-Up Diapers [Merries or Any Brand, Size XXL, 2 boxes]",
    "description": "Family consist of 8 persons in the household living in a 2 room rental flat. Father has recently injured his spine and unable to work while mother is required to caregive for the youngest child while awaiting child care. They require temporary milk powder and diaper support for their toddler in the interim as there is currently no breadwinner in the household.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "149991",
    "category": "Infant and Children Items",
    "name": "Similac Gain 3",
    "description": "Urgent Request for 3 tins of Similac Gain 3 milk powder for 2 young children from a family of 4. Parents are unable to seek gainful employment due to caregiving needs as the children tends to fall sick regularly and have low financial means to meet the basic essential needs of the children. Your kind assistance to this family is greatly appreciated.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Esther Ang",
      "email": "esther_ang@msf.gov.sg",
      "phone": [
        "62300887",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "149980",
    "category": "Infant and Children Items",
    "name": "Panties (Kotex Overnight Panties, M-L Size, 5 packs - 2 in each)",
    "description": "Client is a single mother and the main caregiver of a 10-year-old daughter and elderly mother. The daughter has a medical condition that causes heavy and prolonged menstrual bleeding.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149978",
    "category": "Infant and Children Items",
    "name": "Milk powder (Dumex Dugro Growing Up Milk Stage 3, 1.6 kg, 2 tins)",
    "description": "Client is unemployed due to caregiving commitments for toddler and 3 other school-going. Client hopes to receive temporary milk and diapers support as she seeks to secure employment. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149977",
    "category": "Infant and Children Items",
    "name": "Diapers tape (Any brand, XL, 4 packs)",
    "description": "Client is unemployed due to caregiving commitments for toddler and 3 other school-going. Client hopes to receive temporary milk and diapers support as she seeks to secure employment. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149976",
    "category": "Infant and Children Items",
    "name": "Milk powder (Fernleaf full cream, 1.8kg, 2 packets)",
    "description": "Client is main caregiver for a youth with special needs who requires regular milk feed as part of her nutrition and meal (Fernleaf milk powder). Client is unemployed due to caregiving responsibilities for 2 other school-going children and family members with mental health needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149975",
    "category": "Infant and Children Items",
    "name": "Diapers (Tena Proskin Slip, M Plus, 4 packets)",
    "description": "Client is main caregiver for a youth with special needs who requires use of adult diapers (Tena Proskin Slip Size M). Client is unemployed due to caregiving responsibilities for 2 other school-going children and family members with mental health needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149974",
    "category": "Infant and Children Items",
    "name": "Diapers Pants (XXL, PetPet brand/any other brand, 4 packs)",
    "description": "Low-income family is in need of diapers (XXL pants type, PetPet brand/any other brand) as well as milk power, for 8yo child who has congenital conditions due to premature birth.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149973",
    "category": "Infant and Children Items",
    "name": "Milk powder (Cowhead, 1.8kg, 3 tins)",
    "description": "Low-income family is in need of diapers (XXL pants type, PetPet brand/any other brand) as well as milk power, for 8yo child who has congenital conditions due to premature birth.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149972",
    "category": "Infant and Children Items",
    "name": "Milk powder (Fernleaf, full cream, 2 tins)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149971",
    "category": "Infant and Children Items",
    "name": "Diapers (Merries Pants Diapers, XL - 12-22kg, 2 packs)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149970",
    "category": "Infant and Children Items",
    "name": "Diapers (Merries Tape Type Diapers, L - 9 to 14kg, 3 packs)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149969",
    "category": "Infant and Children Items",
    "name": "Milk powder (PediaSure Peptigro No Sucrose Support Growth and Development, 800g, 3 tins)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149968",
    "category": "Infant and Children Items",
    "name": "Diapers (Fair Price Baby Dry Tape High Absorbancy, XL, 3 packs)",
    "description": "Client is a divorced single mother with 4 children. Currenrly two young children are under her care ( F, 11y/o and F, 1y/o), while her two other children are under the care of her ex-husband. Client stays with her mother as well, and is the main breadwinner of th family. However, due to the nature of Client's job, there are months where her income is little, resulting in tight living expenses, adding on to her stressors as a single mother. As such temporary support with diapers and milk powder would help to alleviate some of her financial stressors.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149966",
    "category": "Infant and Children Items",
    "name": "Milk powder (Nature one One Premium Todler Milk Powder - 1-3 years old, 1 tin)",
    "description": "Client is a divorced single mother with 4 children. Currenrly two young children are under her care ( F, 11y/o and F, 1y/o), while her two other children are under the care of her ex-husband. Client stays with her mother as well, and is the main breadwinner of th family. However, due to the nature of Client's job, there are months where her income is little, resulting in tight living expenses, adding on to her stressors as a single mother. As such temporary support with diapers and milk powder would help to alleviate some of her financial stressors.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149965",
    "category": "Infant and Children Items",
    "name": "Diapers (Mamypoko, XL, 3 packs))",
    "description": "Family of 5 is experiencing financial difficulty due to wife's mental health and husband's change of job which has significantly reduced his income and affecting the family's ability to meet their needs adequately.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "148798",
    "category": "Infant and Children Items",
    "name": "Huggies Dry Comfort, Pants, XL",
    "description": "Family is staying in rental flat. 2 children in autism spectrum and husband is sole bread winner. Needs the essentials as money was used for outstanding medical bills.",
    "specifications": "XL, 4pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "148488",
    "category": "Infant and Children Items",
    "name": "Frisolac Gold 2",
    "description": "Single mother caring for 2 children. She has to pay rent to her parents and finds it hard to financially care for her children.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149949",
    "category": "Infant and Children Items",
    "name": "Grow Milk Powder Stage 3",
    "description": "Looking for Grow Milk Powder stage 3 for family of 7 with 5 young children. This milk powder is to help alleviate some of the family's financial stressor while also ensuring that the children is able to receive adequate milk supply",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - @27 Family Service Centre",
      "name": "Camelia Binte Mohamad Aripin",
      "email": "camelia.aripin@montfortcare.org.sg",
      "phone": [
        "85181442",
        "62708327"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149944",
    "category": "Infant and Children Items",
    "name": "Playmat",
    "description": "A family with two young children is looking for a cushioned playmat or rug. As the family has a cat, they are looking for a playmat that can withstand cat scratches. Their downstairs neighbour has informed them that movements in the house can be quite audible. A cushioned playmat or rug would help reduce this noise and provide a comfortable play area for the children, whilst giving the parents peace of mind that they are not disrupting their neighbours.\n\nAny donations would be greatly appreciated. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Lee Hui Feng",
      "email": "lee_hui_feng@msf.gov.sg",
      "phone": [
        "63582349",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149937",
    "category": "Infant and Children Items",
    "name": "Frisolac Gold Stage 2",
    "description": "Ct is a single mother caring for 2 children. She has to pay rent to her parents and finds it hard to financially care for her children.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149925",
    "category": "Infant and Children Items",
    "name": "Dumex Dugro 4",
    "description": "Client (F/37) and her husband operate a household of 11 with 8 young children living within, 5 of whom are under the age of 10, one of whom has moderate to servere autism. The 3 youngest - whom this child with autism comprises - require milk formula to support their growth, development. As Client is unable to work due to physical health and caregiving concerns, her husband is the sole income earner and the family faces challenges meeting monthly expenses. Hence, provision of this item for some months will alleviate their financial burdens. \nPlease WhatsApp Ben at 8718-8440 or email at benjamin.ho@thkmc.org.sg to connect. Thank you.",
    "specifications": "1,6 Kg",
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149924",
    "category": "Infant and Children Items",
    "name": "Drypers Wee Wee Dry",
    "description": "Client (F/37) and her husband operate a household of 11 with 8 young children living within, 5 of whom are under the age of 10, one of whom has moderate to servere autism. The 3 youngest - whom this child with autism comprises - require diapers while they are being toilet trained. As Client is unable to work due to physical health and caregiving concerns, her husband is the sole income earner and the family faces challenges meeting monthly expenses. Hence, provision of this item for some months will alleviate their financial burdens. \nPlease WhatsApp Ben at 8718-8440 or email at benjamin.ho@thkmc.org.sg to connect. Thank you.",
    "specifications": "Size - S, XL, XXL",
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149904",
    "category": "Infant and Children Items",
    "name": "Feeding chair",
    "description": "Low-income family requires a baby feeding chair for their infant (around 6 months). Family comprises parents who are working to supplement the household expenses, with 2 young children.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Jalan Besar and Toa Payoh",
      "name": "Emilyn Teo",
      "email": "emilyn_teo@msf.gov.sg",
      "phone": [
        "67087820",
        "62957205"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "03 Oct 2025"
  },
  {
    "id": "149860",
    "category": "Infant and Children Items",
    "name": "Milk powder",
    "description": "Low-income family with two young preschool going children require support with milk powder (Dumex Dugro® Growing Up Milk Stage 3 and Stage 4).",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Amanda Soo",
      "email": "amandasoo@carecorner.org.sg",
      "phone": [
        "69784084",
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Oct 2025"
  },
  {
    "id": "149847",
    "category": "Infant and Children Items",
    "name": "XL Diapers (DryPers)",
    "description": "Low-income family of 4, with a 6 y/o son with special needs and a 4 y/0 younger brother. Father is the breadwinner while Mum is the primary caregiver of the 2 school-going children.",
    "specifications": null,
    "contact": {
      "org": "Rainbow Centre - Magaret Drive School",
      "name": "Nur Eshal",
      "email": "nureshal@rainbowcentre.org.sg",
      "phone": [
        "69780972",
        "64752072"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149830",
    "category": "Infant and Children Items",
    "name": "Milk and diapers",
    "description": "Young mum from low income family requires milk and diaper donation for her 5-month-old baby. Direct delivery to family in Commonwealth is appreciated.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Fitrah Nabilah",
      "email": "fitrahnabilah@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149828",
    "category": "Infant and Children Items",
    "name": "9 - 12 months baby clothes (Unisex/Boy)",
    "description": "Ct (F/40)  recently gave birth son in May 2025. She is currently unemployed due to her care responsibilities and intends to rejoin the workforce once son is in infant care next year. \nCt and her husband are also looking after 4 children. Their two youngest are in primary school and kindergarten, while the older children are still schooling or have only just begun working. Given the increased household expenses caring for a baby and the multiple family members at home, the family's income is stretched thin. In light of their situation, we are kindly appealing for your support in the form clothes donation for 9 to 12 months old baby.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Jurong",
      "name": "Shree Ganga D/O Rajasagran",
      "email": "ShreeGanga@thkmc.org.sg",
      "phone": [
        "88333080",
        "67169466"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "148795",
    "category": "Infant and Children Items",
    "name": "Drypers size L pants",
    "description": "Community Services & Programmes @ Children's Society requires 5 packets of Drypers size L pants for their client's child. Client comes from a low income family and client are waiting for assistance approval. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "148794",
    "category": "Infant and Children Items",
    "name": "Durgo Dumex stage 3",
    "description": "Community Services & Programmes @ Children's Society requires 5 tins of Durgo Dumex stage 3 milk powder for the client's child daily intake. Client comes from a low income family and client are waiting for assistance approval.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Oct 2025"
  },
  {
    "id": "149806",
    "category": "Infant and Children Items",
    "name": "Milk powder (1-2 tins)",
    "description": "Client has five children, having recently given birth to one. She is experiencing both caregiving and financial stress, as her husband's income is unstable due to a workplace injury impacting their household finances. As such, they are requesting for support for some neccessities for their youngest child,in particular baby diapers (Ideally Huggies S Diapers and Huggies XXL Pants)",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149805",
    "category": "Infant and Children Items",
    "name": "Diapers (S) Huggies brand x3-4",
    "description": "Client has five children, having recently given birth to one. She is experiencing both caregiving and financial stress, as her husband's income is unstable due to a workplace injury impacting their household finances. As such, they are requesting for support for some neccessities for their youngest child,in particular baby diapers (Ideally Huggies S Diapers and Huggies XXL Pants)",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149804",
    "category": "Infant and Children Items",
    "name": "Milk powder (3-4 tins)",
    "description": "Client has five children, having recently given birth to one. She is experiencing both caregiving and financial stress, as her husband's income is unstable due to a workplace injury impacting their household finances. As such, they are requesting for support for some neccessities for their youngest child,in particular baby diapers (Ideally Huggies S Diapers and Huggies XXL Pants)",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149802",
    "category": "Infant and Children Items",
    "name": "Huggies Dry Comfort Pants - L size",
    "description": "This is a household of 13, with a couple raising 11 children aged between 1 and 20 years old. The mother is currently pregnant and unable to work due to caregiving responsibilities, and the family is surviving solely on the father's income. Family is currently facing significant financial challenges. \nGiven their situation, they are struggling to meet the basic needs of their children. Parents are currently seeking donations of diapers for their youngest child (1 year old), which would greatly ease their burden.",
    "specifications": "L Size",
    "contact": {
      "org": "Singapore Children's Society - Yishun FSC",
      "name": "Yong Kwai Hoong",
      "email": "khyong@childrensociety.org.sg",
      "phone": [
        "67537331"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149798",
    "category": "Infant and Children Items",
    "name": "Milk Powder - Lactogen Stage 3",
    "description": "Client has 1 child. Client's wife will be giving birth in October. Client works a job that pays daily. In September, Client did not manage to work much due to accompanying wife to hospital. In October, Client will also not be able to work much due to caregiving. We are working with client on financial assistance but will take a while. We are seeking for 2-3 tins of Lactogen Stage 3 to support the family for the time being.",
    "specifications": "nil",
    "contact": {
      "org": "Care Corner Family Service Centre - Toa Payoh",
      "name": "Syed Syaamil Bin Syed Salim",
      "email": "syedsyaamil@carecorner.org.sg",
      "phone": [
        "69506651",
        "63561622"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149795",
    "category": "Infant and Children Items",
    "name": "Baby Diapers (M / Pants)",
    "description": "Family has 4 children (newborn, 1,2,3yo), the newborn just arrived in early Sept. Client is requesting for diapers support for her 1yo, and does not have preference on brands. Husband is the sole breadwinner of family that earns only around $2k per month to support family of 7. If you have a suitable item, please WhatsApp me at 6843 9619 thank you!\n\nBaby uses 2 packets of diapers per month",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149793",
    "category": "Infant and Children Items",
    "name": "Children Diapers",
    "description": "Household consist of six family members. Parents and 4 school going children. Father is the sole breadwinner of the family. At present, he is on 1 month of medical leave due to fractured hand. As he just joined a new workplace, he is on no pay leave during this period.\n\nOldest son is diagnosed with Autism. He is currently not toilet trained and needs to wear diapers. \n\nFamily is requesting support for children diapers. \n\nMamyPoko Pants 2XL and 3XL",
    "specifications": null,
    "contact": {
      "org": "Autism Association (Singapore)",
      "name": "Thaiyibah Noordeen",
      "email": "thaiyibah.noordeen@autism-association.org.sg",
      "phone": [
        "69509328",
        "65925627"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149784",
    "category": "Infant and Children Items",
    "name": "Diapers",
    "description": "Parent in need of diapers for children ages 1 and 2. Parent is not receiving any other assistance at the moment.  There is no income in this family",
    "specifications": "Size XL, Drypers Pull Up Pants",
    "contact": {
      "org": "AWWA Family Service Centre",
      "name": "Michele Gan",
      "email": "michele_gan@awwa.org.sg",
      "phone": [
        "65119488",
        "65119456"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149783",
    "category": "Infant and Children Items",
    "name": "Milk powder",
    "description": "Parent needs milk powder for her very young children (ages 1, 2 and 4 yrs old).  Client is trying to get a job but currently has no income.",
    "specifications": "Similac (for ages up to 4yo)",
    "contact": {
      "org": "AWWA Family Service Centre",
      "name": "Michele Gan",
      "email": "michele_gan@awwa.org.sg",
      "phone": [
        "65119488",
        "65119456"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149782",
    "category": "Infant and Children Items",
    "name": "Milk powder",
    "description": "Parent needs milk powder for her very young children (ages 1, 2 and 4 yrs old).  Client is trying to get a job but currently has no income.",
    "specifications": "Similac (for ages up to 4yo)",
    "contact": {
      "org": "AWWA Family Service Centre",
      "name": "Michele Gan",
      "email": "michele_gan@awwa.org.sg",
      "phone": [
        "65119488",
        "65119456"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149779",
    "category": "Infant and Children Items",
    "name": "Lactogen Stage 3",
    "description": "Family is staying in rental flat. Ct has 4 children, and youngest has just went into infant care. Ct would like to upskill herself and is looking for employment to better support family.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149776",
    "category": "Infant and Children Items",
    "name": "Huggies Pants Size L",
    "description": "Family is staying in rental flat. Ct has 4 children, and youngest has just went into infant care. Ct would like to upskill herself and is looking for employment to better support family.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149775",
    "category": "Infant and Children Items",
    "name": "Lactogen Stage 3",
    "description": "Family is staying in rental flat. Ct has 4 children, and youngest has just went into infant care. Ct would like to upskill herself and is looking for employment to better support family.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "148812",
    "category": "Infant and Children Items",
    "name": "Lactogen Stage 3 & Gold Stage 3",
    "description": "Family is staying in rental flat. 2 children in autism spectrum and husband is sole bread winner. Needs the essentials as money was used for outstanding medical bills.",
    "specifications": "2 each",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "148718",
    "category": "Infant and Children Items",
    "name": "Huggies pants size XL",
    "description": "Mom recently has to leave her job due to multiple medical conditions, which affects her daily functioning. Hb is the sole breadwinner for the family of 4 now, and barely making ends meet. Family will appreciate an adhoc assistance for diapers for the younger child, 3yo, for 2 months while they stabilize their situation.",
    "specifications": "XL size, 4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149738",
    "category": "Infant and Children Items",
    "name": "3x Drypers XXL",
    "description": "Family has 4 children including a toddler who is using diapers. Parents struggle to meet ends needs and are reliant on financial assistance for their daily sustenance. Mother is the sole breadwinner.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149737",
    "category": "Infant and Children Items",
    "name": "3x Drypers XL",
    "description": "Family has 2 school-going and 2 young children. Parents struggle to meet ends needs and are reliant on financial assistance for their daily sustenance. The drypers would benefit their toddler.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149730",
    "category": "Infant and Children Items",
    "name": "Minyak Telon Oil My Baby 8 Hours 85ml",
    "description": "Client's daughter is a teenage mother, who has just given birth in April 2025. Client is the sole breadwinner of the low income family. Client is requesting for the aforementioned medicinal oil as the baby frequently gets bloated, and they go through this product relatively fast. If you have this item or can assist to purchase this for the family, please reach out to me via WhatsApp at 6843 9619 thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149725",
    "category": "Infant and Children Items",
    "name": "Baby chair",
    "description": "Client is a single mother with two children. She has difficulty getting employed despite efforts made in job search. She has a son with ADHD and a 6 month old infant. She requires a baby chair for feeding as baby starts consuming soft food.",
    "specifications": "-",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Hannah Lim",
      "email": "hannahlimzhixin@fycs.org",
      "phone": [
        "69783487",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149718",
    "category": "Infant and Children Items",
    "name": "Baby clothes for 11mo",
    "description": "Family of 7 hopes to receive clothes for their infant daughter. Father is the sole breadwinner for the family and had recently, found a new job while mother supports in caregiving for the younger children. They continue to face financial constraints.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149711",
    "category": "Infant and Children Items",
    "name": "Dry pants Diapers (Any brand)",
    "description": "Client is married with a 4-year-old daughter. He met with a workplace accident more than 5 years ago and is unable to work. His wife is an LTVP holder and has not been able to secure employment. The family is solely relying on SSO/ComCare financial assistance for their daily living. In view of their family circumstances, we appreciate your support to assist this family. Thank you.",
    "specifications": "Size 3XL",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Muhammamd Farhan Bin Abdul Rahman",
      "email": "muhdfarhan.abdrahman@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149677",
    "category": "Infant and Children Items",
    "name": "Drypers Superdry Premium Pants - XXL",
    "description": "Family consists of 2 parents and 1 child (6 years old) with special needs (requiring high support needs). The parents face challenges in finding and maintaining employment because of their caregiving responsibilities. The family is facing significant challenges in meeting their basic needs and would greatly appreciate support with essential items like diapers. If you are able to help, please contact me at suryani_rahim@awwa.org.sg. Thank you for your generous support.",
    "specifications": null,
    "contact": {
      "org": "AWWA Early Intervention Centre @Fernvale Link",
      "name": "Suryani Bte Mohd Rahim",
      "email": "suryani_rahim@awwa.org.sg",
      "phone": [
        "65115650",
        "65115621"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149675",
    "category": "Infant and Children Items",
    "name": "Enfagrow Pro A+ Growing Up Milk Powder Formula - Stage 3",
    "description": "This family comprises two parents and their 22-month-old child, who has been diagnosed with Down Syndrome. Your donation will go a long way in providing the essential nutrients needed to support the child’s growth and overall well-being.\n\nThe mother is the primary caregiver, while the father, after being retrenched in July 2025, is currently working part-time as a delivery rider. Despite actively seeking full-time employment, he has not been successful, and the family continues to experience financial stress and uncertainty about their future.\n\nIf you would like to extend your support, please contact me at suryani_rahim@awwa.org.sg. Thank you for your generosity.",
    "specifications": null,
    "contact": {
      "org": "AWWA Early Intervention Centre @Fernvale Link",
      "name": "Suryani Bte Mohd Rahim",
      "email": "suryani_rahim@awwa.org.sg",
      "phone": [
        "65115650",
        "65115621"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149674",
    "category": "Infant and Children Items",
    "name": "MamyPoko Extra Dry Pants - XL (12 - 17kg)",
    "description": "This is a family of 4, with two children who have special needs age 3 and 8. The 3-year-old child wears diapers. He uses 6 diapers per day. The mother is the main caregiver while father works as a food delivery rider (there is a reduced income as the phone is not working). The high caregiving needs make it difficult to maintain employment and cause significant financial strain. Your support for diapers will offer much-needed relief while they wait for ComCare financial assistance approval. If you would like to support the family, please email us at suryani_rahim@awwa.org.sg. Brand: MamyPoko Extra Dry Pants - XL (12 - 17kg) Quantity: 5-6 packs Thank you for your generosity.",
    "specifications": null,
    "contact": {
      "org": "AWWA Early Intervention Centre @Fernvale Link",
      "name": "Suryani Bte Mohd Rahim",
      "email": "suryani_rahim@awwa.org.sg",
      "phone": [
        "65115650",
        "65115621"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149673",
    "category": "Infant and Children Items",
    "name": "Dr. P Pants Adult Diapers - XL / TENA Pants Super Unisex Adult Diapers - XL",
    "description": "This is a family of 4, with two children who have special needs age 3 and 8. The 8-year-old child wears diapers and faces challenges in toilet training due to sensory and communication needs. He uses 6 diapers per day. The mother is the main caregiver while father works as a food delivery rider (there is a reduced income as the phone is not working). The high caregiving needs make it difficult to maintain employment and cause significant financial strain. Your support for diapers will offer much-needed relief while they wait for ComCare financial assistance approval. If you would like to support the family, please email us at suryani_rahim@awwa.org.sg. Brand: Dr. P Pants Adult Diapers XL or TENA Pants Super Unisex Adult Diapers - XL Quantity: 6-8 packs Thank you for your generosity.",
    "specifications": null,
    "contact": {
      "org": "AWWA Early Intervention Centre @Fernvale Link",
      "name": "Suryani Bte Mohd Rahim",
      "email": "suryani_rahim@awwa.org.sg",
      "phone": [
        "65115650",
        "65115621"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Sep 2025"
  },
  {
    "id": "149632",
    "category": "Infant and Children Items",
    "name": "Frisolac Gold Stage 2",
    "description": "Client is a single mother caring for 2 children. She has to pay rent to her parents and finds it hard to financially care for her children.",
    "specifications": "4 pax",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "24 Sep 2025"
  },
  {
    "id": "149619",
    "category": "Infant and Children Items",
    "name": "Baby Dining Chair",
    "description": "Family consist of single mother who is looking for employment, daughter who is schooling and 9-month old granddaughter. Family has tight finances but would like to source for a baby dining chair for the growing 9-month old.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Tampines, Punggol  &amp; Pasir Ris",
      "name": "Victoria Lim",
      "email": "Victoria_SE_LIM@msf.gov.sg",
      "phone": [
        "65857009",
        "64244017"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "24 Sep 2025"
  },
  {
    "id": "149597",
    "category": "Infant and Children Items",
    "name": "PediaSure Gold",
    "description": "Family of 7 living in a 2rm rental flat, father is the sole breadwinner as mother is unwell and has been declared unfit for work currently. Youngest daughter (6yrs) requires milk to support her physical development",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - HEART @ Fei Yue",
      "name": "Hana Tyebally",
      "email": "hanatyebally@fycs.org",
      "phone": [
        "65138719",
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149590",
    "category": "Infant and Children Items",
    "name": "Diapers",
    "description": "Client is unemployed as she needs to take care of her 1 year-old daughter. Her husband is unable to provide financial support her. Hence, there is minimal amount of income to the household. The expenses on the daughter's milk powder and diapers can be taxing on the family.",
    "specifications": "mamy poko pants XL",
    "contact": {
      "org": "FRCS Family Service Centre",
      "name": "Eunice Koh",
      "email": "eunice@frcsfsc.sg",
      "phone": [
        "67799488ext17",
        "67799488"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "23 Sep 2025"
  },
  {
    "id": "149589",
    "category": "Infant and Children Items",
    "name": "Milk powder",
    "description": "Client is unemployed as she needs to take care of her 1 year-old daughter. Her husband is unable to provide financial support her. Hence, there is minimal amount of income to the household. The expenses on the daughter's milk powder and diapers can be taxing on the family.",
    "specifications": "Milk powder (Dumex Dugro 3)",
    "contact": {
      "org": "FRCS Family Service Centre",
      "name": "Eunice Koh",
      "email": "eunice@frcsfsc.sg",
      "phone": [
        "67799488ext17",
        "67799488"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "23 Sep 2025"
  },
  {
    "id": "149588",
    "category": "Infant and Children Items",
    "name": "Milk and Diapers",
    "description": "This is a family of 12 with one breadwinner as the mother has to ensure the caregiving of 6 children that are below 13 years-old. They require assistance with milk and diapers. Please support if you can. \n\nFor the 2yo:\nDugro stage 4\nHuggies pants size XL\n\nFor the 1yo:\nDugro stage 3\nHuggies pants size L",
    "specifications": null,
    "contact": {
      "org": "FRCS Family Service Centre",
      "name": "Ng Rui Fang",
      "email": "ruifang@frcsfsc.sg",
      "phone": [
        "67799488ext18",
        "67799488"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "23 Sep 2025"
  },
  {
    "id": "149571",
    "category": "Infant and Children Items",
    "name": "Baby Bed Guard",
    "description": "Client is currently not working due to her high caregiving responsibilities, and is faced with financial constraints. Client is the main caregiver of two young children and would require a baby bed guard for her queen sized bed. The bed guard will support client in attending to her elder child while ensuring the safety of her youngest child on the bed.",
    "specifications": "180cm x 150cm",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Champions Way",
      "name": "Joanna Tay",
      "email": "joannatay@fycs.org",
      "phone": [
        "66901029",
        "66901000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149554",
    "category": "Infant and Children Items",
    "name": "Milk Formula",
    "description": "An elderly caregiver of a 5-year old boy requires support for the purchase of milk formula. The elderly caregiver has been the sole breadwinner in the family as the boy's mother has recently been incarcerated. The support will greatly ease his financial needs. Do reach out to Marilyn at 81214654 or marilyn@newlifestories.org.sg for further clarifications, thank you!",
    "specifications": null,
    "contact": {
      "org": "New Life Stories Limited",
      "name": "Marilyn Heng",
      "email": "marilyn@newlifestories.org.sg",
      "phone": [
        "81214654",
        "63867688"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149551",
    "category": "Infant and Children Items",
    "name": "Kotex Overnight Panties (M-L Size, 5 packs - 2 pieces in each pack)",
    "description": "Client is a single mother and the main caregiver of a 10-year-old daughter and elderly mother. The daughter has a medical condition that causes heavy and prolonged menstrual bleeding.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149550",
    "category": "Infant and Children Items",
    "name": "Diapers (Tena Adult Diaper - Pull-Up Pants, XL, 3 packs)",
    "description": "Client is a single mother and the primary caregiver of a 12-year-old daughter and an elderly mother who requires adult diapers. Both the daughter and the elderly mother have multiple health conditions.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149549",
    "category": "Infant and Children Items",
    "name": "Milk powder (Dumex Dugro Growing Up Milk Stage 3, 1.6kg, 2 tins)",
    "description": "Client is unemployed due to caregiving commitments for toddler and 3 other school-going. Client hopes to receive temporary milk and diapers support as she seeks to secure employment. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149547",
    "category": "Infant and Children Items",
    "name": "Milk powder (Fernleaf Full Cream Milk powder, 1.8 kg, 2 packs)",
    "description": "Client is main caregiver for a youth with special needs who requires regular milk feed as part of her nutrition and meal (Fernleaf milk powder). Client is unemployed due to caregiving reponsibilities for 2 other school-going children and family members with mental health needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149546",
    "category": "Infant and Children Items",
    "name": "Diapers (Tena Proskin Slip M Plus, 4 packs)",
    "description": "Client is main caregiver for a youth with special needs who requires use of adult diapers (Tena Proskin Slip Size M Plus). Client is unemployed due to caregiving responsibilities for 2 other school-going children and family members with mental health needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149545",
    "category": "Infant and Children Items",
    "name": "Diaper pants (Petpet brand/any other brands, XXL, 4 packs)",
    "description": "Low-income family is in need of diapers (XXL pants type, PetPet brand/any other brand) as well as milk power, for 8yo child who has congenital conditions due to premature birth.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149543",
    "category": "Infant and Children Items",
    "name": "Drypers pants",
    "description": "Hi, a family of 4, residing in rental flat with two young children 0 and 2, requires some drypers (pants, size XL and M) for the months of Sep and Oct as they have insufficient income and require support while they are working towards self-reliance and financial stability. Appreciate your kind assistance and support for this family!",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Ooi Zhi Yong",
      "email": "ooi_zhi_yong@msf.gov.sg",
      "phone": [
        "63547306",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149541",
    "category": "Infant and Children Items",
    "name": "Milk powder (Fernleaf Full Cream Milk Powder, 2 tins)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149540",
    "category": "Infant and Children Items",
    "name": "Diapers (Merries Pants Diapers, XL - 12-22kg, 2 packs)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149539",
    "category": "Infant and Children Items",
    "name": "Diapers (Merries Tape Type Diapers, L - 9 to 14kg, 3 packs)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149538",
    "category": "Infant and Children Items",
    "name": "Milk powder (PediaSure Peptigro No Sucrose Support Growth and Development, 800g, 3 tins)",
    "description": "Client (F/25) is a single mother. She is currently living at parent's 3-room flat with her youngest son (M/8months) and is undergoing divorce and PPO proceedings against soon-to-be ex-husband. Older son (M/3) has returned to live with the family since March 2025. She recently started employment but is having difficulties managing financially due to the high expenses from her children's needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149537",
    "category": "Infant and Children Items",
    "name": "Diapers (Merries pants, XXL, 2 packs)",
    "description": "Family consists of client, husband and 2 young children. Husband is declared bankruptcy and client is currently sued for bankruptcy. Family requires support for diapers.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149535",
    "category": "Infant and Children Items",
    "name": "Diapers (Fair Price Baby Dry Tape High Absorbancy, XL, 3 packs)",
    "description": "Client is a divorced single mother with 4 children. Currently two young children are under her care (F, 11y/o and F, 1y/o), while her two other children are under the care of her ex-husband. Client stays with her mother as well, and is the main breadwinner of th family. However, due to the nature of Client's job, there are months where her income is little, resulting in tight living expenses, adding on to her stressors as a single mother. As such temporary support with diapers and milk powder would help to alleviate some of her financial stressors.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149534",
    "category": "Infant and Children Items",
    "name": "Milk powder (Nature One Premium Todler Milk Powder 1-3 years old, 1 tin)",
    "description": "Client is a divorced single mother with 4 children. Currenrly two young children are under her care ( F, 11y/o and F, 1y/o), while her two other children are under the care of her ex-husband. Client stays with her mother as well, and is the main breadwinner of th family. However, due to the nature of Client's job, there are months where her income is little, resulting in tight living expenses, adding on to her stressors as a single mother. As such temporary support with diapers and milk powder would help to alleviate some of her financial stressors.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149533",
    "category": "Infant and Children Items",
    "name": "Diapers (Mamypoko, XL, 3 packs)",
    "description": "Family of 5 is experiencing financial difficulty due to wife's mental health and husband's change of job which has significantly reduced his income and affecting the family's ability to meet their needs adequately.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149527",
    "category": "Infant and Children Items",
    "name": "Baby rocker/bouncer",
    "description": "Family consists of client, husband and 3 preschool children. Client (F/29) just delivered her 4th child in July 2025. Due to high caregiving responsibilities and family's low-income, client requires a baby bouncer/ rocker for her newborn.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "146112",
    "category": "Infant and Children Items",
    "name": "XL-Size Pull Up Diapers",
    "description": "Client has low pay and debt, which causes her to struggle to get basic items for her infant (1 year). She requires XL-size pull up diapers.",
    "specifications": "XL",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Choa Chu Kang",
      "name": "Farrzana Bte Mohd Sheriff",
      "email": "farrzana@fycs.org",
      "phone": [
        "69506562",
        "67625215"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149523",
    "category": "Infant and Children Items",
    "name": "Baby Safety Gate",
    "description": "[Please Whatsapp or email to liaise] Client requires baby gate to enhance supervision and safety for her young children. Family is low-income with 3 young school-going kids (learning needs, speech delay and autism) and 1 toddler (developmental delays). Husband is the sole-breadwinner as client is unable to work due to caregiving issues. Children has a number of various follow-ups for children's learning and developmental needs.",
    "specifications": "120cm",
    "contact": {
      "org": "Fei Yue Family Service Centre @ Yew Tee",
      "name": "Nur Farah Izzati Bte Shamsir Ali",
      "email": "farahizzati@fycs.org",
      "phone": [
        "64162177",
        "64162162"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Sep 2025"
  },
  {
    "id": "149469",
    "category": "Infant and Children Items",
    "name": "Children Diapers",
    "description": "Low-income family requires help with diapers for two toddlers diagnosed with high-risk asthma, requiring frequent hospital visits and admissions. The toddlers, aged 2 and 1, had been unwell the past month, including vomiting and diarrhoea, hence requiring frequent diaper change which fast depleted their supplies and limited income. Due to the toddlers' high care needs and prolonged recovery period, both parents had to care for them at home post hospital discharge. This affected Father's ability to work and earn an income; he is the family's sole breadwinner as Mother is unfit for work due to health and mental health issues. Please WhatsApp Mariah at 8718 8451 or email to mariahharmizah@thkmc.org.sg to assist.",
    "specifications": "Brand: Drypers Drypantz Size: XL & L",
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149426",
    "category": "Infant and Children Items",
    "name": "Milk Powder",
    "description": "Nuclear family of 3 with a 5 years old child with Autism. Due to feeding challenges, the child relies on formula milk for sources of nutrients. Mum is the sole breadwinner as Dad is the main caregiver and has been medically certified to be unfit for work.",
    "specifications": "Dumex Dugro Growing Up Milk - Step 4",
    "contact": {
      "org": "Rainbow Centre - Magaret Drive School",
      "name": "Lee Mei Yi",
      "email": "meiyilee@rainbowcentre.org.sg",
      "phone": [
        "68179466",
        "64752072"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149422",
    "category": "Infant and Children Items",
    "name": "Kid Diaper",
    "description": "Family consists of 4 members, including 2 young children. Client is the sole breadwinner of the family, earning limited income. The family is struggling financial and facing difficulties affording diaper for the children. Children are wearing diaper (size L), specifically FairPrice brand. Your donation would greatly help ease their funancial burden. Donation of any qty is very much appreciated.  Please Whatsapp Fang Ling at 8588 6196 or email fangling.koh@thkmc.org.sg to liase.",
    "specifications": "Size L (FairPrice brand)",
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "147346",
    "category": "Infant and Children Items",
    "name": "Sustagen all-in-one chocolate formula milk powder (1-9 years old)",
    "description": "Community Services & Programmes @ Children's Society requires 4 tins of Sustagen all-in-one chocolate formula milk powder (1-9 years old) for the client's child. Client requested for this formula milk as recommended by the child's doctor as she is not suited to drink normal formula milk due to weight gain. Client is the only breadwinner in the family as the child's father has been declared medically unfit to work. \nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "146675",
    "category": "Infant and Children Items",
    "name": "Milk and Diapers",
    "description": "Family has 2 children (M1, F2). Dad, sole-breadwinner only earns $1.2k/mth insufficient to support the family. He is also recently injured and refused surgery due to lack of finances to support his family. Wife is full-time caregiver as they are still unable to find placement for children's infant care/childcare.",
    "specifications": "Merries Pants L, MamyPoko Extra Dry Tape XL, Similac Stage 3 Gain plus, Similac Isomil 0-12mths",
    "contact": {
      "org": "MSF Social Service Office @ Geylang Serai",
      "name": "Ashikin Hazlan",
      "email": "ashikin_hazlan@msf.gov.sg",
      "phone": [
        "62319440",
        "62438753"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149385",
    "category": "Infant and Children Items",
    "name": "S-Size Diapers",
    "description": "Family of six is currently staying in a two-room rental flat.  While they are able to manage their day-to-day living expenses, they have difficulties in affording some essential basic needs. They are currently in need of diapers (small size) for their newborn daughter. If you are able to support with this request, please WhatsApp us at 8860 9255. thank you!",
    "specifications": null,
    "contact": {
      "org": "Singapore Red Cross Society",
      "name": "Siti Zaharah Binte Jahis",
      "email": "zaharah.jahis@redcross.sg",
      "phone": [
        "66640553",
        "66640500"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149383",
    "category": "Infant and Children Items",
    "name": "Child Safety Locks",
    "description": "[Please Whatsapp or email to liaise] Client requires child safety locks to enhance supervision and safety for her young children. Family is low-income with 3 young school-going kids (learning needs, speech delay and autism) and 1 toddler (developmental delays). Husband is the sole-breadwinner as client is unable to work due to caregiving issues. Children has a number of various follow-ups for children's learning and developmental needs.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Yew Tee",
      "name": "Nur Farah Izzati Bte Shamsir Ali",
      "email": "farahizzati@fycs.org",
      "phone": [
        "64162177",
        "64162162"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149369",
    "category": "Infant and Children Items",
    "name": "300 pcs for M drypers tape",
    "description": "This client may get dysregulated, and she is currently pregnant. Client's family consists of herself, her husband and 2 young children (>5yo) living in a rental flat. They have limited social support and chronic financial issues due to health concerns. Would benefit from practical support.Can whatsapp 6038 4091 if you are keen to cover transport arrangement & delivery cost",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149367",
    "category": "Infant and Children Items",
    "name": "75 pcs for XL drypers pants",
    "description": "This client may get dysregulated, and she is currently pregnant. Client's family consists of herself, her husband and 2 young children (>5yo) living in a rental flat. They have limited social support and chronic financial issues due to health concerns. Would benefit from practical support.Can whatsapp 6038 4091 if you are keen to cover transport arrangement & delivery cost",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149368",
    "category": "Infant and Children Items",
    "name": "75 pcs for XL drypers pants",
    "description": "This client may get dysregulated, and she is currently pregnant. Client's family consists of herself, her husband and 2 young children (>5yo) living in a rental flat. They have limited social support and chronic financial issues due to health concerns. Would benefit from practical support.Can whatsapp 6038 4091 if you are keen to cover transport arrangement & delivery cost",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "60384100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "16 Sep 2025"
  },
  {
    "id": "149352",
    "category": "Infant and Children Items",
    "name": "Playpen",
    "description": "Family of 11 requires a PLAYPEN (size of baby cot) for second youngest son to play in away from newborn. Free space in house is very limited, hence size should not exceed size of a baby cot. Ideal for playpen to be on the floor (as child likes to jump) and have higher walls.\n\n*Donor to cover delivery please",
    "specifications": "60cm x 120cm",
    "contact": {
      "org": "SHINE Children and Youth Services - Hougang",
      "name": "Ang Hua Jun",
      "email": "ang_huajun@shine.org.sg",
      "phone": [
        "62869905"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149335",
    "category": "Infant and Children Items",
    "name": "Dryper Size XL and Grow Stage 3",
    "description": "Family of 4 staying in a 2-room rental flat requires dryper size XL and Grow Stage 3 for her 2-year-old toddler. Husband is the sole breadwinner while she is currently pregnant with her 3rd child. Would great appreciate if donor is able to cover transport expenses.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149296",
    "category": "Infant and Children Items",
    "name": "Lactogen milk Stage 3 & Diapers size XL",
    "description": "Low income family of five are looking for donation of milk and diapers as they face financial strain this month from delayed income disbursements. Direct delivery to family in Queenstown area.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Fitrah Nabilah",
      "email": "fitrahnabilah@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Sep 2025"
  },
  {
    "id": "149246",
    "category": "Infant and Children Items",
    "name": "2x XXL Mamy Poko Pants",
    "description": "Low income family request for diapers for boys.",
    "specifications": null,
    "contact": {
      "org": "Hougang Sheng Hong Family Service Centre",
      "name": "Eric Chan",
      "email": "eric.chan@shenghong.org.sg",
      "phone": [
        "62895022"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Sep 2025"
  },
  {
    "id": "149185",
    "category": "Infant and Children Items",
    "name": "drypers/huggies Diaper - XL -3 packets",
    "description": "The client is a young mother to 4 years old and 2 years old, who recently got divorced. She is currently employed, but due to her elder daughter’s health condition—bronchiectasis—she has had to take frequent emergency leave. The client does not receive any support from her ex-husband at this juncture. As a result of her frequent absences from work, her monthly take-home pay is less than $900, and she is struggling to make ends meet while caring for her two young children.(H)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149171",
    "category": "Infant and Children Items",
    "name": "Urgent: Baby gate and cupboard/ fridge lock",
    "description": "This is a low income family of 6 with father as Single breadwinner, 5 children below 6 years old, living in 1 bedroom rental. All the children are highly active and mobile so all the old locks have been spoilt. Please whatsapp me @8907 8297 for more details. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - HEART @ Fei Yue",
      "name": "Bernice  Chai",
      "email": "bernicechai@fycs.org",
      "phone": [
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149152",
    "category": "Infant and Children Items",
    "name": "Similac Gain IQ Stage 3 Milk Powder",
    "description": "Our low-income beneficiaries require assistance with their necessities for their children while they work towards financial stability. These include milk powder and diapers. Club Rainbow only accepts unopened items.",
    "specifications": null,
    "contact": {
      "org": "Club Rainbow (Singapore)",
      "name": "Nurulhuda Binte Abu Bakar",
      "email": "nurul@clubrainbow.org",
      "phone": [
        "81336189",
        "63771789"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "09 Sep 2025"
  },
  {
    "id": "149147",
    "category": "Infant and Children Items",
    "name": "Drypers Dry Pants Diapers (Size L)",
    "description": "Family has 4 school-going children and a young toddler is looking for help with diapers (Drypers Pants L) donation. Father is the sole breadwinner currently and needs the extra help as he is in transiting to find full-time work. If you are able to help, please contact Jessie at 9643 3400 or email jessielim@fycs.org. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - Restorative Care Department",
      "name": "Jessie Lim",
      "email": "jessielim@fycs.org",
      "phone": [
        "96433400",
        "91708900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149140",
    "category": "Infant and Children Items",
    "name": "Mamy Poko Size L",
    "description": "Client (M/43) and his wife (F/42) are living in a rental flat. While they are able to manage their living expenses, they are still facing difficulties in affording some essential basic needs. They are currently in need of diapers and milk for their 2-year-old son (M/2)For further details, feel free to reach out Whatsapp Liana at 8588 3163 or email to Norliana.Roslan@thkmc.org.sg to liaise. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149139",
    "category": "Infant and Children Items",
    "name": "Nestle NAN Opti Pro Stage 4",
    "description": "Client (M/43) and his wife (F/42) are living in a rental flat. While they are able to manage their living expenses, they are still facing difficulties in affording some essential basic needs. They are currently in need of diapers and milk for their 2-year-old son (M/2)For further details, feel free to reach out Whatsapp Liana at 8588 3163 or email to Norliana.Roslan@thkmc.org.sg to liaise. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149137",
    "category": "Infant and Children Items",
    "name": "Milks - Grow Stage 3",
    "description": "Client (F/22) is a single parent with two children (F/4) and (M/3), living in a rental flat. She is actively looking for a job but has not been able to secure employment. The client is currently facing financial difficulties and is in need of milk and diapers for her children. For further details, feel free to reach out Whatsapp Liana at 8588 3163 or email to Norliana.Roslan@thkmc.org.sg to liaise. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149132",
    "category": "Infant and Children Items",
    "name": "Huggies (Size M & XXL)",
    "description": "Client (F/26) is currently not working. Her husband (M/30) is struggling with mental health issues and is now receiving treatment. They have two young children (M/4) and (M/8 months). The family is facing serious financial hardship and is struggling to afford basic living expenses. For further details, feel free to reach out Whatsapp Liana at 8588 3163 or email to Norliana.Roslan@thkmc.org.sg to liaise. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149130",
    "category": "Infant and Children Items",
    "name": "Baby Diapers - Size L (any brand)",
    "description": "Family has 4 children (1,2,3yo) and mom has just given birth in Sept. Client is requesting for diapers support for her older children. They do not have preference in brand or type (tape/pants). Husband is the sole breadwinner of family that usually earns only around $2k per month to support family of 6. However husband is also currently not working as he is staying home to assist client with her confinement, hence it is currently a financially challenging period for them. If you have a suitable item please WhatsApp me at 6843 9619 thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "08 Sep 2025"
  },
  {
    "id": "149128",
    "category": "Infant and Children Items",
    "name": "Milk and diapers support",
    "description": "Low income family of 6 with 4 school-going children with one breadwinner is struggling with expenses and would greatly appreciate any support for milk and diapers for their children. They are requesting for Milk powder (Dugro stage 4) and Drypers (Drypantz XL). If you have a suitable item, please WhatsApp me at 6843 9619 thank you!",
    "specifications": "Milk (Dugro stage 4), Drypers (Drypantz XL)",
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "08 Sep 2025"
  },
  {
    "id": "149119",
    "category": "Infant and Children Items",
    "name": "Children Diapers",
    "description": "Couple with two young children aged 2 & 1, and a school-going child, live in a two-room public rental flat. Husband is the family's sole breadwinner. Wife is unable to work due to her health issues as well as caregiving duties for their young children who often fall sick, requiring hospital admissions and recovery at home, causing them to miss childcare for extended periods. Their high care needs cause Husband to miss work, affecting their household income. Hence, the family would benefit from donation of diapers for the young children. Please WhatsApp Mariah at 8718 8451 or email to mariahharmizah@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Norlizawati Binte Hamid",
      "email": "norlizawati@thkmc.org.sg",
      "phone": [
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "150015",
    "category": "Medical Aids",
    "name": "Adult Diapers [Tena PROskin Pants, Size: XL, 2 packs]",
    "description": "The family consists of the client, his wife, their son and wife's mother. Family is facing financial difficulties due to their ongoing medical conditions and caregiving responsibilities of son and grandmother. Grandmother has multiple medical conditions which limits her mobility and the family requires support with her adult diapers.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150013",
    "category": "Medical Aids",
    "name": "Tena Adult Diapers [PROskin, Size: L, 4 packs]",
    "description": "Client is low-income earner and sole breadwinner of household of 5. His wife was recently diagnosed with muscle-related condition, which caused the weakening of muscles that led to continence issues. She is now heavily reliant on diapers. Family would require diapers' support as client is unable to sustain the high needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "150004",
    "category": "Medical Aids",
    "name": "Blood Pressure Monitor",
    "description": "Client is a single mother and the primary caregiver of a 12-year-old daughter and an elderly mother. Both the daughter and the elderly mother have multiple health conditions.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "60384207",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Oct 2025"
  },
  {
    "id": "149979",
    "category": "Medical Aids",
    "name": "Diapers (Tena Adult - Pull-Up Pants, XL size, 3 packs)",
    "description": "Client is a single mother and the primary caregiver of a 12-year-old daughter and an elderly mother who requires adult diapers. Both the daughter and the elderly mother have multiple health conditions.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "60384138",
        "60384120"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149940",
    "category": "Medical Aids",
    "name": "Ensure Plus Vanilla (237ml)",
    "description": "77-year-old patient with late stage cancer requires Ensure Plus Vanilla (237ml packets) for his nutrition. He drinks about 6 to 8 packets a day as his sole source of nutrition. Family is facing financial challenges to afford the milk feed - current financial assistance schemes are insufficient, and there is no income earner, since his wife is the sole caregiver while their son has just started his diploma studies, with no income earner in the family. \n\nIf keen to donate, please kindly contact me at 9727 4215. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Singapore Cancer Society",
      "name": "Lim Yi Xi",
      "email": "yixi_lim@singaporecancersociety.org.sg",
      "phone": [
        "97274215",
        "62219578"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149939",
    "category": "Medical Aids",
    "name": "Fresubin 2kcal Vanilla (200ml)",
    "description": "68-year-old male patient with late stage cancer requires 5 bottles of Fresubin 2 Kcal (Vanilla) per day as it is his only source of nutrition. He is unable to afford it as he has no income or savings. \n\nAppreciate if donor can contact me via Whatsapp at 97274215. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Singapore Cancer Society",
      "name": "Lim Yi Xi",
      "email": "yixi_lim@singaporecancersociety.org.sg",
      "phone": [
        "97274215",
        "62219578"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149633",
    "category": "Medical Aids",
    "name": "Desitin Diaper Cream (Blue)",
    "description": "Client is a single mother caring for 2 children. She has to pay rent to her parents and finds it hard to financially care for her children.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "24 Sep 2025"
  },
  {
    "id": "149455",
    "category": "Medical Aids",
    "name": "Diapers",
    "description": "Client is caring for two elderly parents who required medical needs. Client is earning low wages. Client's parent need to wear diaper daily due to medical issues.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Kreta Ayer Family Services",
      "name": "Rachel Fu",
      "email": "rachel.fu@montfortcare.org.sg",
      "phone": [
        "63254753"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149397",
    "category": "Medical Aids",
    "name": "Adult Pull-Up Diapers",
    "description": "Elderly mother had been diagnosed with dementia and has recently suffered from a hip fracture which impacted her mobility. Thus, she would require adult pull-up diapers in her day-to-day living presently. \n\n\nFamily is facing some financial constraints as her daughter had stopped working to provide full-time care while other family's members had unstable employment. \n\nElderly had been using the same diaper for 2-3 days despite her family's protests in a bid to save money as she is cognizant of the family's financial difficulties. \n\nHence, it would be really helpful if the family could procure donations of adult diapers (M size) to tide them through this current situation as elderly mother undergoes physical rehabilitation to improve her mobility.",
    "specifications": "Size M (Waist Size ranging from 50cm - 112cm)",
    "contact": {
      "org": "Montfort Care COMIT @ Bukit Merah",
      "name": "Sharon Ng",
      "email": "sharon.ng@montfortcare.org.sg",
      "phone": [
        "62746904"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  },
  {
    "id": "149293",
    "category": "Medical Aids",
    "name": "Tena adult diapers (pants, size L)",
    "description": "Single mother staying in Woodlands rental flat with multiple health conditions (kidney disease stage 5, diabetes, high BP, high cholesterol) is in need of Tena adult diapers (pants, size L). She is on diaper pants full-time and kidney dialysis 3x/week. The family has a tight budget for their daily needs and require additional support.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands, Sembawang",
      "name": "Sarrani Krishnan",
      "email": "sarrani_krishnan@msf.gov.sg",
      "phone": [
        "68678568",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Sep 2025"
  },
  {
    "id": "149235",
    "category": "Medical Aids",
    "name": "Pull Up Diapers",
    "description": "Client is a 65-year-old elderly female who is currently experiencing urinary tract infection (UTI) issues and ongoing incontinence. She also has arthritis and mobility difficulties, requiring medical escort services to attend her medical appointments. She lives with very limited income and faces a monthly deficit after covering basic expenses such as groceries, transport, and hygiene needs.\n\nGiven her current health condition and financial strain, client would benefit greatly from receiving adult L-size diapers to reduce the financial pressure and ensure she can manage her hygiene and medical needs. Preference is for the brand “Top,” though any L-size adult diapers will be helpful.",
    "specifications": "L sized Pull-Up",
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Harry Muhammad Shahari Bin Suhaimi",
      "email": "harrysuhaimi@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "148036",
    "category": "Medical Aids",
    "name": "Pull-Up Diapers and Undermats",
    "description": "Client is a 61-year-old elderly woman who is diabetic and an amputee, requiring pull-up adult diapers (Size L) for daily use. She is unfit for work due to her medical condition and mobility issues. She is also the primary caregiver for her school-going nephew. The family relies on limited informal support and would benefit from any donation of adult pull-up diapers (no tape-type) and underpads if available. Any brand and quantity are welcome; the more, the better.",
    "specifications": "Pull Up L Sized and above",
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Harry Muhammad Shahari Bin Suhaimi",
      "email": "harrysuhaimi@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "10 Sep 2025"
  },
  {
    "id": "149118",
    "category": "Attires/Clothings",
    "name": "Ladlies Draw String or Elastic Shorts",
    "description": "Seeking donation of pre-loved L size draw string or elastic ladies shorts for home wear. The shorts is for elderly aunty living in HDB rental flat. Note that the shorts should be in fairly good condition without any stains or holes. Many Thanks.",
    "specifications": "L size draw string or elastic shorts",
    "contact": {
      "org": "Moral Active Ageing Centre @ Kaki Bukit",
      "name": "Gary Tan",
      "email": "garytan@chkmps.org.sg",
      "phone": [
        "64486247"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149115",
    "category": "Attires/Clothings",
    "name": "Ladies Short Sleeve Floral Blouse",
    "description": "Seeking donation of pre-loved L size short sleeve floral blouse with front buttons. The blouse is for elderly aunty living in HDB rental flat. Note that the blouse should be in fairly good condition without any stains or holes. Many Thanks.",
    "specifications": "L size short sleeve with front buttons",
    "contact": {
      "org": "Moral Active Ageing Centre @ Kaki Bukit",
      "name": "Gary Tan",
      "email": "garytan@chkmps.org.sg",
      "phone": [
        "64486247"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Sep 2025"
  },
  {
    "id": "149935",
    "category": "Mobility Aids",
    "name": "Wheelchair",
    "description": "Family of 6. Mother is a homemaker due to her caregiving responsibilities and has challenges moving about as she experiences pain in her lower back and legs. Mother used to have a wheelchair which has been worn down, and unsuitable for use. Mother would require a wheelchair to aid her mobility as she heads out of the house.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Champions Way",
      "name": "Joanna Tay",
      "email": "joannatay@fycs.org",
      "phone": [
        "66901029",
        "66901000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Oct 2025"
  },
  {
    "id": "149314",
    "category": "Mobility Aids",
    "name": "PVC material wheelchair",
    "description": "We are seeking kind donors to help provide a PVC material wheelchair for a senior lady who is wheelchair-bound and weighs 102 kg. This material helps with shower use, as the PVC material is water-repellent on the seating area. \n\nThis will greatly improve her safety and fall risks. \n\n📞 If you’re able to help or would like more details, please contact Julia at 8126 2493.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services",
      "name": "Julia Soh Ying Li",
      "email": "juliasoh@fycs.org",
      "phone": [
        "63809155",
        "63809169"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Sep 2025"
  },
  {
    "id": "149294",
    "category": "Mobility Aids",
    "name": "Rollator frame",
    "description": "Client is an 87-year-old elderly, with no informal social support due to strained family relationships. This, coupled with her unemployment, have contributed to her financial constraints. \n\nAs a result, client requires support to obtain a rollator frame, as prescribed by physiotherapist.",
    "specifications": null,
    "contact": {
      "org": "Care Corner - Community Case Management Service Central",
      "name": "Alethia Toh",
      "email": "alethiatoh@carecorner.org.sg",
      "phone": [
        "62586601"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Sep 2025"
  },
  {
    "id": "150060",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Bicycle",
    "description": "Client is currently unemployed and would like to work as a food delivery driver to support his family, including his wife and their 4-year-old daughter. His wife is currently expecting and hence unable to work at the moment. We are seeking a donation of a bicycle to allow client to start working to support his family. Thank you.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Toa Payoh",
      "name": "Regina Pua",
      "email": "regina_pua@msf.gov.sg",
      "phone": [
        "67367647",
        "67157503"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Oct 2025"
  },
  {
    "id": "149791",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Pre loaded soothing music player",
    "description": "The client is 76 years old. She is socially isolated due to her poor mobility and Parkinson's disease. She enjoys soothing music to help her relax and occupy her time at home. However, she has no financial means to buy a music player.",
    "specifications": null,
    "contact": {
      "org": "Lions Befrienders Service Association (Singapore)",
      "name": "Chow Ching Hua",
      "email": "chinghua.chow@lb.org.sg",
      "phone": [
        "66814941",
        "63758600"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Sep 2025"
  },
  {
    "id": "149746",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Donations for basic household items (URGENT!)",
    "description": "*Interested donors please WHATSAPP 96183516/ OR EMAIL to liaise.* Elderly client living alone with no income (Husband passed away last year, her 2 sons is taking turn to care for her however they also have their own family and are financially tight. (floor magiclean/ dish washing liquid etc). Caseworker is looking for some assistance to help ease caregiver burden.Thank you!",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - Mental Health",
      "name": "Mindy Choo",
      "email": "mindychoo@fycs.org",
      "phone": [
        "60117651",
        "64712022"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149744",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Bicycle",
    "description": "Client is a 28 year old male struggling with multiple mental health challenges, rendering him unable to work. Client currently copes by smoking cigarettes and hopes to try cycling to replace smoking as a healthier coping mechanism. Client prefers a city bike.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Yishun",
      "name": "Samuel Chan",
      "email": "samuel.chan@montfortcare.org.sg",
      "phone": [
        "96423819",
        "64848040"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149728",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Bicycle",
    "description": "Client is a single mother who is sole caregiver to her young children. Client has been in search for jobs but unable to find one hence she hopes for a bicycle donation so that she can do grab delivery. Appreciate your kind donation that can help the family to meet their basic needs.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Tampines",
      "name": "Jessica Lim",
      "email": "jessicalim@carecorner.org.sg",
      "phone": [
        "67866225"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Sep 2025"
  },
  {
    "id": "149351",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Bicycle",
    "description": "Eldest daughter of 11-member family wishes for a bicycle to commute to work and do grab work to support family. Only her and father are working and contributing to family's income. Mother recently gave birth in August. \n\n*Donor to cover delivery cost",
    "specifications": "For 150 - 160cm youth",
    "contact": {
      "org": "SHINE Children and Youth Services - Hougang",
      "name": "Ang Hua Jun",
      "email": "ang_huajun@shine.org.sg",
      "phone": [
        "62869905"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Sep 2025"
  },
  {
    "id": "149297",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Iphone",
    "description": "Client is a LTVP holder who is going through multiple system barriers. Being unemployed and the primary caregiver to her 2-year-old son, client struggles to navigate the system barriers. She also has difficulties accessing the various systems as her handphone is no longer working. Client prefers an Iphone as she is more familiar with it as compared to android phones.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Sep 2025"
  },
  {
    "id": "149481",
    "category": "Kitchen Utility Items",
    "name": "Portable gas stove",
    "description": "Client is on long-term MC for 6 months, husband is the only sole breadwinner. The family consist of 8 members with 6 school-going children aged between 6 to 14. \nThe family is currently receiving insufficient finance support as client's husband employment is unstable and he is currently employed on a contract ad-hoc basis, with subsequent reviews to ascertain whether he can continue his employment. Client uses a portable gas stove to do some additional home cooking, a skill which she uses for additional income. Her current portable gas stove has stopped working, and as such has impacted her ability to generate additional income to support her family, and as such she is looking for a replacement.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Sep 2025"
  },
  {
    "id": "149411",
    "category": "Kitchen Utility Items",
    "name": "Portable Gas Stove",
    "description": "Client is on long-term MC for 6 months, husband is the only sole breadwinner. The family consist of 8 members with 6 school-going children aged between 6 to 14. \nThe family is currently receiving insufficient finance support as client's husband employment is unstable and he is currently employed on a contract ad-hoc basis, with subsequent reviews to ascertain whether he can continue his employment. Client uses a portable gas stove to do some additional home cooking, a skill which she uses for additional income. Her current portable gas stove has stopped working, and as such has impacted her ability to generate additional income to support her family, and as such she is looking for a replacement",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Soh Yong Sheng",
      "email": "sohyongsheng@fycs.org",
      "phone": [
        "69783086",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "17 Sep 2025"
  }
]