[
  {
    "id": "140159",
    "category": "Others",
    "name": "Handphone",
    "description": "Client is a homeless man who was recently released from prison. He is currently in need of a functioning handphone to remain contactable. Any functioning handphone will be gladly appreciated. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Kampong Kapor Community Services",
      "name": "Khairunisa Binte Rusli",
      "email": "khairunisarusli@kkcs.org.sg",
      "phone": [
        "62997662"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "01 Dec 2024"
  },
  {
    "id": "140124",
    "category": "Others",
    "name": "Supporting for children's school items",
    "description": "Child/7 YO entering P1 in 2025. he is currently cared for by mother, father in uninvolved in the care of child as parents are undergoing divorce. Mother needs practical assistance of purchasing child's new uniforms, PE shirts, school shoes and school socks, and other stationary and books. Looking for doner to support this single mum with a child. Please whatsapp me @8907 8297 to find out more! Thanks",
    "specifications": null,
    "contact": {
      "org": "HEART @ Fei Yue",
      "name": "Bernice  Chai",
      "email": "bernicechai@fycs.org",
      "phone": [
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140123",
    "category": "Others",
    "name": "Food Rations For Clients (URGENT!)",
    "description": "Requesting halal food rations urgently as our stocks are running very low for needy families who may not have money to buy food Items due to financial issues \nItems needed such as - \n10x packets of Rice (2.5KG/5KG\n20X packets of Maggie (Vegetarian/Non-Vegetarian)\n20x Halal Can Food [Meat -Sardine/Chicken etc] / [Vegetarian – Corn/Mushroom etc] \n10x Packets of Beehoon (Chilli Brand)\n20x Packets of Assorted Biscuits (example: Khong guan biscuits / Jacob)\n20x Packets of 3-in-1 Beverages (Milo/Coffee/Cereal Etc)\n5x Packets of Salt\n5x Packets of Sugar\n10 bottles of 1L cooking oil\n10 bottles of light/dark soya sauce\n\nAny amount is appreciated! Please call / email me before making any purchase as we have space constraint issues. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Patricia Poo",
      "email": "patriciapoo@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140115",
    "category": "Others",
    "name": "Halal Food Rations",
    "description": "The household consists of six members: both parents and four young children. At present, only one parent is employed, and their income is insufficient to cover the family’s basic needs. The family is in need of food rations to prepare meals, to ensure that their daily needs can be met.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140109",
    "category": "Others",
    "name": "Milk Formula and Diapers",
    "description": "2 packs of Abbott Similac AR Milk Formula - Stage 1, \n2 packs of Nestle Lactogen 3, \n4 packs of Drypers Wee Wee Dry L Size, \n2 packs of Drypers Drypantz Pants - XXL\n\nClient is a young parent of a 4-month-old son and 2-year-old son with limited social support following her husband's recent incarceration. Client has been the full-time caregiver to her 4-month-old son since his birth and the basic needs of the family was sustained solely by client's husband's income till his incarceration. Client is in dire need of milk formula and diapers for her young children in the midst of exploring alternatives in concretising financial support for the household in the absence of her husband.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140105",
    "category": "Others",
    "name": "Mobile Phone (elder friendly)",
    "description": "An elderly client with a chronic medical condition is requesting a mobile phone that is user-friendly and suitable for elderly individuals. She is currently living with her adult children, who have special needs, and would like a phone to use during emergencies to call for help when needed. If you require further information, please feel free to discuss it with her social worker, Ms. Seelvi. If you are willing to assist, please contact Ms. Seelvi at 86993152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140096",
    "category": "Others",
    "name": "Smartphone",
    "description": "Client is a 60-year-old single man with no family or significant social support. \n\nHe is currently rough sleeping and unemployed due to systemic barriers, as he has lost his NRIC. \n\nDespite actively seeking employment, he faces challenges because an NRIC is required for job applications. In order to get a replacement of NRIC, a registered address is required and client is rough sleep.\n\nAdditionally, client does not own a mobile phone, making it difficult for professionals to contact him or for him to access essential services.\n\nA smartphone would be a crucial resource for client, enabling him to access the Singpass app, where he could retrieve important personal information such as his bank account and CPF details. \n\nReceiving a smartphone would significantly help client overcome these barriers, providing him with a vital tool to pursue his employment goals and work toward improving his circumstances.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Kreta Ayer Family Services",
      "name": "Kelly Lim",
      "email": "kelly.lim@montfortcare.org.sg",
      "phone": [
        "63254753"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140094",
    "category": "Others",
    "name": "Smartphone (water resistant)",
    "description": "Father of a family of 5 needs a smartphone to continue doing food delivery as his current phone is spoilt. He is thus now unable to work. It would be good if the phone has waterproof or water resistant features as he may need to work in the rain especially in the rainy season these few months. His phone had spoilt due to being exposed to the rain while he was out working.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Lum Yi",
      "email": "lumyi@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140059",
    "category": "Others",
    "name": "Handphone",
    "description": "Client (F/36) who comes from a low-income family is currently staying at a temporary flat that HDB has loaned to them together with her 2 daughters aged 12 and 10 as their previous house caught fire and the house which HDB loaned to them temporarily is bare and empty. Client will require a smartphone as her current one is faulty.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "27 Nov 2024"
  },
  {
    "id": "140058",
    "category": "Others",
    "name": "Handphone",
    "description": "Client has mobility issues and has financial constraints and requires a new handphone as her current phone is faulty.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "27 Nov 2024"
  },
  {
    "id": "140057",
    "category": "Others",
    "name": "Handphone",
    "description": "Client has autoimmune disease and does not have many years left with her children. She has not been able to work due to her poor health. Her husband is a solebreadwinner of the family with 4 young children (4yo-12 yo) They have difficulties with their finances for their daily basic needs. Her phone has defects but does not have finances capabilities to repair nor buy a new handphone.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "27 Nov 2024"
  },
  {
    "id": "140054",
    "category": "Others",
    "name": "Ensure Life Strength Pro",
    "description": "Family has a youth with special needs who requires assistance in his ADLs. The youth also has some health concerns with multiple medical follow ups. Following a recent hospitalisation, the youth was advised to take Ensure milk by the dietician as he is severely underweight. The youth takes 2 tins a month. The need for milk powder consumption was an added expenses for the family. Father is the main breadwinner while mother is full time caregiver to the youth. Despite tight finances, the family is committed to care for the youth.",
    "specifications": null,
    "contact": {
      "org": "Rainbow Centre - Magaret Drive School",
      "name": "Seah Heng Yong",
      "email": "hengyongseah@rainbowcentre.org.sg",
      "phone": [
        "68179437",
        "64752072"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "27 Nov 2024"
  },
  {
    "id": "140049",
    "category": "Others",
    "name": "Oppo Reno 5 SmartPhone",
    "description": "Client, low vision, certified unfit to work by doctor, he is receiving CPF monthly payout (not more than $500) and under AIC home care assistance (monthly not more than $400). Client is a Oppo Reno 5 smartphone user, and the reason he only use Oppo Reno 5 is because of his vision and the familiarization with Oppo Reno 5, now his phone is spoilt and he cannot afford to buy a new one, he is seeking help from Pass It On for a Oppo Reno 5 smartphone, or any other Oppo Reno series smartphone if Oppo Reno 5 is not possible to wish for.",
    "specifications": null,
    "contact": {
      "org": "Singapore Association of the Visually Handicapped",
      "name": "Steven Yew Kwok Wai",
      "email": "steven@savh.org.sg",
      "phone": [
        "62514331ext507",
        "62514331"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "27 Nov 2024"
  },
  {
    "id": "140033",
    "category": "Others",
    "name": "Alphabet mat or carpet",
    "description": "Family of 5 is residing in rental flat. Family is requesting  donation of educational material so that their children can awuire their educational goals.Please WhatsApp Selvi at 86661336 or email to tamilselvi@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "140028",
    "category": "Others",
    "name": "Food ration (Halal)",
    "description": "Family of 5 is seeking food ration urgently. Husband is the sole breadwinner with limited income while the wife is seeking employment. They are in the midst of applying for financial assistance. Food ration will be helpful for the family in the interim. Please WhatsApp Fang Ling at 8588 6196 or email to fangling.koh@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "140013",
    "category": "Others",
    "name": "Food / Essential Ration",
    "description": "single male elder residing at rental unit seek food and essential items ration to ease his financial burden as he has limited financial sources. 2 in 1 coffee / tea, whole meal biscuit / shower gel and shampoo will benefit him alot.",
    "specifications": "NA",
    "contact": {
      "org": "Tsao Foundation - Hua Mei Clinic",
      "name": "Ryan Sim",
      "email": "ryansim@tsaofoundation.org",
      "phone": [
        "65939576",
        "66619545"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "139996",
    "category": "Others",
    "name": "Second hand mobile phone",
    "description": "Single mother is the sole breadwinner and main caregiver to her only child (aged 9). Client’s health concerns have recently impacted her ability to work as a GrabFood deliverer until she has recovered. With a decrease in income, client has financial constraints repairing her faulty handphone. She will benefit from a second hand handphone to enable her to reschedule her medical appointments and communicate with systems that are supporting her family.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Admiralty",
      "name": "Lei Hui Yun",
      "email": "leihuiyun@carecorner.org.sg",
      "phone": [
        "63658751"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139995",
    "category": "Others",
    "name": "Marketing Trolley",
    "description": "Client is a family of 12, resulting in high grocery needs. Client's trolley recently broke, resulting in inconveniences of having to buy hand-carry portions on multiple trips.",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Muhammad Suffian Bin Bahrin",
      "email": "muhammadsuffian@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "25 Nov 2024"
  },
  {
    "id": "139961",
    "category": "Others",
    "name": "Lucky Draw Prizes",
    "description": "PPIS Family Service Centre (West) is appealing for lucky draw prizes for our Back to School event on 7 December 2024, held for low-income families to encourage family bonding and to celebrate the success of their children in completing the school academic year to move on  to the next year.\n \nThis year, our theme is “Family First: Cherishing Togetherness”. We hope that the families can use this platform to harness and celebrate the strengths in their children/wards as they forge a closer bond with each other. Therefore, the prizes that we are looking for need to be suitable for families with children from preschool, primary, secondary to tertiary levels.\nIf you are keen to donate, do let us know before 29 Nov 2024.\nOur contact details are as follows:  \nOffice no: 6561 3462  \nOffice mobile no: 8322 6427\nContact person: Liyana\n\nThank you!  \n**Important note: We seek your understanding to not spread or share this message without prior consent. Your cooperation is greatly appreciated!",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Nur Liyana Binte Kamalruzaman",
      "email": "liyana.kamalruzaman@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139924",
    "category": "Others",
    "name": "Food rations",
    "description": "50yo lady with multiple complex health conditions, had a recent flare up of depression hence unable to work. Due to her limited savings and unemployment, she hopes to receive some food rations (rice, bread, fresh produce etc) to tide her through the interim while she focuses on her treatment. Kindly whatsapp me at 96409381 for coordination, thanks so much!",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Telok Blangah",
      "name": "Shanelle Tan",
      "email": "shanelle.tan@montfortcare.org.sg",
      "phone": [
        "62746904",
        "62708327"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139918",
    "category": "Others",
    "name": "2 packets of Samyang hot chicken Instant ramen",
    "description": "Client is currently staying in a shelter due to violence concerns and is the sole contributor for herself and her daughters. she has financial difficulties, and the instant noodles can help greatly to defray some costs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "22 Nov 2024"
  },
  {
    "id": "139914",
    "category": "Others",
    "name": "Handphone",
    "description": "The family has a toddler experiencing developmental delays. They are facing financial difficulties, with the mother being unemployed due to medical issues and the father working 12-hour shifts as a security guard. Their financial instability is further strained by incurred debts, making it challenging for them to afford basic necessities. Husband's phone was recently faulty. Due to their financial constraints, they are unable to afford a new phone. The family would appreciate if they receive donation for second-hand handphone.",
    "specifications": "Standard Size",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Muhammamd Farhan Bin Abdul Rahman",
      "email": "muhdfarhan.abdrahman@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139902",
    "category": "Others",
    "name": "Carton boxes",
    "description": "Sunbeam Place @ Children's Society requires around 30pcs of moving house boxes in assorted moderate sizes. Currently, when residents are discharged they use plastic bags to pack their staff. The teams would like to provide them with a more conducive and dignified experience when they finally discharge from SBP. Hence, we are asking for those carton boxes so keep and bring their stuff with them.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139897",
    "category": "Others",
    "name": "Mobile Phone",
    "description": "Single mother who is raising 5 girls requires a mobile phone for one of her daughters. The family lives in a rental flat and facing financial hardships. Daughter is undergoing much stress from the impact of divorce. Mum hopes to gift her a mobile phone, as one of daughter's coping is to listen to songs on youtube to feel better.",
    "specifications": null,
    "contact": {
      "org": "Kampong Kapor Community Services",
      "name": "Ko Wei Lin",
      "email": "koweilin@kkcs.org.sg",
      "phone": [
        "62942116ext202",
        "62997662"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "135314",
    "category": "Others",
    "name": "Tsunami Race Bike",
    "description": "Yishun Family Service @ Children's Society requires Tsunami Fixie Bike with fixed gear for the beneficiary.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "136670",
    "category": "Others",
    "name": "Good Lady 22 Complete Nutrimix Powder - Wheat Grass",
    "description": "Yishun Family Service @ Children's Society requires Good Lady 22 Complete Nutrimix Powder - Wheat Grass for their client who requires nutritional milk for breast feeding an infant and we welcome any quantity.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139887",
    "category": "Others",
    "name": "Hair Lice Lotion",
    "description": "Sunbeam Place @ Children's Society requires 50 bottles of Hair Lice Lotion with no preference in brand and size for the residents.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139884",
    "category": "Others",
    "name": "Halal Food Rations",
    "description": "Halal Food Rations. Client is a single father of four school-going children. While he is working full-time to support his family unit, the financial situation of the family remains tight. He has been taking on loans in order to purchase other necessities in the household, such as fans. As such, the family would like to request for help in the form of food rations to help alleviate their tight financial situation.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139874",
    "category": "Others",
    "name": "Halal food rations",
    "description": "Client has just completed her chemotherapy, is still recovering from its effects. She has recently started a part time job in F&B and is the sole breadwinner of the family. Client has 3 children (F/15), (M/12), (F/9) and she has the custody and care of all 3 children. The family's biggest concern is their finances as client has many arrears and debts for her housing loans and for her SP, hospital and Starhub bills. Client's FOO is also in the Philippines, and she receives little support from them. As such client is struggling to meet the daily needs of the family and is under tremendous stress from her financial difficulties and medical conditions.",
    "specifications": "NIL",
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "21 Nov 2024"
  },
  {
    "id": "135501",
    "category": "Others",
    "name": "Food rations",
    "description": "Stay alone elderly man, dependent on his savings and occasional government payout now. \n- Requires food rations to alleviate some of the cost of living",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Telok Blangah",
      "name": "Chen Jie Mei",
      "email": "jiemei.chen@montfortcare.org.sg",
      "phone": [
        "62746904",
        "62708327"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139873",
    "category": "Others",
    "name": "Halal Food Rations For Clients - Urgent!",
    "description": "Requesting halal food rations for needy families who may not have money to buy food Items due to financial issues Items needed such as - 20x packets of Rice (2.5KG/5KG 30X packets of Maggie (Vegetarian/Non-Vegetarian) 30x Halal Can Food [Meat -Sardine/Chicken etc] / [Vegetarian – Corn/Mushroom etc] 10x Packets of Beehoon (Chilli Brand) 30x Packets of Assorted Biscuits (example: Khong guan biscuits / Jacob) 30x Packets of 3-in-1 Beverages (Milo/Coffee/Cereal Etc) 10 bottles of 1L cooking oil 10 bottles of light/dark soya sauce. Any amount is appreciated! Please call / email me before making any purchase as we have space constraint issues. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139872",
    "category": "Others",
    "name": "Abbott grow infant baby formula step 1 (x2) Goon pants L (x3)",
    "description": "Both client and her husband are unemployed. Husband met with an accident hence unable to provide.\nThey have 2 school going children and a 9 months old baby. Family is financially struggling. 9 months old baby is still reliant on milk powder and diapers hence, would require assistance during this challenging period for them.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139871",
    "category": "Others",
    "name": "Abbott grow infant baby formula step 1 (x2) Goon pants L (x3)",
    "description": "",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139870",
    "category": "Others",
    "name": "milk (brand- similac 1) x2, diapers (any brand) size M x2 (tape) size XL x2, milk (brand -pedisure) x2 Food rations:  rice, maggi, oil, nuggets, fishball, hotdog, cheese, bread, biscuits, milo, milk, jam.",
    "description": "Client and her husband has mental health issues and has been diagnosed with depression and bipolar. Currently, they are unemployed and has 3 young school going children. The caregiving has been rather demanding for them and has difficulty in sustaining their daily necessities to support the family.  The requested items (food rations, diapers and milk powder) will greatly alleviate their distress and further support the caregiver role while they work towards employment and financial stability.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139861",
    "category": "Others",
    "name": "Handphone",
    "description": "Client is from a family of 5, has 3 children and her husband is the sole breadwinner with a low income and therefore they struggle with finances. One of the children has special needs. Recently, her husband's phone spoiled and he could not afford to purchase a new phone.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139853",
    "category": "Others",
    "name": "Food Rations",
    "description": "Requesting halal food rations for needy families who may not have money to buy food Items due to financial issues Items needed such as - 20X packets of Maggie (Non-Vegetarian) 30x Halal Can Food [Meat -Sardine/Chicken etc] / [Vegetarian – Corn/Mushroom etc] 10x Packets of Beehoon (Chilli Brand) 10x Packets of Assorted Biscuits (example: Khong guan biscuits / Jacob) 20x Packets of 3-in-1 Beverages (Milo/Coffee/Cereal Etc) 10 bottles of 1L cooking oil Any amount is appreciated! Please call / email me before making any purchase as we have space constraint issues. Donor to cover delivery charges Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Max Hong",
      "email": "maxhong@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139834",
    "category": "Others",
    "name": "Halal Food Rations For Clients",
    "description": "Requesting halal food rations for needy families who may not have money to buy food Items due to financial issues Items needed such as - 20x packets of Rice (2.5KG/5KG 30X packets of Maggie (Vegetarian/Non-Vegetarian) 30x Halal Can Food [Meat -Sardine/Chicken etc] / [Vegetarian – Corn/Mushroom etc] 10x Packets of Beehoon (Chilli Brand) 30x Packets of Assorted Biscuits (example: Khong guan biscuits / Jacob) 30x Packets of 3-in-1 Beverages (Milo/Coffee/Cereal Etc) 10 bottles of 1L cooking oil 10 bottles of light/dark soya sauce. Any amount is appreciated! Please call / email me before making any purchase as we have space constraint issues. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "139806",
    "category": "Others",
    "name": "Secondary 1 Text books year 2025",
    "description": "Low income transnational couple with 2 school going children looking for donors to sponsor school text books for their 14year old in Secondary 1 next year. \n14 year old has performed very well for his primary school final exams, scoring mostly A's. \nAs 14 year old is non citizen, family is required to purchase unsubsidized text books which is beyond the family's means.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Punggol 616",
      "name": "Mohd Fadil Bin Hassan",
      "email": "mohdfadil@allkin.org.sg",
      "phone": [
        "64355323"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139796",
    "category": "Others",
    "name": "Handphone",
    "description": "An elderly client requires a working mobile phone (Android) so that he can be contactable and access services in the community. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Singapore After Care Association",
      "name": "Lin Mingjie",
      "email": "mingjie@saca.org.sg",
      "phone": [
        "62942350"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139794",
    "category": "Others",
    "name": "Laptop",
    "description": "Client is a single mother and has a 13-year-old school going son. Client owned a donated second-hand laptop as son requires it for school, but it is no longer working. Client was recently terminated from her job and thus struggles to purchase a new one. Therefore, client hopes to receive assistance with regards to a second-hand laptop. Please contact Claudine at 6365 8751 to liaise with regards to this request.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Admiralty",
      "name": "Lei Hui Yun",
      "email": "leihuiyun@carecorner.org.sg",
      "phone": [
        "63658751"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139782",
    "category": "Others",
    "name": "Grocereies (Dry & Wet)",
    "description": "Low income family with 2 young children is requesting for groceries (both dry & wet). Client is the sole breadwinner for the house and his wife who has multiple physical and mental health concerns is the primary caregiver for the children. For further details, please contact their social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139770",
    "category": "Others",
    "name": "Toiletries",
    "description": "Client (M/38) is unemployed as he is the main caregiver of his daughter (5), who had been diagnosed with Autism, son (3), son (2-month-old) with Down Syndrome and his wife (38) who has been diagnosed with depression and is currently unfit for work and pregnant. The family will benefit from donation for groceries as they are struggling to meet their basic needs with limited finances. Additionally, client's sister-in-law is staying with them due to family issues, and she is not working due to anxiety.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "19 Nov 2024"
  },
  {
    "id": "139769",
    "category": "Others",
    "name": "Halal food groceris",
    "description": "Client (M/38) is unemployed as he is the main caregiver of his daughter (5), who had been diagnosed with Autism, son (3), son (2-month-old) with Down Syndrome and his wife (38) who has been diagnosed with depression and is currently unfit for work and pregnant. The family will benefit from donation for groceries as they are struggling to meet their basic needs with limited finances. Additionally, client's sister-in-law is staying with them due to family issues, and she is not working due to anxiety.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "19 Nov 2024"
  },
  {
    "id": "139662",
    "category": "Others",
    "name": "Groceries",
    "description": "Family of 3 consisting of client and her two children. While client is working, the family is adjusting to a single-income earner and the inability to get FAS. Thus, the family would require groceries assistance for November.",
    "specifications": "Groceries",
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 206B",
      "name": "Nurhanisah Binte Abdul Rahman",
      "email": "nurhanisah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139656",
    "category": "Others",
    "name": "Diapers",
    "description": "Client's father had a recent relapse of cancer and will be starting on chemo therapy next year. He was diagnosed with colon cancer in 2018 and underwent an operation to remove part of the colon that remove the cancerous cells. As such, he will need to be on diapers to manage his toileting. Client is working as a part-time porter at a hospital, having to manage the caregiving of her elderly parents (Aged 76 and 78). Because of client's low education background, she is stuck in lower waged work. As she is the main caregiver for her parents, she neeeds to engage in part-time employment in order to ensure parents are still being cared for. Her mother is also elderly in age and is weaker in her joints and limbs, unable to move around without assistance/walking frame. Client has applied for comcare assistance for financial support. While waiting for the approval, diapers for client's father will help to defray some household expenses while client continues to manage work alongside her caregiving duties.",
    "specifications": "16 packs - Adult Diapers Tena M sized, Tape",
    "contact": {
      "org": "Touch Community Services - Touch Family Enablement",
      "name": "Neo Xiao Hui",
      "email": "xioahui.neo@touch.org.sg",
      "phone": [
        "63179990",
        "63770122"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139643",
    "category": "Others",
    "name": "Halal Food Rations For Clients",
    "description": "Requesting halal food rations for needy families who may not have money to buy food Items due to financial issues Items needed such as - 20x packets of Rice (2.5KG/5KG\n30X packets of Maggie (Vegetarian/Non-Vegetarian)\n30x Halal Can Food [Meat -Sardine/Chicken etc] / [Vegetarian – Corn/Mushroom etc] \n10x Packets of Beehoon (Chilli Brand)\n30x Packets of Assorted Biscuits (example: Khong guan biscuits / Jacob)\n30x Packets of 3-in-1 Beverages (Milo/Coffee/Cereal Etc)\n10 bottles of 1L cooking oil\n10 bottles of light/dark soya sauce. Any amount is appreciated! Please call / email me before making any purchase as we have space constraint issues. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139639",
    "category": "Others",
    "name": "Android smart phone (any brand)",
    "description": "Client is from a low-income family with multiple young children who reside in a rental flat. As mother's mobile phone is faulty, she struggles to access resources for her children's needs. We seek a donor to provide a smartphone (no specific brand) for a mother with a proper adapter and charging cable for her replacement and ease of access to resources to support her children and alleviate the financial burden on the family. Please contact me at 98639806 via WhatsApp to arrange the provision. Thank you",
    "specifications": "Not applicable",
    "contact": {
      "org": "HEART @ Fei Yue",
      "name": "Joyce Lee",
      "email": "joyceleesl@fycs.org",
      "phone": [
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139627",
    "category": "Others",
    "name": "Milk Powder (Nature One Premium Todler [1-3 years old], 1 tin)",
    "description": "Client is a divorced single mother with 4 children. Currenrly two young children are under her care (F, 11y/o and F, 1y/o), while her two other children are under the care of her ex-husband. Client stays with her mother as well, and is the main breadwinner of th family. However, due to the nature of Client's job, there are months where her income is little, resulting in tight living expenses, adding on to her stressors as a single mother. As such temporary support with diapers and milk powder would help to alleviate some of her financial stressors.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139624",
    "category": "Others",
    "name": "Laptop",
    "description": "A single mother of 1 young son is in need of laptop as she wished to apply for a computer course to increase her chance of being employed.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139620",
    "category": "Others",
    "name": "Smart Phone",
    "description": "Single elderly man living alone in a rental flat who requires a smartphone as his current one is spoilt. He relies heavily on his phone to get his ad-hoc jobs which is his sole source of income. With the phone being spoilt, he is unable to seek employment hence affecting his ability to meet his basic needs. Client just require a basic smartphone that is functional. Secondhand phone is appreciated too.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Rena Goh",
      "email": "rena@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139618",
    "category": "Others",
    "name": "Food Rations",
    "description": "Requesting halal food rations for needy families who may not have money to buy food Items due to financial issues Items needed such as - 20X packets of Maggie (Non-Vegetarian) 30x Halal Can Food [Meat -Sardine/Chicken etc] / [Vegetarian – Corn/Mushroom etc] 10x Packets of Beehoon (Chilli Brand) 10x Packets of Assorted Biscuits (example: Khong guan biscuits / Jacob) 20x Packets of 3-in-1 Beverages (Milo/Coffee/Cereal Etc) 10 bottles of 1L cooking oil Any amount is appreciated! Please call / email me before making any purchase as we have space constraint issues. Donor to cover delivery charges Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Max Hong",
      "email": "maxhong@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "132788",
    "category": "Others",
    "name": "Adult diapers (size XL)",
    "description": "Client is a single mother and the sole breadwinner for her family. Her elderly mother has multiple health conditions and continence issues, requiring adult diapers.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Joyce Ng",
      "email": "joyceng@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "136212",
    "category": "Others",
    "name": "Adult diapers",
    "description": "Stroke survivor with prostate and incontinence issues needs diapers as he has unsteady gait and has trouble rushing to the toilet whenever he feels the need to relieve himself",
    "specifications": "L size",
    "contact": {
      "org": "Allkin Singapore's Active Ageing Centre @ Ang Mo Kio 469",
      "name": "Kei Ng",
      "email": "ngkhuankungkei@allkin.org.sg",
      "phone": [
        "64510898"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "14 Nov 2024"
  },
  {
    "id": "139605",
    "category": "Others",
    "name": "handphone",
    "description": "Client is requesting for a donated phone as his phone is faulty. He is facing some financial difficulties as he recently lost his job and has not been paid 2 months' salary by employer (currently appealing to MOM).(HW)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139590",
    "category": "Others",
    "name": "Groceries",
    "description": "I am writing to request your assistance for an elderly in her 70s who resides in a rental flat. She is the primary caregiver for her husband, who has Parkinson's disease, and her son, who has a mental health condition. Despite her own physical ailments and advanced age, she continues to care for her family with great dedication. However, she is facing significant financial and physical challenges and does not wish to burden others. To help her manage, we are requesting monthly donations of simple groceries to ensure her family can at least have basic meals.\n\nRequested Groceries:\n\n1)Rice\n2)Milk (Packets/Tins)\n3)Fairprice Rolled Oats\n4)Fresh Vegetables\n5)Fish\n6)Pork\n7)Chicken\nYour generosity in providing these essential items would greatly alleviate her burden and ensure that her family has the necessary nutrition. Any assistance you can provide will be deeply appreciated.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Community Services - Mental Health",
      "name": "Chris Tan",
      "email": "tanyonghong@fycs.org",
      "phone": [
        "96424877",
        "64712022"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139573",
    "category": "Others",
    "name": "Mobile phone",
    "description": "Client is visually impaired and unemployed due to multiple health conditions and in his 50s. His mobile phone that he has used for more than 5 years has spoiled recently. Family is low income and unable to afford purchasing a phone.",
    "specifications": "iPhone",
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Jocelyn Joy Gwee",
      "email": "Jocelyn@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139572",
    "category": "Others",
    "name": "Shopping trolley",
    "description": "Mother of 5 requires a shopping trolley for grocery shopping as she does not have a usable one presently. She is currently using a large, heavy one meant to transport goods but it is unsuitable as it is too heavy for use, especially given that she has backache and is still recovering after giving birth recently.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Jocelyn Joy Gwee",
      "email": "Jocelyn@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139571",
    "category": "Others",
    "name": "Mobile Phone",
    "description": "Client is currently incarcerated and will be released soon. The family is low income and the client is requesting for a mobile phone to stay connected with his Social Worker. If you have a suitable item please reach out to me at 9828 7307. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139562",
    "category": "Others",
    "name": "Lifree Powerful Pants",
    "description": "**Support for a 57-Year-Old Woman in Need of Adult Diapers** We are reaching out to seek support for a 57-year-old woman who is facing an incredibly difficult time in her life. Living alone in a small, rented one-room apartment, she is struggling with multiple challenges, both emotional and financial. She has been through a history of abuse by her two sons, who have since abandoned her and do not wish to have any contact with her. The trauma she endured has left her with deep emotional scars, leading to a diagnosis of depression. Currently, she is trying to survive on minimal government assistance (ComCare). She is unable to attend all her medical appointments because she fears accumulating bills that she cannot afford to pay. She is only able to wear this brand of pants as other brands causes discomfort, which in turns develops rashes.\nPlease whatsapp me @ 8518 3526",
    "specifications": "35-50 inch",
    "contact": {
      "org": "Montfort Care - GoodLife! @ Yishun",
      "name": "Danny Tan",
      "email": "danny.tan@montfortcare.org.sg",
      "phone": [
        "64840804",
        "64848040"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139544",
    "category": "Others",
    "name": "rice x1, milo x1, fresh vegetables and frozen foods, maggi mee x2, Vegetable cooking oil x1, biscuit tin x1, fresh milk x1, diapers x2 (any brands- size L), milk powder (x2) (grow-choc).",
    "description": "Client is a single parent who is unemployed and has 6 young school going children. The caregiving has been rather demanding for her and some of her kids are also attending special needs school. Client has difficulty in sustaining her daily necessities to support her family.  This food rations will greatly alleviate client's distress and further support her caregiver role.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139534",
    "category": "Others",
    "name": "Mamypoko pants size XXL Mamypoko Tape size L Pediasure Gold 1-10yrs  NAN Optipro Stage 2 Pigeon Wet Wipes Anti Bacterial Wet wipes",
    "description": "Client is unemployed due to caregiving responsibilities as she has 3 young children who is heavily reliant on diapers and milk powders. Client's husband is the sole breadwinner but unable to sustain family's needs due to his low income. The family will benefit with the requested items during this challenging period.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139533",
    "category": "Others",
    "name": "Adult diapers (any brand - Tape kind, Size M) Glucerna milk powder Body wet wipes",
    "description": "Client is an elderly woman and the main caregiver for her husband who is ADL dependent and bed-bound. Client's husband requires diapers and milk powder which is running out and client is unable to afford at the moment. Client currently is not receiving any financial support from family due to strained relationships. Hence, the diapers and milkpowder would be beneficial for client and her husband to sustain for this period of time.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139532",
    "category": "Others",
    "name": "Milk Powder",
    "description": "ouple has 2 young children (a 2-year-old and a 1-month-old baby) living with them. Client is currently unemployed and is a full-time caregiver for her children, while her husband is the sole breadwinner supporting the family. Client has recently expressed concern about their tight finances, especially due to the high cost of milk powder for her 2-year-old. Child is drinking Pediasure Gold growing-up milk, and they are hoping to receive assistance to cover 1 month’s supply of milk for him.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Nurhidayah Binte Sazali",
      "email": "hidayah@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139521",
    "category": "Others",
    "name": "Food ration",
    "description": "Family of 5 is seeking food ration urgently. Husband is the sole breadwinner with limited income while the wife is seeking employment. They are in the midst of applying for financial assistance. Food ration will be helpful for the family in the interim. Please WhatsApp Fang Ling at 8588 6196 or email to fangling.koh@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "137258",
    "category": "Others",
    "name": "Bread Spread(Assorted Jam)",
    "description": "Our home need 50 bottles of assorted jam (any brand) for our 430 elderly residents. Thank You",
    "specifications": null,
    "contact": {
      "org": "Ju Eng Home For Senior Citizens",
      "name": "Lee Jun Hui",
      "email": "junhui@jeh.org.sg",
      "phone": [
        "64846890ext127",
        "64846890"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "131258",
    "category": "Others",
    "name": "Hiking Camping Equipment Terrain Transport Trolley",
    "description": "Sunbeam Place @ Children's Society requires 2pcs of Nature Hiking Camping Equipment Terrain Transport Trolley Quechua for the home.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "139462",
    "category": "Others",
    "name": "",
    "description": "Client is a single parent and has 2 young children and has complex needs. She is trying to sustain with basic needs from her limited income  which is not sufficient for her. Hence, the requested food rations and household items will be beneficial for client and her children to sustain for this period of time.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139461",
    "category": "Others",
    "name": "Nestle Nan Supremepro H.A Milk Formula - Stage 2  x 4",
    "description": "The client, a PR, and her husband, an LTVP holder, recently welcomed a newborn but are currently facing financial difficulties due to medical bills from the delivery and the child’s medical complications. They are not eligible for any financial support due to their PR and LTVP status. Providing milk powder support would help alleviate some of their expenses, allowing them to stabilize their finances during this challenging time.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139449",
    "category": "Others",
    "name": "5G handphone",
    "description": "Client requires a 5G phone as current phone does not support 5G line. It is challenging for her to also change her mobile line, as it might require her to change her number which may affect her singpass, paynow, etc. Given her difficulties with navigating systems and client is not tech-savvy, having a 5G phone would help to ease her challenges.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "08 Nov 2024"
  },
  {
    "id": "139410",
    "category": "Others",
    "name": "Android Phone",
    "description": "This family consists of four members of which 2 children are in primary school. The wife is currently the sole breadwinner as her husband has low vision. The husband's phone screen is damaged, and he is in need of a replacement.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Darlene Chew",
      "email": "darlene_qj_chew@msf.gov.sg",
      "phone": [
        "62319419",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "139403",
    "category": "Others",
    "name": "Fresubin Milk Cuppuccino Flavour",
    "description": "Elderly lady is living with her son and a helper, but unfortunately, her son is struggling to make ends meet due to his current situation. She has been diagnosed with dementia and osteoporosis, which makes her health needs particularly important. Her doctor has recommended that she drink flavored milk to ensure she gets the necessary nutrients, since she refuses to drink regular milk.\n\nSadly, the cost of these specialized milk products is beyond what her son can afford right now. We want to ensure she receives the nutrition she needs to stay healthy and comfortable.\n\nI am seeking donations of flavored milk—Fresubin brand, Cuppuccino Flavour, or similar type that you can spare. Your generosity will directly support her health and well-being.",
    "specifications": "Fresubin milk",
    "contact": {
      "org": "Montfort Care - GoodLife! @ Yishun",
      "name": "Mabel Loo",
      "email": "mabel.loo@montfortcare.org.sg",
      "phone": [
        "96504736",
        "64848040"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "06 Nov 2024"
  },
  {
    "id": "139380",
    "category": "Others",
    "name": "Mobile Smartphone",
    "description": "Client is a homeless gentleman. He is currently unemployed. Due to financial constraints, he has not been able to replace his mobile phone even though it has spoilt (screen is half blacked out, issues with his audio). Requesting donation of a functional smartphone to help facilitate communications, and to facilitate delivery to our shelter at Yio Chu Kang as client has limited mobility.",
    "specifications": null,
    "contact": {
      "org": "New Hope Community Services",
      "name": "Claire Yuen",
      "email": "claire@newhopecs.org.sg",
      "phone": [
        "80310939",
        "63059620"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139378",
    "category": "Others",
    "name": "Laptop",
    "description": "Client is a 62yo man who has no income and is in recovery from multiple health conditions. He is motivated to search for employment and upskill himself after journeying through difficult periods of navigating loss and family relationships. A laptop donation would be pivotal in his ability to work towards independence through employment and skills upgrading searches. A used but good condition laptop is fine as well.",
    "specifications": null,
    "contact": {
      "org": "Viriya Community Services - Whispering Hearts Family Service Centre",
      "name": "Tee Hui Wen",
      "email": "huiwen@viriya.org.sg",
      "phone": [
        "67951008"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139351",
    "category": "Others",
    "name": "Mobile phone",
    "description": "A single mother with 8 children requires a mobile phone as the one she has currently is spoilt she requires a phone to be able to remain contact with her kids",
    "specifications": "Android phone",
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Nurhidayah Binte Sazali",
      "email": "hidayah@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139265",
    "category": "Others",
    "name": "Grocery Support",
    "description": "Family of 6 with 4 young children, father is the sole breadwinner and is struggling to support the family financially due to difficulties finding a suitable job. \n\nGrocery support will support in alleviating the family's financial stress and give children adequate food.",
    "specifications": null,
    "contact": {
      "org": "HEART @ Fei Yue",
      "name": "Oh Rui Yun",
      "email": "ohruiyun@fycs.org",
      "phone": [
        "97522900",
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139258",
    "category": "Others",
    "name": "Nestle Milo 3 in 1 - Gao Siew Dai",
    "description": "PPIS FSCW RELIGHT would like to request for 10 or more packets of Nestle Milo 3 in 1 - Gao Siew Dai for its beneficiaries. Thank you! \n\nRELIGHT is an initiative by PPIS FSC (West) to actively support beneficiaries through disbursement of donated items from individuals and corporate donors. These include daily necessities and fresh produce, which is distributed every quarter of the year.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Sim Yan Ling",
      "email": "yanling.sim@ppis.sg",
      "phone": [
        "65613462ext503",
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139252",
    "category": "Others",
    "name": "Brand New Cooking Frying Pans",
    "description": "VOX @ Children's Society requires 3 brand new cooking frying pants with no preference of brands. They required these for their cooking programme for our youths. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139251",
    "category": "Others",
    "name": "Brand New Cooking Pots",
    "description": "VOX @ Children's Society requires 3 brand new cooking pots with no preference of brands. They required these for their cooking programme for our youths. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139242",
    "category": "Others",
    "name": "Fresh Groceries",
    "description": "Client is a single moother who who require fresh frozen food groceries so that she can cook healthier meals for the family. Client has one 4 years old daughter, 8 months daughter and a 17 years old younger sister. She is the sole breadwinner of the family and due to the volatile work arrangement due to caregiving needs, she require some fresh groceries to tide her through.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Punggol 616",
      "name": "Amos Liu",
      "email": "amosliu@allkin.org.sg",
      "phone": [
        "64355323"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "01 Nov 2024"
  },
  {
    "id": "139241",
    "category": "Others",
    "name": "Grocery Support",
    "description": "Family of 6 with 4 young children, father is the sole breadwinner and is struggling to support the family financially due to difficulties finding a suitable job. \n\nGrocery support will support in alleviating the family's financial stress and give children adequate food.",
    "specifications": null,
    "contact": {
      "org": "HEART @ Fei Yue",
      "name": "Oh Rui Yun",
      "email": "ohruiyun@fycs.org",
      "phone": [
        "97522900",
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139225",
    "category": "Others",
    "name": "Phone",
    "description": "ios requirements: minimum version ios 12, must not be jailbroken or android requirements: minimum version android 8.0, must not be rooted.\n\nClient (76yo) has a history of homelessness and is going through financial difficulties and family issues. He is currently retired and was previously working a low-income job. Client faces challenges in communicating with support systems currently as he does not have a phone. Thus, client is seeking donation of a second-hand phone so that he can be contactable, and also to facilitate his HDB rental flat application.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139222",
    "category": "Others",
    "name": "Halal Food Rations",
    "description": "Client is a young adult, aged 21. Due to lack of family support, client has been studying and working independently to support herself and her daily needs. Due to client's poor physical health and mental health in the month of Oct 2024, client as not been able to take on shifts at work, reducing her income in the month of Oct 2024. As such, client's financial situation for the month of Oct 2024 is very tight. She would require some support in terms of supporting her through practical needs like food rations in order to tide through the month.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "140133",
    "category": "Infant and Children Items",
    "name": "Dumex Dulax Infant formula milk powder 800g",
    "description": "The couple is facing caregiving challenges in taking care of their child (3 months). The child appears to be hypervigilant and requires constant soothing from the parents. The child is not able to sleep through the night, which disrupts the couple's sleep. This led to the Father losing his employment. The couple requires support in diapers and milk powder. The couple shows motivation to adjust their lifestyle to cater to their child's needs.",
    "specifications": "5 cans of Dumex Dulax Infant formula milk powder 800g",
    "contact": {
      "org": "Fei Yue Community Services",
      "name": "Tharvini d/o Nadarajah",
      "email": "tharvini@fycs.org",
      "phone": [
        "67690430",
        "63809169"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140132",
    "category": "Infant and Children Items",
    "name": "Huggies Naturemade (Tape) M Size Diapers",
    "description": "The couple is facing caregiving challenges in taking care of their child (3 months). The child appears to be hypervigilant and requires constant soothing from the parents. The child is not able to sleep through the night, which disrupts the couple's sleep. This led to the Father losing his employment. The couple requires support in diapers and milk powder. The couple shows motivation to adjust their lifestyle to cater to their child's needs.",
    "specifications": "5 packets of M Size Diapers",
    "contact": {
      "org": "Fei Yue Community Services",
      "name": "Tharvini d/o Nadarajah",
      "email": "tharvini@fycs.org",
      "phone": [
        "67690430",
        "63809169"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140127",
    "category": "Infant and Children Items",
    "name": "children's table",
    "description": "Client - single mother with 2 children hopes to receive children's table to train her child with special needs to sit down and eat properly.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Bukit Batok",
      "name": "Wong Wing Sang",
      "email": "wongwingsang@fycs.org",
      "phone": [
        "69784261",
        "65690381"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140120",
    "category": "Infant and Children Items",
    "name": "Diapers (Size XL Or XXL)",
    "description": "Family consist of single mother and 4 children. Father is not providing maintenance to the family. Mother needs support with diapers, for F4 and M5. Any brand, either size XL or XXL",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Punggol 616",
      "name": "Nur Fatin Athirah Binte Mohamad Husaini",
      "email": "fatinathirah@allkin.org.sg",
      "phone": [
        "64355323"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140062",
    "category": "Infant and Children Items",
    "name": "School supplies",
    "description": "Single mother of 5 requires financial support to purchase supplies for her school-going children such as stationery, school bags, water bottles and school shoes. The support will greatly ease her financial burden due to her limited income. Do contact Marilyn at 81214654 or drop an email to marilyn@newlifestories.org.sg for further clarifications. Thank you!",
    "specifications": null,
    "contact": {
      "org": "New Life Stories Limited",
      "name": "Radiant Chua",
      "email": "radiant@newlifestories.org.sg",
      "phone": [
        "92392550",
        "63867688"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "27 Nov 2024"
  },
  {
    "id": "132154",
    "category": "Infant and Children Items",
    "name": "Pediasure® Gold w Peptigro Vanilla 850g",
    "description": "Our low-income beneficiaries require assistance with their necessities for their children while they work towards financial stability. These include milk powder and diapers.\n\nClub Rainbow only accepts unopened tins.",
    "specifications": null,
    "contact": {
      "org": "Club Rainbow (Singapore)",
      "name": "Nurulhuda Binte Abu Bakar",
      "email": "nurul@clubrainbow.org",
      "phone": [
        "81336189",
        "63771789"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "140004",
    "category": "Infant and Children Items",
    "name": "Diapers (Mamypoko Size, XL, 3 packets)",
    "description": "Client's daughter is a single teenage mother. Client has difficulty supporting the young grandchild's needs due to her meagre income.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "139965",
    "category": "Infant and Children Items",
    "name": "Dugro Stage 3",
    "description": "Beneficiary has 4 children, eldest with special needs and 3 younger ones below the ages of 5. She is diagnosed with a mental illnes, and unable to work temporarily. Family is currently sheltering with relatives. She requires support for children's needs in the short-term, while she and children goes through the period of adjustment.",
    "specifications": "3 cans",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139964",
    "category": "Infant and Children Items",
    "name": "Lactogen Stage 2",
    "description": "Beneficiary has 4 children, eldest with special needs and 3 younger ones below the ages of 5. She is diagnosed with a mental illnes, and unable to work temporarily. Family is currently sheltering with relatives. She requires support for children's needs in the short-term, while she and children goes through the period of adjustment.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139898",
    "category": "Infant and Children Items",
    "name": "Dugro Stage 4 Milk powder refill",
    "description": "Community Services & Programmes @ Children's Society requires 4pkt of Dugro Stage 4 Milk powder refill for thier client's child. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139895",
    "category": "Infant and Children Items",
    "name": "Diapers : Size M Drypers Drypantz",
    "description": "Community Services & Programmes @ Children's Society requires 4pkt of Size M Drypers Drypantz for thier client's child.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139892",
    "category": "Infant and Children Items",
    "name": "Milk powder: Dugro Stage 4",
    "description": "Yishun Family Service @ Children's Society requires 6 tins of Milk powder: Dugro Stage 4 for their client with low income family. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139891",
    "category": "Infant and Children Items",
    "name": "Milk powder: Dugro Stage 3",
    "description": "Yishun Family Service @ Children's Society requires 6 tins of Milk powder: Dugro Stage 3 for their client with low income family. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139890",
    "category": "Infant and Children Items",
    "name": "Diapers XXL Size",
    "description": "Yishun Family Service @ Children's Society requires 6pkt of diapers in XXL size with no preference in brand for their client with low income family. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139889",
    "category": "Infant and Children Items",
    "name": "Diapers XL Size",
    "description": "Yishun Family Service @ Children's Society requires 6pkt of diapers in XL size with no preference in brand for their client with low income family. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "134380",
    "category": "Infant and Children Items",
    "name": "Milk Powder Stage 1",
    "description": "Family & Children Outreach @ Children's Society requires 2 Tins of Enfamil pro or Dulac stage 1 milk powder for their beneficiary's child. \nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139879",
    "category": "Infant and Children Items",
    "name": "Rollable Playmat",
    "description": "Family of 5, with 3 young children, living in a public rental flat. Parents experience health issues and unable to work. Seeking a foldable/rollable playmat for their 6mth old son",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "65536643",
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139862",
    "category": "Infant and Children Items",
    "name": "Feeding chair",
    "description": "Family is in need of a feeding chair for their toddler. They currently have a newborn to provide for as well. Income is not stable as father is working odd-jobs and mother is the main caregiver for the children. Family is currently dependent on financial assistance for support.",
    "specifications": "Feeding chair for toddler",
    "contact": {
      "org": "HEART @ Fei Yue",
      "name": "Elshaddai Jeevanathy D/O Ventakesan",
      "email": "elshaddai@fycs.org",
      "phone": [
        "91266100",
        "68199170"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139857",
    "category": "Infant and Children Items",
    "name": "4 x mamypoko pants size XXL",
    "description": "Client (F/34) is married and has 7 children aged (F/15, M/13, M/11, M/10, M/5, F/2, F/1). Client and family struggles to meet their basic daily needs as they having financial challenges. Client will require 4 packs of mamypoko pants size XXL for her 2- and 5-years old child.",
    "specifications": "NIL",
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Syamirul Azim",
      "email": "syamirulazim@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "21 Nov 2024"
  },
  {
    "id": "139775",
    "category": "Infant and Children Items",
    "name": "Baby Milk Powder (Brand: Lactogen stage 1 & 2)",
    "description": "A young couple with four small children, living in a rental flat, is seeking assistance for baby milk powders for their newborn. The husband is the sole breadwinner of the house. If you require further information, please feel free to discuss it with her social worker, Ms. Seelvi. If you are willing to assist, please contact Ms. Seelvi at 86993152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139774",
    "category": "Infant and Children Items",
    "name": "Baby Diapers - Any brands (Size S/M)",
    "description": "A young couple with four small children, living in a rental flat, is seeking assistance with baby diapers for their newborn. The husband is the sole breadwinner of the house. If you require further information, please feel free to discuss it with her social worker, Ms. Seelvi. If you are willing to assist, please contact Ms. Seelvi at 86993152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139765",
    "category": "Infant and Children Items",
    "name": "Milk and Diapers",
    "description": "[Urgent] - Client is living in a rental flat with 6 young children (age 5-11). Client is unemployed due to medical condition and the family is assessed to face significant financial strain. As such, the family is really in need of Milk and Diapers for the children (Lactogen 3 Drypants Size XXL). Thank you!",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Karen Ong",
      "email": "karenong@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139740",
    "category": "Infant and Children Items",
    "name": "Huggies Dry Comfort Pants XL",
    "description": "A mother to her 3-year-old daughter is seeking assistance with the provision of diaper pants for her child. Mother does not have any savings and recently started working as a security guard. She experiences financial challenges in fulfilling basic needs. Your kind provision of diaper pants is deeply appreciated as it will tremendously ease her financial load and help her attend to their basic needs. Thank you!",
    "specifications": null,
    "contact": {
      "org": "AWWA Transitional Shelter",
      "name": "Esther Tan",
      "email": "esther_tan@awwa.org.sg",
      "phone": [
        "65117278",
        "65117272"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139728",
    "category": "Infant and Children Items",
    "name": "Spectra / Haemin / Hanil brand Baby UV Sterilizer [requesting for these brands as beneficiary has extra UV and drying bulbs]",
    "description": "Client is currently caring for 3 young children (4 year old, 3 year old and 9 months) on her own after her husband left the household in September 2024 due to marital conflicts.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139722",
    "category": "Infant and Children Items",
    "name": "Diapers (Huggies Pull Up  Pants Size XL, 2-3 packets)",
    "description": "Family has a young daughter and a 3 year old son and elderly mother to take care of. The sole breadwinner of the family is having difficulties working as he has a pre-existing medical conditions and met with an accident 3 years ago. Their elder mother is diagnosed with multiple medical conditions and has to be on adult diapers. The family is having difficulties coping with the monthly expenses in the family. They require assistance with the adult diapers for their elder mother.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139721",
    "category": "Infant and Children Items",
    "name": "Diapers (ID Pants Super, XL Pull Up, 2-3 packets)",
    "description": "Family has a young daughter and a 3 year old son and elderly mother to take care of. The sole breadwinner of the family is having difficulties working as he has a pre-existing medical conditions and met with an accident 3 years ago. Their elder mother is diagnosed with multiple medical conditions and has to be on adult diapers. The family is having difficulties coping with the monthly expenses in the family. They require assistance with the adult diapers for their elder mother.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "138217",
    "category": "Infant and Children Items",
    "name": "XXL Diapers",
    "description": "Family of 4, with 2 young children, living in public rental flat. Father had not been able to work as he had been experiencing health issues. So, the family is seeking donation of XXL diapers for the children.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "65536643",
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "18 Nov 2024"
  },
  {
    "id": "138216",
    "category": "Infant and Children Items",
    "name": "XL diapers",
    "description": "Family of 4, with 2 young children, who are living in public rental flat. Father is unable to work as he is experiencing health issues. So, family is seeking donation of XL diapers for their children.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "65536643",
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "138215",
    "category": "Infant and Children Items",
    "name": "2x Nan 4 milk powder",
    "description": "The family of 4, with 2 young children, are living in a public rental flat. Father is unable to work as he is experiencing health issues. So, family is seeking donation of 2x Nan 4 milk powder for their children.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Claudine Ng",
      "email": "claudineng@allkin.org.sg",
      "phone": [
        "65536643",
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139719",
    "category": "Infant and Children Items",
    "name": "FairPrice Baby Dry Diaper Pants L-sized",
    "description": "Family of 6 with 3 school-going children and 1 elderly. The youngest child is 6 years old with special needs, thus requiring diapers. As Mum is the main caregiver, Dad is the sole breadwinner of the family.",
    "specifications": "L sized diapers",
    "contact": {
      "org": "Rainbow Centre - Magaret Drive School",
      "name": "Lee Mei Yi",
      "email": "meiyilee@rainbowcentre.org.sg",
      "phone": [
        "68179466",
        "64752072"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139675",
    "category": "Infant and Children Items",
    "name": "Sensory Toys",
    "description": "Family of 4 are financially unstable, and require support to ensure that their child with autism has access to toys that would help regulate his emotions.\n\nPlease contact me for more information on the specific item.",
    "specifications": null,
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Elijah Koh",
      "email": "elijahkoh@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139674",
    "category": "Infant and Children Items",
    "name": "Diapers",
    "description": "Family of 4 are financially unstable, and require support to ensure that their children have a regular supply of milk powder.",
    "specifications": "Drypantz L & 3XL",
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Elijah Koh",
      "email": "elijahkoh@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139673",
    "category": "Infant and Children Items",
    "name": "Milk Powder",
    "description": "Family of 4 are financially unstable, and require support to ensure that their children have a regular supply of milk powder.",
    "specifications": "Dumex Stage 2",
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Elijah Koh",
      "email": "elijahkoh@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139667",
    "category": "Infant and Children Items",
    "name": "Lactogen 2 Milk Powder [2 tins]",
    "description": "Client is living in a 1-room HDB rental flat with her husband, and her two children. Client’s husband was incarcerated and was released from prison in April 2023 and has been facing difficulty in finding higher paying employment. Client is a stay-at-home mother and is the main caregiver for the children. She has a medical condition which makes it challenging to sustain full-time employment.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139666",
    "category": "Infant and Children Items",
    "name": "Drypers diapers [Size: M, 2 packs]",
    "description": "Client is living in a 1-room HDB rental flat with her husband, and her two children. Client’s husband was incarcerated and was released from prison in April 2023 and has been facing difficulty in finding higher paying employment. Client is a stay-at-home mother and is the main caregiver for the children. She has a medical condition which makes it challenging to sustain full-time employment.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139665",
    "category": "Infant and Children Items",
    "name": "Mamypoko Air Fit Pants - Soft to skin [Size: XXL, 2 packs]",
    "description": "Client's family consists of 4 members, 2 children (1 school-going, 1 toddler). Client and wife are unable to seek and sustain employment due to caregiving needs. Presently they need to meet the high care needs of their 2 y.o. as he is born with a complex congenital heart disease. The family faces difficulty meeting their basic needs and requested for support with diapers.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139651",
    "category": "Infant and Children Items",
    "name": "Dumax Dulac Step 1 Milk Powder [Birth to 12 months, 4 tins (800g)]",
    "description": "Client is unemployed for past 1 year due to current pregnancy. She is depending on formal assistance to support hers and 3 other school-going children's needs. As client is due to give birth in March 2024, she hopes to receive temporary milk and diapers support before returning to the workforce after child's birth. Thank you.\n\nBrand: Dumax Dulac (Step 1 - Birth to 12 months)\nQuantity: 4 tins (800g)",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139642",
    "category": "Infant and Children Items",
    "name": "Diapers - [Any brand, Size L, 4 packets]",
    "description": "Client is unemployed for past 1 year due to current pregnancy. She is depending on formal assistance to support hers and 3 other school-going children's needs. As client is due to give birth in Mar 2024, she hopes to receive temporary milk and diapers support before returning to the workforce after child's birth. Thank you.\n\n\nQuantity: 4 packets\nBrand: Any\nSize: L",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139633",
    "category": "Infant and Children Items",
    "name": "Milk Powder & Diapers",
    "description": "Family of 4 with 1 child with special needs requiring milk powder and diapers support. Father is the sole breadwinner as mother has to be the full time caregiver for both children, especially child with special needs. The income is insufficient to meet the household needs as children requires special milk feeds on top of the regular milk powder that is costlier. Milk powder required: Lactogen 3. Diapers: any brand pull-up pants size L.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Rena Goh",
      "email": "rena@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139630",
    "category": "Infant and Children Items",
    "name": "Diapers (Huggies Silver Pants XXL, 4 packs)",
    "description": "Client is a single mother of 3 young children. She is a low income earner, working as a security guard. However, there are months that Client faces a loss of income due to caregiving needs of the children. Client is requesting for support in diapers and milk powder.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139629",
    "category": "Infant and Children Items",
    "name": "Milk Powder (Lactogen Stage 3, 2 tins)",
    "description": "Client is a single mother of 3 young children. She is a low-income earner, working as a security guard. However there are months that Client faces a loss of income due to caregiving needs of the children. Client is requesting for support in diapers and milk powder.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139628",
    "category": "Infant and Children Items",
    "name": "Diapers (Fair Price Baby Dry Tape [XL] High Absorbancy, 3 packs)",
    "description": "Client is a divorced single mother with 4 children. Currently two young children are under her care (F, 11y/o and F, 1y/o), while her two other children are under the care of her ex-husband. Client stays with her mother as well and is the main breadwinner of the family. However, due to the nature of Client's job, there are months where her income is little, resulting in tight living expenses, adding on to her stressors as a single mother. As such temporary support with diapers and milk powder would help to alleviate some of her financial stressors.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139626",
    "category": "Infant and Children Items",
    "name": "Diapers (XXL, PetPet brand/any other brand, 4 packs)",
    "description": "Low-income family is in need of diapers (XXL pants type, PetPet brand/any other brand) as well as milk power, for 8yo child who has congenital conditions due to premature birth.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139625",
    "category": "Infant and Children Items",
    "name": "Milk Powder (Cowhead, 3 big tins [1.8kg])",
    "description": "Low-income family is in need of diapers (XXL pants type, PetPet brand/any other brand) as well as milk power, for 8yo child who has congenital conditions due to premature birth.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139621",
    "category": "Infant and Children Items",
    "name": "Milk Powder (Enfagrow Stage 4, 2-3 tins)",
    "description": "The client and his wife are both earning low wages and have to support 3 young dependents and his elder parents with their basic and household needs. Meanwhile, client is paying high amount of debts that are incurred by his parents and his previous failed business. The support of milk powder will be important to ensure the needs of the toddler is not compromised.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "137462",
    "category": "Infant and Children Items",
    "name": "Lactogen Stage 3",
    "description": "A low-income family with four young children. The mother is unable to seek employment due to her caregiving responsibilities. A donation of milk powder would be greatly appreciated and would help ease the family’s financial burden.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Joyce Ng",
      "email": "joyceng@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139599",
    "category": "Infant and Children Items",
    "name": "Abbott Pediasure Milk",
    "description": "Toddler is very underweight at 10kg, single mother with low ID. The milk will be used to monitor if it was a nutritional issue and gauging tightly with the milk intake or supply issue.",
    "specifications": null,
    "contact": {
      "org": "Lakeside Family Centre - Jurong West",
      "name": "Felicia Wong",
      "email": "felicia-wong@lakeside.org.sg",
      "phone": [
        "65671908"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139584",
    "category": "Infant and Children Items",
    "name": "Similac Neosure for premature baby",
    "description": "Beneficiary struggling financially and daughter who was born prematurely requires special milk (neosure) which is difficult for them to afford.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139570",
    "category": "Infant and Children Items",
    "name": "Baby monitor",
    "description": "Mother of newborn requires a baby monitor (camera that can be linked up with phone) to have oversight of the baby when she does chores, prepares meals and showers as there may be no one else in the home most of the time who can help oversee the baby when she may be busy.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Jocelyn Joy Gwee",
      "email": "Jocelyn@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139558",
    "category": "Infant and Children Items",
    "name": "Dumlex Dugro Milk Powder Stage 3",
    "description": "Family is a low income household requiring support to meet basic needs as they had to replace household spoilt furniture recently  which they did not plan for. Hence, family has limited funds to purchase milk powder for their child.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Punggol 616",
      "name": "Esther Quek",
      "email": "estherquek@allkin.org.sg",
      "phone": [
        "64355323"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139529",
    "category": "Infant and Children Items",
    "name": "Diapers",
    "description": "Diapers\nSize XL (Pull up pants any brand) \nFor 2 children (F3 and F4) \n\nFamily of 4, parents are working grab delivery and has irregular income. Family is also paying off multiple debts and can benefit from milk and diaper support to reduce their expenses.",
    "specifications": "Size XL (Pull up pants any brand)",
    "contact": {
      "org": "Fei Yue Senior Activity Centre @ Bukit Batok",
      "name": "Franklin Richard",
      "email": "franklinrichard@fycs.org",
      "phone": [
        "69782978",
        "65633662"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139525",
    "category": "Infant and Children Items",
    "name": "IKEA TROFAST Frame and Storage Boxes",
    "description": "This is a low-income family of 4 with 1 child diagnosed with Autism Spectrum Disorder (ASD). Father is the main caregiver for the children at home. Child is currently attending EIPIC and has not been able to attain preschool placement. The team is looking to provide more home-based interventions to empower parents in engaging with child at home thus having cupboard with storage boxes will be helpful to create a more structured learning environment for child's engagement at home. Donations for these items will be greatly appreciated to support this family, do contact if you are interested and I can also provide the exact link and item for more information. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Early Intervention Programme for Infants and Children - Wellington Circle",
      "name": "Estherlyn Ng",
      "email": "estherlynng@fycs.org",
      "phone": [
        "64310400"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "139514",
    "category": "Infant and Children Items",
    "name": "Milk Powder and Diapers",
    "description": "Huggies diaper, size L (two pack), size XL (one pack)\nLactogen 2 (2 tins)\nAptamil Gold+ Stage 3\n\nFamily is a household of 4 consists of the client, her husband, and their two children, ages 2 and 1. Husband is currently serving NS and his NS pay is the family's only source of income which is insufficient in helping them meet their monthly basic needs, particularly with two young children involved. Client is currently not working due to caregiving responsibilities. Family is also seeking 3-6 months assistance period for diaper and milk powder support. This would help alleviate some of their financial stressors while they apply for MINDEF’s Financial Assistance.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "139452",
    "category": "Infant and Children Items",
    "name": "Baby Cereal",
    "description": "Client has recently resumed work after having stopped working for a year plus due to caregiving responsibilities. However, her husband is currently in remand for possession of contraband cigarettes and is not due to be released anytime soon. Further complicating his lawsuit, he has also recently been admitted to Changi General Hospital while being in remand because he had very low blood pressure and felt light headed after doing his morning prayers.(J)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139450",
    "category": "Infant and Children Items",
    "name": "Milk Powder (1 Year Old)",
    "description": "Client has recently resumed work after having stopped working for a year plus due to caregiving responsibilities. However, her husband is currently in remand for possession of contraband cigarettes and is not due to be released anytime soon. Further complicating his lawsuit, he has also recently been admitted to Changi General Hospital while being in remand because he had very low blood pressure and felt light headed after doing his morning prayers. (J)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139448",
    "category": "Infant and Children Items",
    "name": "Large Size Baby Diaper",
    "description": "Client has recently resumed work after having stopped working for a year plus due to caregiving responsibilities. However, her husband is currently in remand for possession of contraband cigarettes and is not due to be released anytime soon. Further complicating his lawsuit, he has also recently been admitted to Changi General Hospital while being in remand because he had very low blood pressure and felt light headed after doing his morning prayers. (J)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139441",
    "category": "Infant and Children Items",
    "name": "Milk Powder and Diapers",
    "description": "Client is a single mother. She recently got into an accident and is unable to work. She requires support for her 3 year old daughter's milk powder (Friso stage 4) and Diapers Nomieo or Merries or Huggies nature.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Isabelle Chua",
      "email": "isabellechua@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139433",
    "category": "Infant and Children Items",
    "name": "5 packs of Aptamil Gold+ Stage 4.",
    "description": "5 packs of Aptamil Gold+ Stage 4. Client resides in a HDB rental flat with her husband and two young children. Client's husband was the sole breadwinner of the family until his recent incarceration. Client has been the primary caregiver to the children due to their fluctuating health needs. In view of the family's dismal circumstances, client hopes to seek interim support from the community in sustaining her young children's basic needs whilst she works towards securing employment and progressively stabilising the household's finances in the absence of her husband.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "139387",
    "category": "Infant and Children Items",
    "name": "Milk and Diapers",
    "description": "Client and her husband are living in a rental flat with their 2 children. Due to their low income, they are experiencing financial difficulties and is in need of assistance to meet her children's basic needs. The FSC is currently seeking 1 can of Similac Milk Powder (stage 4) and 2 Merries XXL for her children.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Karen Ong",
      "email": "karenong@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139382",
    "category": "Infant and Children Items",
    "name": "Diapers",
    "description": "Hi, there is a single-mother who is facing financial struggles and requires diapers support for her 1 year-old daughter. She is employed but has to also support her elderly parents. She has not been receiving child maintenance from her ex-husband and is unable to rely on her other family members for financial support as they are also financially tight. Here are the diapers details: Brand: Huggies Nature\nSize: M\nType: Pants\nQuantity: 3-4. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Joyous Chai",
      "email": "joyouschai@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139381",
    "category": "Infant and Children Items",
    "name": "Milk Powder",
    "description": "Hi, there is a single-mother who is facing financial struggles and requires milk powder support for her 1 year-old daughter. She is employed but has to also support her elderly parents. She has not been receiving child maintenance from her ex-husband and is unable to rely on her other family members for financial support as they are also financially tight. Here are the milk powder details: Brand: Nan Opti Pro, Stage: 3, Quantity: 2 tins. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Joyous Chai",
      "email": "joyouschai@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139336",
    "category": "Infant and Children Items",
    "name": "Diapers (M & XXL)",
    "description": "Family of 5 children is currently staying in a rental flat. Father is the currently the sole breadwinner and Mother is the primary caregiver for the children. Family is looking for diapers for their 1 and 3 years old children.",
    "specifications": null,
    "contact": {
      "org": "REACH Family Service Centre",
      "name": "Priscilla Loo",
      "email": "priscilla.loo@reach.org.sg",
      "phone": [
        "64709776",
        "62522566"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "05 Nov 2024"
  },
  {
    "id": "139323",
    "category": "Infant and Children Items",
    "name": "Diapers",
    "description": "hii! family of 5 is staying together in a rental flat. Husband is the sole breadwinner and earn a meagre income. Wife is heavily pregnant and a caregiver to 3 young children hence she is unable to work at the moment. \n\nFamily is hoping to receive diapers for her children to alleviate their expenses. I will share with you on the diapers details. \n\nDonor to kindly cover transport arrangement and delivery cost please. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tasya Puspita Maulany",
      "email": "tasya@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "05 Nov 2024"
  },
  {
    "id": "139295",
    "category": "Infant and Children Items",
    "name": "Diapers Size XL (Pants)",
    "description": "Young mum with 1yo son looking for work and hopes to receive some donation of diapers. Her family is unable to support her as they are also financially strained.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Fitrah Nabilah",
      "email": "fitrahnabilah@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "04 Nov 2024"
  },
  {
    "id": "139287",
    "category": "Infant and Children Items",
    "name": "Abbott grow infant baby formula step 1 (x2) Goon pants L (x3)",
    "description": "Both client and her husband are unemployed. Husband met with an accident hence unable to provide.\nThey have 2 school going children and a 9 months old baby. Family is financially struggling. 9 months old baby is still reliant on milk powder and diapers hence, would require assistance during this challenging period for them.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Patricia Poo",
      "email": "patriciapoo@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "04 Nov 2024"
  },
  {
    "id": "139285",
    "category": "Infant and Children Items",
    "name": "Huggies Dry Comfort Pants Size XL (40 Pcs) x 2  Milk Powder: Isomil Soy Growing-Up milk Formula - Stage 3 x 5 Tins",
    "description": "The client has two children, F5 and M2. Their current household income is around $1,500, which has primarily been used for renovations as they prepare to move into their new 2-room BTO unit. The remaining income goes toward the children's needs, but it has been challenging for the family to meet most of their essential expenses. Support for diapers and milk powder would greatly help the family in adequately meeting their children's basic needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Patricia Poo",
      "email": "patriciapoo@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "04 Nov 2024"
  },
  {
    "id": "139281",
    "category": "Infant and Children Items",
    "name": "Milk and Diapers",
    "description": "Client currently has 2 young school-going children and a 1 year old child. Client's family is facing significant financial strain due to client's husband's unstable employment. Hence, FSC hopes to look for Milk and Diapers for the client, to get through this tough period.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Karen Ong",
      "email": "karenong@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "03 Nov 2024"
  },
  {
    "id": "139250",
    "category": "Infant and Children Items",
    "name": "Diaper (size XL, any brand and type)",
    "description": "Family of 5 consists of Client, her husband, and 3 young children. Client's husband is a sole breadwinner, earning limited income. Client was previously unable to work due to her injury and caregiving duties. She has just started applying for jobs. Due to financial constraints, the family hopes to receive donation of diapers (size XL) for her youngest child.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139249",
    "category": "Infant and Children Items",
    "name": "Diapers",
    "description": "Family of 5 with 3 young children under 7, 2 of whom have suspected special needs. Parents are working unstable jobs that provide insufficient income for the household needs. They are also looking after paternal grandparents. The family is requesting for diapers size L & XXL for the children.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Early Intervention Programme for Infants and Children - Jurong East",
      "name": "Tessa Nai",
      "email": "tessanai@fycs.org",
      "phone": [
        "66810508",
        "65656260"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139247",
    "category": "Infant and Children Items",
    "name": "Milk Powders (Lactogen 2)",
    "description": "A low-income family of four with two young children, (M/2) and (M/2).  Client is a 19 years old mother who just moved in to her 1-room rental flat. Husband is the sole breadwinner of the family but is facing employment instabilility and financial constraints. Hence, they hope to receive donation for milk powders (Lactogen 2) to help them tight through this difficult period till he secures a stable job.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139246",
    "category": "Infant and Children Items",
    "name": "Diapers (Huggies Pants Size M)",
    "description": "A low-income family of four with two young children, (M/2) and (M/2).  Client is a 19 years old mother who just moved in to her 1-room rental flat. Husband is the sole breadwinner of the family but is facing employment instabilility and financial constraints. Hence, they hope to receive donation for diapers (Huggies pants size M) to help them tight through this difficult period till he secures a stable job.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "140150",
    "category": "Electrical Home Appliances",
    "name": "Water Heater",
    "description": "Client has moved into his brand new public rental flat having been at a shelter together with his bedridden mother, of whom he is a full-time caregiver to her. Client is requesting for a water heater. Requesting for donor to assist with delivery costs too. Please WhatsApp Ignatius at 8718 8452 or email to Ignatius.Pereira@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "30 Nov 2024"
  },
  {
    "id": "140114",
    "category": "Electrical Home Appliances",
    "name": "Microwave - Halal",
    "description": "Client is a single mother of a 2 y/o son. They live in a 2-room rental flat and client supports them by working part-time even though she has been diagnosed with depression and anxiety. Client would appreciate a microwave to ease their daily life and facilitate their meal preparations.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Jurong",
      "name": "Shree Ganga D/O Rajasagran",
      "email": "ShreeGanga@thkmc.org.sg",
      "phone": [
        "88333080",
        "67169466"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140110",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine (frontload preferred)",
    "description": "Client is a single mother to 2 school going children and 1 youth. Family faces chronic financial constraints due to unstable employment situation and limited financial resources. They are staying in a 2-room rental flat. The household's washing machine has malfunctioned, and they are looking for a new washing machine to ease the cost.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Nur Ain Afini Binte Hamdan",
      "email": "nurainafini@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "133479",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Family of 5 with three young children need a working washing machine. Currently they have difficulties ensuring they have clean clothes to wear and children don’t have clean school uniforms to wear to school as well. Their washing machine is spoilt and does not clean the clothes well.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Lum Yi",
      "email": "lumyi@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140093",
    "category": "Electrical Home Appliances",
    "name": "Water heater",
    "description": "Elderly man in his 80s and his foreigner wife living in a rental flat do not have the means to afford a water heater and the installation. They have been showering by mixing kettle-boiled water and tap water. Having a water heater will bring about more ease to his wife as she takes care of him.",
    "specifications": null,
    "contact": {
      "org": "Singapore Cancer Society",
      "name": "Tan Wen Shi",
      "email": "wenshi_tan@singaporecancersociety.org.sg",
      "phone": [
        "1800-727-3333",
        "62219578"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140074",
    "category": "Electrical Home Appliances",
    "name": "1 extra air purifier filter",
    "description": "This is a lower income family. Client, a single mother, and her daughter has asthma and is allergic to dust. Client's daughter had recently undergone a nose surgery, and will require an air purifier with extra filter to reduce amount of dust at home to encourage better recovery. With client's knee issues, she has difficulty bending her knees to sit and stand. If the mattress is placed on the floor, client will not be able to get up once she sits down. Hence, she will require a new bedframe to prop up the mattress as her current bedframe has broken down due to wear and tear. Can whatsapp message 6038 4091 ~",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140073",
    "category": "Electrical Home Appliances",
    "name": "1 air purifier",
    "description": "This is a lower income family.\nClient, a single mother, and her daughter has asthma and is allergic to dust. Client's daughter had recently undergone a nose surgery, and will require an air purifier with extra filter to reduce amount of dust at home to encourage better recovery.\nWith client's knee issues, she has difficulty bending her knees to sit and stand. If the mattress is placed on the floor, client will not be able to get up once she sits down. Hence, she will require a new bedframe to prop up the mattress as her current bedframe has broken down due to wear and tear. Can whatsapp message 6038 4091 ~",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140045",
    "category": "Electrical Home Appliances",
    "name": "Smart TV",
    "description": "Client is a single mother with multiple chronic health issues. Therefore, she can only rely on SSO Comcare as her primary source of income. She currently hopes to receive a smart tv. Donor to cover transport arrangement and delivery cost please. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tasya Puspita Maulany",
      "email": "tasya@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "27 Nov 2024"
  },
  {
    "id": "140011",
    "category": "Electrical Home Appliances",
    "name": "Washing machine",
    "description": "Washing machine for single mum of 5 recently broke down and she is unable to afford a new one. Donor to deliver directly to mum's place.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Fitrah Nabilah",
      "email": "fitrahnabilah@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "139986",
    "category": "Electrical Home Appliances",
    "name": "Portable Air Conditioner/cooler",
    "description": "Single Mother with 2 school going children would like to request for portable air conditioner/cooler for their rental flat. Single mother is unable to work due to multiple health conditions. Would appreciate it help can be rendered to supply this family with the items so as to improve their life situation.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Jurong",
      "name": "Shree Ganga D/O Rajasagran",
      "email": "ShreeGanga@thkmc.org.sg",
      "phone": [
        "88333080",
        "67169466"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139984",
    "category": "Electrical Home Appliances",
    "name": "Instant water heater",
    "description": "A family of four requires an instant water heater to ensure access to hot water, especially in the mornings and during the rainy season. Currently, they do not own an instant water heater and rely on boiling water for their baths, which is time-consuming and inconvenient.\n\nThe client, certified as unfit to work, requires the assistance of a full-time caregiver. The couple has two school-going children, whose morning routines are affected by the lack of quick access to hot water.\n\nInstalling an instant water heater will significantly reduce the children’s preparation time for school and provide the client with relief from body tension, contributing to their overall comfort and well-being.",
    "specifications": null,
    "contact": {
      "org": "Whampoa Family Service Centre",
      "name": "Linda Lim",
      "email": "lindalim@kkcs.org.sg",
      "phone": [
        "63260300"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "138934",
    "category": "Electrical Home Appliances",
    "name": "Blender",
    "description": "VOX @ Children's Society requires a Blender with no preference of brands. They required these for their cooking programme for our youths. Delivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "138949",
    "category": "Electrical Home Appliances",
    "name": "TOYOMI Spot and Stain Deep Cleaner VC 7336WD",
    "description": "Sunbeam Place @ Children's Society requires a TOYOMI Spot and Stain Deep Cleaner VC 7336WD for the residential home. It will be used for their daily housekeeping purpose.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139968",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "Client has injured his spine and is currently resting / recovering at home. He does not have any savings or family support. He hopes to get a donated TV as his TV is spoilt.",
    "specifications": null,
    "contact": {
      "org": "Singapore After Care Association",
      "name": "Lin Mingjie",
      "email": "mingjie@saca.org.sg",
      "phone": [
        "62942350"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139966",
    "category": "Electrical Home Appliances",
    "name": "Instant Water Heater",
    "description": "Client is single mother with 1 child (F6), and is not receiving any support from child's father as he walked out of family and remained uncontactable. Family has no social support. Due to caregiving reasons, client works ad-hoc parcel delivery job and her finances are tight. She is hoping to receive instant water heater for their bathroom.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Punggol 616",
      "name": "Grace Song",
      "email": "gracesong@allkin.org.sg",
      "phone": [
        "64355323"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139963",
    "category": "Electrical Home Appliances",
    "name": "FRONT LOAD WASHING MACHINE",
    "description": "Client, 74 years old, have been living off through government public assistance. Washing machine just spoiled and he has no means in purchasing it through his own means",
    "specifications": "AVERAGE FRONT LOAD WASHING MACHINE",
    "contact": {
      "org": "Presbyterian Community Services",
      "name": "Alvin Eu",
      "email": "alvineu@pcs.org.sg",
      "phone": [
        "62712125",
        "63344445"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139962",
    "category": "Electrical Home Appliances",
    "name": "Blender",
    "description": "Family consists of 2 elderly, one working mother and 2 children. Youngest child is 4 years old, and requires pureed food. Blender is important for mom to prepare/cook food easily while working at the same time. Current blender has spoilt.\n\nPlease contact SW at 60384099 (WhatsApp) to arrange delivery if possible. \n\nThank you",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Abu Ubaidah Eliase",
      "email": "abuubaidah@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139915",
    "category": "Electrical Home Appliances",
    "name": "Flat screen TV (39 to 46 inches)",
    "description": "Elderly aunty 85 yrs old living in HDB rental flat has to replace her TV. Her current TV screen has stopped working. Note that size of TV has to be 46 inches or smaller due to space constraints. Many Thanks.",
    "specifications": "39 to 46 inches",
    "contact": {
      "org": "Moral Active Ageing Centre @ Kaki Bukit",
      "name": "Gary Tan",
      "email": "garytan@chkmps.org.sg",
      "phone": [
        "64486247"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139913",
    "category": "Electrical Home Appliances",
    "name": "Stand Fan",
    "description": "Client is staying with his siblings in a rental flat. Having a stand fan for them can help them ventilate their house better.",
    "specifications": null,
    "contact": {
      "org": "NTUC Health Cluster Support @ Bukit Merah",
      "name": "Joyce Ng",
      "email": "jiapei.n@ntuchealth.sg",
      "phone": [
        "96549067",
        "62741602"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139869",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Beneficiary suffered a stroke in 2022 which led to a full-body paralysis. He has been in a nursing home ever since. He has made significant recovery and is due to be discharged in Dec 2024. Since Client has not been able to work for 3 years, Client requires support to furnish his home to prepare for his return.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139867",
    "category": "Electrical Home Appliances",
    "name": "basic 6-8kg washing machine",
    "description": "Senior lives in a HDB rental unit. He has a physical disability. His current donated washing machine is spoilt and needs replacement. He only needs a basic machine with small 6-8kg capacity. Thank you!",
    "specifications": null,
    "contact": {
      "org": "NTUC Health Cluster Support @ Bukit Merah",
      "name": "Audrey Leo",
      "email": "audrey.leo@ntuchealth.sg",
      "phone": [
        "86128296",
        "62741602"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139844",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "A widow in her late 60s,ill with cancer and staying alone and has no children needs a TV.",
    "specifications": null,
    "contact": {
      "org": "Bartley Community Care Services",
      "name": "Chew Chee Kuan",
      "email": "cheekuan.chew@bccs.org.sg",
      "phone": [
        "83760394",
        "68850432"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "139840",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "Family consist of elderly mother who often resides at home due to her cataract issues. Family also have adult son who has intellectual disability. Main breadwinner of the household is facing difficulties with job due to logistical issues. \nThey are requesting for a functioning TV that will help to keep adult son and mom engaged at home.",
    "specifications": null,
    "contact": {
      "org": "REACH Family Service Centre",
      "name": "Ruth Lim",
      "email": "ruth.lim@reach.org.sg",
      "phone": [
        "68010746",
        "62522566"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "132501",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "Family of 5 with 3 school-going children staying in a 2-room rental flat requires a television as their current one is faulty. Both parents are working long hours with the wife having health complications.Would greatly appreciate if donor is able to cover transport expenses. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "138779",
    "category": "Electrical Home Appliances",
    "name": "Gas Stove (not Citygas but gas tank)",
    "description": "Family of 5 with 3 school-going children staying in a 2-room rental flat requires a gas stove as their current one has exposed wires which poses as a safety risk. Both parents are working long hours with the wife having health complications. Family cooks regularly at home. Would greatly appreciate if donor is able to cover transport expenses. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "20 Nov 2024"
  },
  {
    "id": "139828",
    "category": "Electrical Home Appliances",
    "name": "Water Heater for Bathroom (including installation)",
    "description": "A single frail elderly man staying alone in need of hot shower. His current water heater is faulty and will require a new water heater installed in his bathroom.\nRequest to include technician and installation.\nContact: 97251075",
    "specifications": "Fit for an old 3 room flat bathroom",
    "contact": {
      "org": "Montfort Care - GoodLife! @ Telok Blangah",
      "name": "Chen Jie Mei",
      "email": "jiemei.chen@montfortcare.org.sg",
      "phone": [
        "62746904",
        "62708327"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "139827",
    "category": "Electrical Home Appliances",
    "name": "TV (if possible SMART TV)",
    "description": "Client is a single mother of a 11-year-old. Her husband is incarcerated and she has trouble getting a job due to her severe eczema. This has resulted in her having to rely only on financial assistance for basic needs. It is hoped that client will be able to get a TV for the family especially since its the school holidays now.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Marine Parade Family Service Centre",
      "name": "Naazilah Hidayatullah",
      "email": "naazilah.hidayatullah@montfortcare.org.sg",
      "phone": [
        "64450100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "139809",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "A senior client is living in a 1-room rental flat with her husband due to multiple health issues, the couple faces financial strains as they are not able to commit to full-time work hours. Client cited that her washing machine had spoilt and has been having difficulties doing the laundry, citing that there is an excess of water contributing to high utility bills. She has requested for a washing machine to replace her faulty set.",
    "specifications": null,
    "contact": {
      "org": "Sembawang Family Service Centre",
      "name": "Po Woei Yee",
      "email": "powoeiyee@sfsc.org.sg",
      "phone": [
        "67547050"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139799",
    "category": "Electrical Home Appliances",
    "name": "Vacuum Cleaner",
    "description": "Client recently shifted to a two-room rental flat with her husband and two children, aged 8 months and 8 years old. Client is also in her final trimester of pregnancy and relies on a vacuum cleaner to clean the house. However, her existing vacuum cleaner stopped working and thus, client is hoping to receive a second hand vacuum cleaner. Please feel free to contact Claudine at 6365 8751 with regards to this request. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Admiralty",
      "name": "Lei Hui Yun",
      "email": "leihuiyun@carecorner.org.sg",
      "phone": [
        "63658751"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139790",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "A senior who aged 87 is living in HDB rental flat. She is widowed with no children. Her only washing machine spoiled. In view of her old age and poor mobility, it is challenging for her to do the laundry by hand. Therefore, the senior requires a washing machine (7 kg)",
    "specifications": null,
    "contact": {
      "org": "Lions Befrienders Service Association (Singapore)",
      "name": "Chow Ching Hua",
      "email": "chinghua.chow@lb.org.sg",
      "phone": [
        "66814941",
        "63758600"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139781",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "A low-income family with four young children living in a rental flat is seeking donations. The client's husband is the sole breadwinner, while the client serves as the primary caregiver for their children. They are currently unable to afford essential furniture and electrical appliances for their home. For further details, please contact their social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139771",
    "category": "Electrical Home Appliances",
    "name": "Smart Television",
    "description": "Client has recently moved into a transitional shelter with her young children. As there is minimal furniture in the shelter, she is hoping to furnish with some basic furniture and appliances. She is hoping to get a Smart TV that does not require wall mounting. If you have a suitable item, please do reach out to us at 9828 7307. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139762",
    "category": "Electrical Home Appliances",
    "name": "Water Heater",
    "description": "A single-parent family of two household members (mother and son) is requesting for a water heater. The family is staying in a 2-Room HDB rental flat, and the household is receiving ComCare financial assistance for their household expenses.\nThe family has limited saving to purchase a water heater, and they have been showering in cold water so far. However, client is feeling unwell due to her constant cold showers. \n \nThis family would appreciate a kind donor to donate a water heater. Thank you. Please contact, Family coach : Mythili at 62319489  (WhatsApp message or call) if you would like to make the donation. Thank you.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Tampines",
      "name": "Lyn Ng",
      "email": "lyn_ng@msf.gov.sg",
      "phone": [
        "67025744",
        "64244017"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139756",
    "category": "Electrical Home Appliances",
    "name": "Smart TV",
    "description": "Client is a 51 year old divorcee who just got allocated her rental flat. Due to her health conditions, Client has difficulties sustaining employment and is unable to purchase a Smart TV. Please WhatsApp Rina at 8666 1352 or email to rinaprasad@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139745",
    "category": "Electrical Home Appliances",
    "name": "Washing machine",
    "description": "Family of 4 who lives in rental flat, has 2 school-going children. Their washing machine has spoilt recently and they are struggling financially and hence will benefit from donation of washing machine.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Marine Parade Family Service Centre",
      "name": "Jana Lim",
      "email": "jana.lim@montfortcare.org.sg",
      "phone": [
        "64450100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139733",
    "category": "Electrical Home Appliances",
    "name": "Vacuum cleaner",
    "description": "Family with four children recently moved from one public rental flat to another. The family has limited finances at the moment due to their recent move and is unable to afford a new vacuum cleaner after their current one broke. A donation of a vacuum cleaner with delivery covered would greatly benefit the family. Please WhatsApp Wani at 8718 8443 or email to wani.irdina@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139720",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "Recovering from mental health issues is a lot about creating stability in life. 55 year old has been struggling all her life, but has finally found ways to focus and work towards recovery. \n\nOne of the ways we help with recovery is to provide a stable environment that someone can thrive in, in this case, a simple donation of a washing machine can make a huge difference in the long term recovery for this patient. \n\nLooking for someone to donate and deliver a washing machine to help her continue living in stability and working towards recovery.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Kreta Ayer",
      "name": "Dian Maisarah Sulaiman",
      "email": "dian.maisarah@montfortcare.org.sg",
      "phone": [
        "92310194",
        "62746904"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139671",
    "category": "Electrical Home Appliances",
    "name": "Upright Freezer",
    "description": "Mother with 2 young children requires an upright freezer (180L with 6 drawer compartments) to store food. Her current freezer is faulty and she is temporarily storing her food at the neighbor's place.",
    "specifications": "180L",
    "contact": {
      "org": "Kampong Kapor Community Services",
      "name": "Wong Li Yi",
      "email": "wongliyi@kkcs.org.sg",
      "phone": [
        "62997662ext544",
        "62997662"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139670",
    "category": "Electrical Home Appliances",
    "name": "Instant water heater",
    "description": "Client, an 87 year old low-income elderly, requires an instant water heater to be installed to help him with making the daily human need of upkeeping personal hygiene a comfortable process. At his age, it is an ongoing struggle for client to take his daily showers when the weather is colder.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Yishun",
      "name": "Samuel Chan",
      "email": "samuel.chan@montfortcare.org.sg",
      "phone": [
        "96423819",
        "64848040"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139663",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "44 Year-old female with schizophrenia requires a TV as her current one had spoilt. She is unable to sustain job due to her mental health condition.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - @27 Family Service Centre",
      "name": "Cheryl Chew",
      "email": "cheryl.chew@montfortcare.org.sg",
      "phone": [
        "97329677",
        "62708327"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139612",
    "category": "Electrical Home Appliances",
    "name": "Vacuum cleaner",
    "description": "Cancer-stricken senior with osteoporosis would require a vacuum cleaner so as to have an easier time cleaning her house. She is fiercely independent despite facing a lot of challenges in life, please help if you can",
    "specifications": null,
    "contact": {
      "org": "Allkin Singapore's Active Ageing Centre @ Ang Mo Kio 469",
      "name": "Kei Ng",
      "email": "ngkhuankungkei@allkin.org.sg",
      "phone": [
        "64510898"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139607",
    "category": "Electrical Home Appliances",
    "name": "60 inch TV",
    "description": "Client, who is 90 years old stay alone elderly woman residing in a rental flat, required a TV. Current TV is faulty. Will appreciate if donor could cover delivery fees and setup. Please WhatsApp Jeff at 96447310 to liaise.",
    "specifications": "60 inch",
    "contact": {
      "org": "Montfort Care - GoodLife! @ Telok Blangah",
      "name": "Siti Syaziah Binte Mohd Sufi",
      "email": "syaziah.sufi@montfortcare.org.sg",
      "phone": [
        "62746904",
        "62708327"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139600",
    "category": "Electrical Home Appliances",
    "name": "tv",
    "description": "Client's mother (F/47) is looking after his 1-year old daughter and 2-month old baby.  Client and spouse have been detained by CNB and is sentenced for a year. Client's mother is not able to work due to the caregiving duties.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139579",
    "category": "Electrical Home Appliances",
    "name": "55 Inch Television",
    "description": "The client is a widowed mother with two children. The family is need of a new TV as their current one is faulty. Thank you :)",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Camelia Saputri",
      "email": "camelia@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139564",
    "category": "Electrical Home Appliances",
    "name": "Television / TV",
    "description": "Client is an elderly man who is unable to work due to his health conditions. His television just broke and he is unable to afford to buy a replacement.",
    "specifications": null,
    "contact": {
      "org": "REACH Family Service Centre",
      "name": "Sarah Bethany Rozario",
      "email": "sarah.rozario@reach.org.sg",
      "phone": [
        "68010729",
        "62522566"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139557",
    "category": "Electrical Home Appliances",
    "name": "Vaccum cleaner",
    "description": "Client (F/36) has 4 young children that she is struggling to make ends meet. Client's vacuum cleaner is faulty and does not have enough money to purchase a new one. Client would require a vacuum cleaner to ensure her house is dust-free to protect her children.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Marine Parade Family Service Centre",
      "name": "Elvira Rajoo",
      "email": "elvira.rajoo@montfortcare.org.sg",
      "phone": [
        "64450100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139552",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "Family consists of a husband with low income who is the sole breadwinner. Wife is currently taking care of their 1 year old baby and is pregnant. They would appreciate a used but functional TV to furnish their home.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands",
      "name": "Fatimah Azzahrah",
      "email": "fatimah_azzahrah_noor@msf.gov.sg",
      "phone": [
        "62319407",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139541",
    "category": "Electrical Home Appliances",
    "name": "Blender",
    "description": "Client is an ex-offender living alone in a 1-room rental flat. He is unemployed and actively seeking employment. His current blender is spoilt and he is unable to afford a blender due to financial difficulties. Donation of a blender will be helpful to Client. Please WhatsApp Rina at 8666 1352 or email to rinaprasad@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139535",
    "category": "Electrical Home Appliances",
    "name": "Gas Stove (PUB)",
    "description": "Family of 4 with young children lives in a public rental flat with other family memebers, seeking assistance for a Gas stove support as the current one has spoilt. A donation of a new gas stove would greatly assist in helping them reducing their expenses by cooking in. Please WhatsApp Ignatius at 8718 8452 or email to Ignatius.Pereira@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139516",
    "category": "Electrical Home Appliances",
    "name": "Printer",
    "description": "Client is staying in a rental unit with her 15 year old son. She is currently facing financial concerns, due to her unemployment. Client is currently having financial constrains because of her unemployment. Client remains unemployed because of her various medical conditions. She shared that she would require a new microwave as the condition of her old one is very poor. Additionally, the printer is required as she would need it to print data from the BiPAP machine that she uses for her medical concerns. whatsapp only to workphone 60384091 (no calls)",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Cassandra Chia",
      "email": "cassandrachia@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "139513",
    "category": "Electrical Home Appliances",
    "name": "Halal Fridge",
    "description": "Family is a household of 4 consists of the client, her husband, and their two children, ages 2 and 1. Husband is currently serving NS and his NS pay is the family's only source of income which is insufficient in helping them meet their monthly basic needs, particularly with two young children involved. Client is currently not working due to caregiving responsibilities. Family currently has no cash on hand. Family’s fridge is currently spoiled, and they have no financial means to replace it. Seeking a donor to support in replacing their fridge. Dimensions of the fridge should be no more than 393L as their house would not be able to accommodate larger fridges.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "139467",
    "category": "Electrical Home Appliances",
    "name": "Fridge",
    "description": "Family of 3 in need of a fridge. Mum is unable to work and afford a new one due to health issues.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Grace Ang",
      "email": "grace@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139465",
    "category": "Electrical Home Appliances",
    "name": "Fridge (Halal)",
    "description": "A single mother of 6 children is struggling to make ends meet after her husband recently left. She's working hard to provide for her family, but they're facing many challenges. Their fridge has broken down, making it difficult to store food and prepare meals for the children. A fridge (halal) would greatly help this family manage their daily needs during this tough time.",
    "specifications": "600 x 1810 x 655 (W x H x D)",
    "contact": {
      "org": "MSF Social Service Office @ Serangoon",
      "name": "Desmond Lim",
      "email": "desmond_lim@msf.gov.sg",
      "phone": [
        "64880404",
        "18002220000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139429",
    "category": "Electrical Home Appliances",
    "name": "Halal Fridge",
    "description": "Halal user fridge. Client (45 y/o) lives together with her husband and their 3 children. Their family experiences financial difficulties due to client's health issues and her husband's low-income job. They currently rely on financial assistance to meet their basic needs. Their fridge has recently spoilt and they are unable to purchase a new fridge due to their financial difficulties. Thus, client is seeking a donation for a Halal user fridge.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "139414",
    "category": "Electrical Home Appliances",
    "name": "washing machine",
    "description": "Client is a 73 year old single woman who is staying in a HDB rental flat and is unemployed.",
    "specifications": null,
    "contact": {
      "org": "Serangoon Moral Family Service Centre",
      "name": "Muhammad Amin",
      "email": "muhdamin@smfsc.org.sg",
      "phone": [
        "62847123"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "139399",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "Client is a homebound elderly who is suffering from multiple medical conditions. She watches tv to pass her time. Unfortunately, it had since broken down and she is unable to afford repairs or replacement for a new tv.\n\nTo contact Ms Lok at 62912473.",
    "specifications": null,
    "contact": {
      "org": "SACS Anglican Cluster Operator - Peace Connect",
      "name": "Gennifer Lee",
      "email": "gennifer_lee@sacs.org.sg",
      "phone": [
        "62912473"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139392",
    "category": "Electrical Home Appliances",
    "name": "Wall fan",
    "description": "Family of 4 with 2 school-going children requires a wall fan as their current one is faulty. Husband is permanently unfit for work while wife is the full-time caregiver, and have been sustaining with financial assistance.Would greatly appreciate if donor is able to cover transport expenses.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139391",
    "category": "Electrical Home Appliances",
    "name": "Halal Fridge",
    "description": "Client (57/M) recently secured a public rental unit with his single friend. He works full-time as a cleaner to support both himself and his family overseas. However, due to financial constraints, he struggles to afford essential household items like a washing machine and a halal fridge. Acquiring these items would greatly enhance his quality of life, making it easier to manage daily tasks in his new home.",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Izzah Arina Ismail",
      "email": "izzaharina.ismail@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139383",
    "category": "Electrical Home Appliances",
    "name": "Small TV",
    "description": "Kidney dialysis patient who was homeless for the past 3-4 months recently moved into a rental flat and require furniture and appliances for his house. He is unable to sustain an employment due to his medical condition.",
    "specifications": "24 inch",
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tee Shi Ying",
      "email": "teeshiying@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139368",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "A low-income family with four young children living in a rental flat is seeking donations. The client's husband is the sole breadwinner, while the client serves as the primary caregiver for their children. They are currently unable to afford essential furniture and electrical appliances for their home. For further details, please contact their social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139361",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139355",
    "category": "Electrical Home Appliances",
    "name": "Instant shower heater with installation",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139354",
    "category": "Electrical Home Appliances",
    "name": "Gas Stove (double burner)",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139347",
    "category": "Electrical Home Appliances",
    "name": "Water Heater",
    "description": "Family of 4 (single mum with 3 children) requires a water heater. The current one of more than 5 years is faulty. Family has tight financial situation and unable to afford to buy a replacement. Mum is unable to work due to caregiving of the children.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Ye Jiancheng",
      "email": "jiancheng@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "05 Nov 2024"
  },
  {
    "id": "139340",
    "category": "Electrical Home Appliances",
    "name": "TV",
    "description": "Client is a single parent of a school-going child, and the sole breadwinner of her family. Family has just secured a flat of their own and is seeking a donation of a TV for the home.",
    "specifications": null,
    "contact": {
      "org": "AWWA Family Service Centre",
      "name": "Farahlina Tan",
      "email": "farahlina_tan@awwa.org.sg",
      "phone": [
        "65119458",
        "65119456"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "05 Nov 2024"
  },
  {
    "id": "139331",
    "category": "Electrical Home Appliances",
    "name": "Wall-mounted TV",
    "description": "Client, who has just been diagnosed with Parkinsons, is looking for a wall-mounted TV to help him pass his time. As he is recently diagnosed with Parkinsons', his mood has been low and hope that having a TV as his rental place may brighten up his mood.",
    "specifications": "Does not matter",
    "contact": {
      "org": "NTUC Health Cluster Support - Taman Jurong",
      "name": "Muhammad Azfar Bin Nazri",
      "email": "muhammadazfar.b@ntuchealth.sg",
      "phone": [
        "62674197"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "05 Nov 2024"
  },
  {
    "id": "139296",
    "category": "Electrical Home Appliances",
    "name": "Washing machine (top load)",
    "description": "57 year old low-income individual with poor social support is looking for a second-hand top load washing machine. This donation will help him in improving his quality of life as he works on securing employment to uplift himself.",
    "specifications": null,
    "contact": {
      "org": "Kampong Kapor Community Services",
      "name": "Andy Wee",
      "email": "andywee@kkcs.org.sg",
      "phone": [
        "62997662"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "04 Nov 2024"
  },
  {
    "id": "139271",
    "category": "Electrical Home Appliances",
    "name": "Washing Machine",
    "description": "55 year old, low income individual with poor social support, looking for a washing machine (second hand + help with delivery and installation).This practical support will help her towards recovery.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - GoodLife! @ Kreta Ayer",
      "name": "Dian Maisarah Sulaiman",
      "email": "dian.maisarah@montfortcare.org.sg",
      "phone": [
        "92310194",
        "62746904"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "02 Nov 2024"
  },
  {
    "id": "139254",
    "category": "Electrical Home Appliances",
    "name": "Television",
    "description": "Client has recently moved into Transitional Shelter with her young children and the shelter has minimal furniture. If you have a suitable item please do reach out to me at 9828 7307. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "136502",
    "category": "Electrical Home Appliances",
    "name": "8kg Washing Maching",
    "description": "Client is staying with co-tenants and their current washing machine is faulty and produces noises when used. It was repaired a few times but it has still been faulty. Client has difficulty purchasing a washing machine and hopes that kind donors can donate to her. She is requesting for a 8kg top opening washing machine that is 20 inches by 20 inches.",
    "specifications": "20 inch by 20 inch, 8kg",
    "contact": {
      "org": "NTUC Health Cluster Support @ Bukit Merah",
      "name": "Joyce Ng",
      "email": "jiapei.n@ntuchealth.sg",
      "phone": [
        "96549067",
        "62741602"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "138186",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Badminton Racket",
    "description": "In need of badminton to engage youth and children as the ones we currently have is no longer usable, we are in need of 5 sets of rackets and shuttle cocks",
    "specifications": "Badminton rackets",
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Nurhidayah Binte Sazali",
      "email": "hidayah@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "11 Nov 2024"
  },
  {
    "id": "136011",
    "category": "Leisure and Healthy Lifestyle",
    "name": "Halal Gummy Multivitamins",
    "description": "Sunbeam Place @ Children's Society requires 60 bottles of Halal Gummy Multivitamins for the residents daily intake.\nDelivery is required to be arranged by kind donor, please click to donate so that we can get in touch with you soon. We thank you for your kindness in advance!",
    "specifications": null,
    "contact": {
      "org": "Singapore Children's Society Corporate Office",
      "name": "Kartini",
      "email": "dik@childrensociety.org.sg",
      "phone": [
        "69787279",
        "62732010"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "140126",
    "category": "Home Furnishing",
    "name": "Multi-Tiered Storage Box [For storage purposes]",
    "description": "Client is a single mother of 3 young children. She is a low-income earner, working as a security guard. However there are months that client faces a loss of income due to caregiving needs of the children.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140122",
    "category": "Home Furnishing",
    "name": "Cabinet",
    "description": "Client has 1 school-going child. Family are currently not able to work as their ebike spoilt recently. They are not able to afford to purchase a cabinet to put the child's clothes. The donation will help the family to be more able to meet their basic needs",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Punggol 616",
      "name": "Nur Fatin Athirah Binte Mohamad Husaini",
      "email": "fatinathirah@allkin.org.sg",
      "phone": [
        "64355323"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140106",
    "category": "Home Furnishing",
    "name": "Small Cupboard with a locker",
    "description": "An elderly client with a chronic medical condition, who is co-sharing a rental flat with another tenant, is requesting a small cupboard with a lock. Due to space constraints, she prefers a compact cupboard with lockable drawers to securely store her personal belongings. If you require further information, please feel free to discuss it with her social worker, Ms. Seelvi. If you are willing to assist, please contact Ms. Seelvi at 86993152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140104",
    "category": "Home Furnishing",
    "name": "3 seater sofa",
    "description": "A single man, homeless since January 2024, was recently diagnosed with a mental health condition and has now moved into a new rental flat. He currently 3 seater sofa to furnish his new home. If you require further information, please feel free to discuss it with her social worker, Ms. Seelvi. If you are willing to assist, please contact Ms. Seelvi at 86993152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140039",
    "category": "Home Furnishing",
    "name": "Kitchen Cabinet",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive a kitchen cabinet. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "140031",
    "category": "Home Furnishing",
    "name": "Shoe rack",
    "description": "Family of five, with the mother being the sole breadwinner. Father is unable to work due to poor health conditions. The family is requesting a shoe rack to replace their current one that is already mouldy. Please WhatsApp Fang Ling at 8588 6196 or email to fangling.koh@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "140029",
    "category": "Home Furnishing",
    "name": "Dining Table",
    "description": "Single mother with 4 children is hoping to receive a dining table. Due to financial constraints, they are unable to afford. Please WhatsApp Fang Ling at 8588 6196 or email to fangling.koh@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "139970",
    "category": "Home Furnishing",
    "name": "Queen size mattress & pillow",
    "description": "Family of 5 is staying together in a rental flat. Husband is the sole breadwinner while wife is heavily pregnant and a caregiver to 3 young children hence is unable to work. \nClient is requesting for a wardrobe to keep her family members' clothes. Donor to kindly cover transport arrangement and delivery cost please. Thank you!",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Tasya Puspita Maulany",
      "email": "tasya@allkin.org.sg",
      "phone": [
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "25 Nov 2024"
  },
  {
    "id": "139916",
    "category": "Home Furnishing",
    "name": "Single size bed frame and mattress",
    "description": "Man with spinal injury requires help with a single size bed frame and thick mattress to provide him with better resting condition. Current bed is 14 years old. Man is unable to work due to multiple spinal issues / severe arthritis on both knees. Would appreciate any donors to provide a better living / resting environment to needy man.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Jurong",
      "name": "Shree Ganga D/O Rajasagran",
      "email": "ShreeGanga@thkmc.org.sg",
      "phone": [
        "88333080",
        "67169466"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139903",
    "category": "Home Furnishing",
    "name": "Housing Needs",
    "description": "Client is a 41 years-old mother with six children, aged 18, 17, 16, 14, 6 and 5 respectively. Together with her husband, the family stays in a 3-room flat in Yishun. \nShe requested for these utilities to be fixed to improve the family's quality of life and daily functioning.",
    "specifications": "Housing Needs",
    "contact": {
      "org": "MWS Family Service Centre - Yishun",
      "name": "Amy Chua",
      "email": "mwsfscy@mws.sg",
      "phone": [
        "83688612",
        "67564995"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139826",
    "category": "Home Furnishing",
    "name": "Cabinets (for kitchen use)",
    "description": "Client has mental health needs and is unemployed. Recently moved into her rental flat and is seeking support for appliances/furniture to meet her basic needs.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Juliana Binte Krishna Kassim",
      "email": "julianakrishna@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "139780",
    "category": "Home Furnishing",
    "name": "Small/Medium Kitchen Cabinet",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139779",
    "category": "Home Furnishing",
    "name": "Foldable Dining Table with foldable Chairs (x 3)",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139729",
    "category": "Home Furnishing",
    "name": "Double Bed - With sliding bed under [Single size]",
    "description": "Client is a single parent staying with 3 sons and a newborn grandson. She is currently unemployed due to health reasons. Her eldest son and 2nd son are also unemployed due to health reasons. Her 3rd son is  attending school. The family is having difficulties coping financially due to multiple medical conditions that the family is experiencing that prevents them from looking for new employment.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139727",
    "category": "Home Furnishing",
    "name": "Kitchen Cabinet",
    "description": "Client is a single parent who just moved into her rental flat with her 6 year old child not long ago. Client has not been able to find stable employment and the family is facing financial difficulties. They would require some furniture in the house. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139669",
    "category": "Home Furnishing",
    "name": "Cushioned dining chair with armrest",
    "description": "Client, an 87 year old low-income elderly at risk of falls, is in need of a sturdy new chair for him to carry out his daily activities at the dining table. Current chair is an old plastic chair that is unstable and unsafe for client to sit on for long periods of time unsupervised. Son is unable to sustain employment due to mental health challenges.",
    "specifications": "Approx 90H x 50W x 50D (cm)",
    "contact": {
      "org": "Montfort Care - GoodLife! @ Yishun",
      "name": "Samuel Chan",
      "email": "samuel.chan@montfortcare.org.sg",
      "phone": [
        "96423819",
        "64848040"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139668",
    "category": "Home Furnishing",
    "name": "3-seater sofa [Synthetic Leather, 2.1m to 2.2m]",
    "description": "Family of 5 is requesting for a replacement sofa as current set (also donated) has broken. Client is unable to afford a new set as he is unemployed due to high caregiving needs for his family members with mental health and special needs. Client hopes to receive a donated synthetic leather sofa in either black, brown or dark brown colour, with length of 2.1m to 2.2m. Thank you.",
    "specifications": "L: 2.1m to 2.2m",
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139641",
    "category": "Home Furnishing",
    "name": "Kitchen Cabinet",
    "description": "Low income family with multiple dependents is requesting for a kitchen cabinet to help them with proper organisation and storage of their food rations that they recieve. Should you have a suitable item, you can contact us at 9828 7307. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139603",
    "category": "Home Furnishing",
    "name": "small two door wardobe",
    "description": "Client is a 34-year old single mother and sole breadwinner for her three children (8M, 6F, 4F). She is working as an admin. Her husband had gotten incarcerated early this year. Client is struggling financially to provide for her family on her own. (A)",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Bedok North",
      "name": "Low Kim Yong",
      "email": "lowkimyong@thkmc.org.sg",
      "phone": [
        "81883314",
        "64491440"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139592",
    "category": "Home Furnishing",
    "name": "Kitchen rack/stand",
    "description": "Family (elderly grandmother supporting two relatives and grandson with intellectual disability) is sourcing for a metal kitchen rack to organise their items and maximise space, as they have just moved into a new rental flat.\n\nSomething like the below would be helpful\nhttps://shopee.sg/YOULITE-Stainless-Steel-Kitchen-Rack-With-Wheels-Shelf-Kitchen-Organizer-Multi-function-Shelves-Microwave-Oven-Rack-Oven-Rack-Flower-Rack-Multi-layer-Crevice-Shelf-i.483776973.16183781677?sp_atk=dacd96cd-790a-45f4-a3a9-c452ccfde040&xptdk=dacd96cd-790a-45f4-a3a9-c452ccfde040",
    "specifications": "40cm x 40cm x 80cm",
    "contact": {
      "org": "MINDS - Community Forensic Services",
      "name": "Ella Tan",
      "email": "ella.tan@minds.org.sg",
      "phone": [
        "93573778"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139591",
    "category": "Home Furnishing",
    "name": "Cabinet",
    "description": "Family (elderly grandmother and grandson with intellectual disability) has just moved into a rental flat, and requires cabinets to organise their items and maximise the space. \n\nSomething like the below would be helpful (about 1m in width).\n\nhttps://shopee.sg/Half-Height-Cabinet-(YA-201)-i.53927834.18966841287?sp_atk=c25443d8-afb5-4c0c-9aba-c02bdd41f561&xptdk=c25443d8-afb5-4c0c-9aba-c02bdd41f561",
    "specifications": null,
    "contact": {
      "org": "MINDS - Community Forensic Services",
      "name": "Ella Tan",
      "email": "ella.tan@minds.org.sg",
      "phone": [
        "93573778"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139574",
    "category": "Home Furnishing",
    "name": "Waredrobe",
    "description": "Family has 3 young children below 6 years old. They have recently got their own rental flat and require a second hand wardrobe.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Punggol 616",
      "name": "Amos Liu",
      "email": "amosliu@allkin.org.sg",
      "phone": [
        "64355323"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "13 Nov 2024"
  },
  {
    "id": "139537",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client has recently obtained his own rental flat after years. As Client is in recovery of his physical health condition and certified unfit for employment, he has limited finances and would like to seek donation of wardrobe to organise his clothes. Thank you",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "12 Nov 2024"
  },
  {
    "id": "139510",
    "category": "Home Furnishing",
    "name": "Wardrobe for 2",
    "description": "Client is a 20-year-old mother of one. She is married, but husband is pending his sentence for suspected involvement in criminal activities. Given her husband's role as the sole provider for the family while she provides care for their 1-year-old child, client's family is currently struggling financially. She is thus unable to afford an induction cooker and wardrobe for their rental flat.",
    "specifications": "Wardrobe for 2",
    "contact": {
      "org": "MWS Family Service Centre - Yishun",
      "name": "Amy Chua",
      "email": "mwsfscy@mws.sg",
      "phone": [
        "83688612",
        "67564995"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "137400",
    "category": "Home Furnishing",
    "name": "2 door wardrobe (less than 200cm tall)",
    "description": "Elderly uncle 72 yrs old living in 1-room HDB rental flat needs a 2-door wardrobe. Shelves and a door of his current wardrobe has cracked and is out of shape. Many Thanks.",
    "specifications": "less than 200cm tall",
    "contact": {
      "org": "Moral Active Ageing Centre @ Kaki Bukit",
      "name": "Gary Tan",
      "email": "garytan@chkmps.org.sg",
      "phone": [
        "64486247"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "11 Nov 2024"
  },
  {
    "id": "139432",
    "category": "Home Furnishing",
    "name": "Two-door wardrobe",
    "description": "Client is a divorcee residing with her two children in a 2-room rental flat. Client has been diagnosed with anxiety disorder and certified temporarily unfit for work till May 2025. Client receives support from IMH for her continued mental health needs. Client's son has been experiencing challenges in securing stable employment, leaving the family dependent on community agencies to sustain their day-to-day needs for a period. Client's daughter is of school-going age. The family hopes to receive support for a pre-loved two-door wardrobe as their current one is faulty and the family does not have the finances to afford replacing the household furniture.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "139422",
    "category": "Home Furnishing",
    "name": "2-door Wardrobe",
    "description": "Client is a mother of 4 children living in a 2-rm rental flat. She is unemployed due to being the main caregiver of her son who has mental health issue. She is requesting for a wardrobe as hers is broken.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Jurong",
      "name": "Shree Ganga D/O Rajasagran",
      "email": "ShreeGanga@thkmc.org.sg",
      "phone": [
        "88333080",
        "67169466"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "139393",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Elderly staying with her grandson in a 2-room rental flat requires a wardrobe as her current one is faulty and attracting termites. Would greatly appreciate if donor is able to cover transport expenses.",
    "specifications": "46 inch length x 75 inch height",
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139390",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Family of 4 with 2 school-going children staying in a 2-room rental flat requires a wardrobe as their current one is giving way. Dimensions should be around the one given here. Would be very grateful if donor is able to cover the transport expenses.",
    "specifications": "244 length x 57 width x 240 height",
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Mohamad Harith",
      "email": "harith_husaini@msf.gov.sg",
      "phone": [
        "63254547",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139366",
    "category": "Home Furnishing",
    "name": "Room Divider",
    "description": "Family comprises an elderly grandfather and his adult granddaughter who has took on the role of a primary caregiver to him. They live in a small 1-room rental flat and has little personal space for privacy. They can greatly benefit from having a room divider so that they can have their personal space when they are sleeping at night.",
    "specifications": "200CM x 200CM",
    "contact": {
      "org": "Kampong Kapor Community Services",
      "name": "Iffah Hadhirah Binte Mohamad Noor",
      "email": "iffahnoor@kkcs.org.sg",
      "phone": [
        "62997662"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139365",
    "category": "Home Furnishing",
    "name": "Small/Medium Kitchen Cabinet",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139358",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139343",
    "category": "Home Furnishing",
    "name": "Window Grills",
    "description": "Client is a 27-year-old mother with 4 young children between 8 years old and 6 months old. She and her husband are working full-time to financially support the household. However, they have incurred debts from the HDB monthly instalments and renovation loans and they are trying to clear the HDB monthly instalments. As they have multiple young children who are quite active in their current stage of development, the family is urgently in need of installing window grills for their 2 bedrooms. The window grills can help to ensure the children's safety at home.",
    "specifications": "Window Grills",
    "contact": {
      "org": "MWS Family Service Centre - Yishun",
      "name": "Amy Chua",
      "email": "mwsfscy@mws.sg",
      "phone": [
        "83688612",
        "67564995"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "05 Nov 2024"
  },
  {
    "id": "139317",
    "category": "Home Furnishing",
    "name": "Wardrobe",
    "description": "Client is an elderly caregiver for 5 grandchildren and require support for a new wardrobe as Family will be moving to a rental flat.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Ang Mo Kio 230",
      "name": "Muhammad Danial Bin Mazlan",
      "email": "danialmazlan@allkin.org.sg",
      "phone": [
        "65536643",
        "64535349"
      ]
    },
    "deliveryCostsCoveredByDonor": false,
    "date": "05 Nov 2024"
  },
  {
    "id": "140030",
    "category": "Learning Aids",
    "name": "Laptop",
    "description": "Single father with two school-going children (F/14 and F/12). Father is the sole breadwinner, with limited income. The family hopes to receive two laptops as the children need it for their school work. Please WhatsApp Fang Ling at 8588 6196 or email to fangling.koh@thkmc.org.sg to liaise.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "139863",
    "category": "Learning Aids",
    "name": "Laptop / Desktop x2",
    "description": "Client is a single mother with 2 children in primary school. Current tablet is faulty. Her children need a laptop / desktop each to complete their online schoolwork. Due to tight finances, client finds it challenging to afford a laptop / desktop in time for school reopening in Jan 2025.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Service Centre @ Choa Chu Kang",
      "name": "Grace Lam",
      "email": "gracelam@fycs.org",
      "phone": [
        "69782972",
        "67625215"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139778",
    "category": "Learning Aids",
    "name": "Laptop with MS Office installed preferred",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139767",
    "category": "Learning Aids",
    "name": "Laptop",
    "description": "Single-pax job seeking adult requires a work laptop for as he is undergoing upskilling. He is unable to engage in any employment due to an injury on his collarbone too.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Kreta Ayer",
      "name": "Tan Zhen Wei",
      "email": "tan_zhenwei@msf.gov.sg",
      "phone": [
        "63254566",
        "1800-222-0000"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139763",
    "category": "Learning Aids",
    "name": "Laptop",
    "description": "Client is a single mother with 4 children living in a rental flat. She struggles with financial difficulties due to the high caregiving needs for her son (22 y/o) who has a chronic illness. Her laptop had recently spoiled, and she does not have the financial resources to buy another laptop. Thus, client is seeking a donation of a laptop.",
    "specifications": null,
    "contact": {
      "org": "MWS Covenant Family Service Centre – Hougang and Buangkok",
      "name": "Sabrina Than",
      "email": "sabrinathan@mws.sg",
      "phone": [
        "62828558"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139372",
    "category": "Learning Aids",
    "name": "Laptop with MS Office installed preferred",
    "description": "The client is a single father with two young children, seeking donations for their new rental flat. Recently divorced, he holds an LTVP (Long-Term Visit Pass) and has care and control of his two young children, for whom he is the sole breadwinner. After staying in a shelter, he has just secured a rental flat and is hoping to receive donations of furniture and electrical appliances to help furnish their new home. For further details, please feel free to reach out to his social worker, Ms. Seelvi, at 8699 3152. Thank you.",
    "specifications": null,
    "contact": {
      "org": "THK Family Service Centre @ Tanjong Pagar",
      "name": "Lynette Tan",
      "email": "lynettetan@thkmc.org.sg",
      "phone": [
        "64961272",
        "62706711"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "139348",
    "category": "Learning Aids",
    "name": "Assessment Books/Past year paper",
    "description": "Family of 5 children is currently staying in a rental flat. Father is currently the sole breadwinner and Mother is the primary caregiver for the children. Family looking for assessment books or past year test paper for their P5 child.",
    "specifications": null,
    "contact": {
      "org": "REACH Family Service Centre",
      "name": "Priscilla Loo",
      "email": "priscilla.loo@reach.org.sg",
      "phone": [
        "64709776",
        "62522566"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "05 Nov 2024"
  },
  {
    "id": "139255",
    "category": "Learning Aids",
    "name": "Laptop / PC",
    "description": "Client's PC has been spoilt for quite some time and the social worker assessed that the PC has been a form of coping from his various stressors, hence is hoping to recieve a donation to replace the computer. If you have a suitable item, please do reach out to me at 9828 7307. Thank you!",
    "specifications": null,
    "contact": {
      "org": "MWS Family Service Centre - Tampines",
      "name": "Han Wen Ting",
      "email": "hanwenting@mws.sg",
      "phone": [
        "67872001"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139244",
    "category": "Learning Aids",
    "name": "Computer/Desktop",
    "description": "PPIS Family Service Centre (West) is appealing for lucky draw prizes for our Back to School event on 7 December 2024, held for low-income families to encourage family bonding and to celebrate the success of their children in completing the school academic year to move on  to the next year. \n\nThis year, our theme is “Family First: Celebrating the Moments of Togetherness”. We hope that the families can use this platform to harness and celebrate the strengths in their children/wards as they forge a closer bond with each other. Therefore, the prizes that we are looking for need to be suitable for families with children from preschool, primary, secondary to tertiary levels. \n\nIf you are keen to donate, do let us know before 29 Nov 2024.\n\nOur contact details are as follows:  \nOffice no: 6561 3462  \nOffice mobile no:  81891185 / 91852971 \nContact person: Ms Regine / Ms Fadhilah \n\nThank you!  \n\n**Important note: We seek your understanding to not spread or share this message without prior consent. Your cooperation is greatly appreciated!",
    "specifications": "1 / New",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Regine Yeo",
      "email": "regine.yeo@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "139243",
    "category": "Learning Aids",
    "name": "Books",
    "description": "PPIS Family Service Centre (West) is appealing for lucky draw prizes for our Back to School event on 7 December 2024, held for low-income families to encourage family bonding and to celebrate the success of their children in completing the school academic year to move on  to the next year. \n\nThis year, our theme is “Family First: Celebrating the Moments of Togetherness”. We hope that the families can use this platform to harness and celebrate the strengths in their children/wards as they forge a closer bond with each other. Therefore, the prizes that we are looking for need to be suitable for families with children from preschool, primary, secondary to tertiary levels. \n\nIf you are keen to donate, do let us know before 29 Nov 2024.\n\nOur contact details are as follows:  \nOffice no: 6561 3462  \nOffice mobile no:  81891185 / 91852971 \nContact person: Ms Regine / Ms Fadhilah \n\nThank you!  \n\n**Important note: We seek your understanding to not spread or share this message without prior consent. Your cooperation is greatly appreciated!",
    "specifications": null,
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Regine Yeo",
      "email": "regine.yeo@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "01 Nov 2024"
  },
  {
    "id": "140135",
    "category": "Mobility Aids",
    "name": "Wheelchair",
    "description": "Client comes from a low-income family. He is an above-knee bilateral amputee and would require a 4-wheeler motorised Personal Mobility Aid (PMA) to travel around for his medical appointments and to seek employment.",
    "specifications": null,
    "contact": {
      "org": "Singapore After Care Association",
      "name": "Lin Mingjie",
      "email": "mingjie@saca.org.sg",
      "phone": [
        "62942350"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140092",
    "category": "Mobility Aids",
    "name": "Wheelchair",
    "description": "60-year-old man stricken with multiple health conditions is required to travel to polyclinic daily. He needs assistance to walk. Wife will be able to send him with more ease and safety with a wheelchair.",
    "specifications": null,
    "contact": {
      "org": "Singapore Cancer Society",
      "name": "Tan Wen Shi",
      "email": "wenshi_tan@singaporecancersociety.org.sg",
      "phone": [
        "1800-727-3333",
        "62219578"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140079",
    "category": "Mobility Aids",
    "name": "Wheelchair",
    "description": "Elderly man who is physically weak and has high fall risk. He does not own a wheelchair and relies on his wife to move about. However, his wife is also an elderly herself and may not be able to support him. The wheelchair would be helpful for him to move about at home and in community safely. Interested donors kindly contact Anna at 63658751. Thank you.",
    "specifications": null,
    "contact": {
      "org": "Care Corner Family Service Centre - Admiralty",
      "name": "Lei Hui Yun",
      "email": "leihuiyun@carecorner.org.sg",
      "phone": [
        "63658751"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140078",
    "category": "Mobility Aids",
    "name": "wheelchair",
    "description": "client has dementia and walking unsteadily. He needs a wheelchair.",
    "specifications": null,
    "contact": {
      "org": "Thye Hua Kwan Moral Charities",
      "name": "Penelope Lim",
      "email": "penelope.lim@thkmc.org.sg",
      "phone": [
        "68461228",
        "63371201"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "140072",
    "category": "Mobility Aids",
    "name": "Foldable and light wheelchair",
    "description": "Client and her spouse are an elderly couple (aged 74 and 80). Client's spouse has several health conditions - parkinsons and borderline dementia, with severe speech difficulties. Client is facing housing instability and financial issues due to lack of finances to cope with monthly rental and is in debt. Due to progression of Parkinsons and Dementia, client's husband now requires a portable wheelchair to get around at home or to his medical appointments. Due to unsteady gait, client has recently fallen in November 2024. Client hopes to get a wheelchair to reduce occurence of falls by her husband.",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Sengkang 223D",
      "name": "Nurul Nadiah Binte Mustapha",
      "email": "nurulnadiah@allkin.org.sg",
      "phone": [
        "63128100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "28 Nov 2024"
  },
  {
    "id": "139877",
    "category": "Mobility Aids",
    "name": "Wheelchair with adjustable/flip-up handrests",
    "description": "Client is married to spouse and they have three young children in lower primary and kindergarten, currently living in a public rental flat. Spouse is permanently paralysed on Right side of body after his last stroke in 2021, and requires a wheelchair to go for his medical appointments. His last wheelchair is no longer working. Spouse requires a good condition wheelchair with adjustable handrests, as Client needs to be able to shift the handrests so that she can move Spouse from the bed into the wheelchair.",
    "specifications": "approx 75cm x 67cm x 86.5cm when unfolded",
    "contact": {
      "org": "Montfort Care - Marine Parade Family Service Centre",
      "name": "Bernice Yong",
      "email": "bernice.yong@montfortcare.org.sg",
      "phone": [
        "64450100"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "21 Nov 2024"
  },
  {
    "id": "139737",
    "category": "Mobility Aids",
    "name": "Adult Bicycle (with a seat behind)",
    "description": "Client is a 40-year-old mother of two children, aged five and two. Her husband works as a cleaner and is the sole provider for the family while She cares for their children. The family is struggling financially and is unable to purchase a tricycle and a queen-sized mattress for the family to sleep on. She requires an adult-sized tricycle to send both her children to different preschools.",
    "specifications": "Adult Bicycle (with a seat behind)",
    "contact": {
      "org": "MWS Family Service Centre - Yishun",
      "name": "Amy Chua",
      "email": "mwsfscy@mws.sg",
      "phone": [
        "83688612",
        "67564995"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139615",
    "category": "Mobility Aids",
    "name": "Motorised wheelchair",
    "description": "Client F/76 is an elderly with mobility issues and requires a motorized scooter with simple controls to move around independently, as she is alone at home during the day. Due to her frailty and weakness, she is unable to operate a motorized wheelchair on her own.",
    "specifications": "1",
    "contact": {
      "org": "PPIS Family Service Centre (West)",
      "name": "Regine Yeo",
      "email": "regine.yeo@ppis.sg",
      "phone": [
        "65613462"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "14 Nov 2024"
  },
  {
    "id": "139596",
    "category": "Mobility Aids",
    "name": "Commode",
    "description": "Patient in remission from cancer needs a commode to assist him to shower. Family does not have a regular income. They are not able to afford a new commode.",
    "specifications": null,
    "contact": {
      "org": "Care Corner - Community Case Management Service Central",
      "name": "Josherine Toh",
      "email": "josherinetoh@carecorner.org.sg",
      "phone": [
        "62586601"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139451",
    "category": "Mobility Aids",
    "name": "Mobile Commode",
    "description": "Patient aged 50, is married with a 8 year old daughter. Patient's wife is on Long Term Visit Pass. The 3 of them lives together in a 1 room HDB rental flat.\n\nPatient has suffered a stroke, which has affected his right side of the body. Patient requires this mobile commode so as to be able to get push into the toilet for his toileting matters.",
    "specifications": "DNR Aluminium Foldable Mobile Commode",
    "contact": {
      "org": "Alexandra Hospital - Care &amp; Counselling",
      "name": "Tan Zhi Tong",
      "email": "zhi_tong_tan@nuhs.edu.sg",
      "phone": [
        "63793260"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139418",
    "category": "Mobility Aids",
    "name": "Commode Chair",
    "description": "The senior has amputations on his feet and has fall risks during shower and toileting. \n\nThe senior is unemployed due to his declining health and is the pillar of financial support for his family. \n\nHe would like to place the commode chair on top of his toilet bowl and sit on it while he showers. the dimensions of his toilet bowl are mentioned in the dimensions.  \n\nPlease contact me by 8126 2493",
    "specifications": "width 32cm x height 45cm x depth 47cm",
    "contact": {
      "org": "Fei Yue Community Services",
      "name": "Julia Soh Ying Li",
      "email": "juliasoh@fycs.org",
      "phone": [
        "63809155",
        "63809169"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "139401",
    "category": "Mobility Aids",
    "name": "battery",
    "description": "Client is a motorised scooter battery flat. He needs someone to sponsor him for buying batteries.",
    "specifications": null,
    "contact": {
      "org": "Thye Hua Kwan Moral Charities",
      "name": "Penelope Lim",
      "email": "penelope.lim@thkmc.org.sg",
      "phone": [
        "68461228",
        "63371201"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "06 Nov 2024"
  },
  {
    "id": "140117",
    "category": "Medical Aids",
    "name": "TENA Pads Discreet Normal",
    "description": "Client is a cancer patient who has undergone treatment since 2021. Her illness has rendered her unable to work for several years, leaving her dependent on her sister's family, who are struggling with their own physical and mental health challenges. Client also bears the financial responsibility for her elderly mother's care in a formal facility.",
    "specifications": "TENA Pads (275mm) 12 pcs/pack",
    "contact": {
      "org": "AIN Society",
      "name": "Nur'Ain Binte Mohamed Said",
      "email": "nurain@ainsociety.org.sg",
      "phone": [
        "68485116",
        "68485166"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "29 Nov 2024"
  },
  {
    "id": "140023",
    "category": "Medical Aids",
    "name": "Adult diapers",
    "description": "Client is an elderly man with various medical health conditions preventing him from being able to manage activities such as going to the toilet without support from his son. \n\nAs such, he is reliant on adult diapers and we would like to request for any amount of diapers possible to assist as the family is facing financial difficulties. Client is not particular with brand.",
    "specifications": "XL pants",
    "contact": {
      "org": "Care Corner Family Service Centre - Queenstown",
      "name": "Muhammad Redha Bin Ahmad Razif",
      "email": "redhamuhammad@carecorner.org.sg",
      "phone": [
        "64761481"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "140016",
    "category": "Medical Aids",
    "name": "Adult Diaper (M size, pant) )",
    "description": "Family of 6 is living in a 3 room flat. Client is caring for 2 elderly parents with health issues. Client has difficulty to cope with daily expenses with low wages. Client's parent needs diaper for daily use.",
    "specifications": null,
    "contact": {
      "org": "Montfort Care - Kreta Ayer Family Services",
      "name": "Rachel Fu",
      "email": "rachel.fu@montfortcare.org.sg",
      "phone": [
        "63254753"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "26 Nov 2024"
  },
  {
    "id": "139886",
    "category": "Medical Aids",
    "name": "Adult diaper size M",
    "description": "Hospice patient requires adult diaper as his mobility decreases. It will help his caregiver to care well for him.",
    "specifications": null,
    "contact": {
      "org": "Singapore Cancer Society",
      "name": "Tan Wen Shi",
      "email": "wenshi_tan@singaporecancersociety.org.sg",
      "phone": [
        "1800-727-3333",
        "62219578"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "22 Nov 2024"
  },
  {
    "id": "139793",
    "category": "Medical Aids",
    "name": "10L Oxygen Concentrator",
    "description": "Patient requires 10 litres oxygen concentrator due to her condition. She is mostly bedbound and requires assistance in activities of daily living. She has difficulty breathing on her own. \nShe stays together with daughter, who is of low income. \nThus, patient will benefit from 10 litres oxygen concentrator.",
    "specifications": "Length 39.4cm Width 39.6cm Height 70.6cm",
    "contact": {
      "org": "St Luke's Hospital Ltd",
      "name": "Lee Xin Yi",
      "email": "xinyilee@stluke.org.sg",
      "phone": [
        "66977519",
        "65632281"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "19 Nov 2024"
  },
  {
    "id": "139748",
    "category": "Medical Aids",
    "name": "L sized diapers",
    "description": "A senior 90years requires Large sized diapers for his daily living. He is looked after by caregiver daughter aged 55+ who is unemployed, living on savings and hand-outs, and difficult to find employment. Any assistance in diapers, groceries (unexpired) is appreciated.",
    "specifications": "Large sized",
    "contact": {
      "org": "Fei Yue Community Services - Mental Health",
      "name": "Shah Sangeeta Subejan",
      "email": "sangeetashah@fycs.org",
      "phone": [
        "66619499",
        "64712022"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139739",
    "category": "Medical Aids",
    "name": "Adult diaper M size",
    "description": "Client is an elderly lady who lives alone, with little social support and estranged relationship with her family. She is on Public Assistance as she is permanently unfit for work due to multiple chronic conditions. She was recommended by doctors to purchase adult diapers due to poor bladder control but is unable to afford daily supply. She will appreciate kind donation of adult diaper pants size M.",
    "specifications": null,
    "contact": {
      "org": "Fei Yue Family Services SSO @ Taman Jurong",
      "name": "Chan Yvonne",
      "email": "yvonne-chan@fycs.org",
      "phone": [
        "69783516",
        "62672900"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139735",
    "category": "Medical Aids",
    "name": "Adult diapers",
    "description": "An elderly woman is taking care of her husband, who has dementia and has suffered a mild stroke, leading to incontinence. As a result, he needs frequent diaper changes every day. Unfortunately, they are both unemployed and struggling financially. The woman is kindly asking for help in getting FairPrice XL-sized adult diapers pants, as the ongoing expense has become a significant burden for them.",
    "specifications": "XL",
    "contact": {
      "org": "Fei Yue Community Services - Mental Health",
      "name": "Chris Tan",
      "email": "tanyonghong@fycs.org",
      "phone": [
        "96424877",
        "64712022"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "18 Nov 2024"
  },
  {
    "id": "139664",
    "category": "Medical Aids",
    "name": "Tena Value Adult Diapers [Size: L, 4 packs]",
    "description": "Client is low-income earner and sole breadwinner of household of 5. His wife was recently diagnosed with muscle-related condition, which caused the weakening of muscles that led to continence issues. She is now heavily reliant on diapers. Family would require diapers' support as client is unable to sustain the high needs. \n\n\nBrand: Tena\nSize: L\nQuantity: 4 packs",
    "specifications": null,
    "contact": {
      "org": "Allkin Family Service Centre @ Cheng San 445",
      "name": "Fahmi Bin Jazid",
      "email": "fahmi@allkin.org.sg",
      "phone": [
        "64546678",
        "64578559"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "15 Nov 2024"
  },
  {
    "id": "139588",
    "category": "Medical Aids",
    "name": "Tena adult tape and pants diapers (L)",
    "description": "Beneficiary has rheumatoid arthritis and had a stroke in March 2024. She is living alone and needs underpad (Large), diapers (XL) . They will help to alleviate her financial burden due to its high costs.",
    "specifications": "L size, 3 quantities",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139587",
    "category": "Medical Aids",
    "name": "Pharmaforte Super absorbent underpad (XL)",
    "description": "Beneficiary has rheumatoid arthritis and had a stroke in March 2024. She is living alone and needs underpad (Large), diapers (XL) . They will help to alleviate her financial burden due to its high costs.",
    "specifications": "3 quantities",
    "contact": {
      "org": "THK Family Service Centre @ Bukit Panjang",
      "name": "Muhammad Idris Bin Mohd Margono",
      "email": "idris.margono@thkmc.org.sg",
      "phone": [
        "87145182",
        "67671740"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  },
  {
    "id": "139457",
    "category": "Medical Aids",
    "name": "Kyndle 100% Pure Water Wet Wipes",
    "description": "Client had a relapse with metastatic breast cancer and is unfit for work. She was a breadwinner for her husband who is also unemployed and on dialysis treatment. She is still on treatment and requires multiple changes of diapers daily.",
    "specifications": "80 sheets",
    "contact": {
      "org": "AIN Society",
      "name": "Nur'Ain Binte Mohamed Said",
      "email": "nurain@ainsociety.org.sg",
      "phone": [
        "68485116",
        "68485166"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139439",
    "category": "Medical Aids",
    "name": "Tena adult diapers (pants, size L)",
    "description": "Single mother staying in Woodlands rental flat with multiple health conditions (kidney disease stage 5, diabetes, high BP, high cholesterol) is in need of Tena adult diapers (pants, size L). She is on diaper pants full-time as she is unable to control her bowels. She is on kidney dialysis 3x/week. The family is relying on financial assistance for their daily needs.",
    "specifications": null,
    "contact": {
      "org": "MSF Social Service Office @ Woodlands",
      "name": "Sarrani Krishnan",
      "email": "sarrani_krishnan@msf.gov.sg",
      "phone": [
        "91782934",
        "67660097"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "08 Nov 2024"
  },
  {
    "id": "139425",
    "category": "Medical Aids",
    "name": "Stoma bag",
    "description": "Cancer patient requires stoma bag supply as he has run out of it. Stoma bags are costly, and he is unable to afford.",
    "specifications": "SenSura Ostomy bag, 15-43mm, Maxi, REF 15206",
    "contact": {
      "org": "Singapore Cancer Society",
      "name": "Tan Wen Shi",
      "email": "wenshi_tan@singaporecancersociety.org.sg",
      "phone": [
        "1800-727-3333",
        "62219578"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "07 Nov 2024"
  },
  {
    "id": "140052",
    "category": "Kitchen Utility Items",
    "name": "Stove Rack",
    "description": "Client, is low vision, under SSO ComCare assistance. He is requesting a stove rack to replace his spoilt rack as he can’t afford to buy one, currently he is using a table and placed his stove on top of the table.",
    "specifications": "length approximately 75cm, width approximately 45cm",
    "contact": {
      "org": "Singapore Association of the Visually Handicapped",
      "name": "Steven Yew Kwok Wai",
      "email": "steven@savh.org.sg",
      "phone": [
        "62514331ext507",
        "62514331"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "27 Nov 2024"
  },
  {
    "id": "139831",
    "category": "Kitchen Utility Items",
    "name": "Gas Stove (2 burner)",
    "description": "widowed senior residing alone in 2 room flat requires a gas stove. Shopee is available with installation. Search under ''CROWN 318 TABLE TOP GAS COOKER (TG/LPG). INSTALLATION AVAILABLE''.",
    "specifications": "71x37x11",
    "contact": {
      "org": "Tsao Foundation - Hua Mei Clinic",
      "name": "Ryan Sim",
      "email": "ryansim@tsaofoundation.org",
      "phone": [
        "65939576",
        "66619545"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "20 Nov 2024"
  },
  {
    "id": "139577",
    "category": "Kitchen Utility Items",
    "name": "Kitchen Cabinet",
    "description": "Member (F/19) has a 3-month-old infant. She recently moved to a one-room rental flat with her infant. She does not have financial means to purchase a kitchen cabinet and hopes to be able to receive one to store their kitchen items.",
    "specifications": null,
    "contact": {
      "org": "South Central Community FSC Ltd",
      "name": "Quak Mei Qing",
      "email": "meiqing@sccfsc.org.sg",
      "phone": [
        "64619200"
      ]
    },
    "deliveryCostsCoveredByDonor": true,
    "date": "13 Nov 2024"
  }
]